{
    "jobs": [
        {
            "dueDate": "2023-04-15",
            "jobTitle": "Software Application Support Executive(Inventory Management and Accounting Software co)",
            "skills": [
                "Fortinet",
                "Citrix",
                "Inventory",
                "Windows Server",
                "Accounting",
                "Networking",
                "Remote Desktop",
                "Virtual Server",
                "Training the End Users",
                "Trouble shooting",
                "Windows Server Hyper-V",
                "Technical Support"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "RECRUITMENT ALLIANCE"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Our client: A 2 decades old profitable and dynamic industry pioneer, specialised in inventory and accounting software for diverse industries. Job scope: (1)Troubleshoot software application issues on a virtual server, windows server n  desktop (2)To set up ,maintain, provide end user with technical support  of accounting and inventory software   Requirements: -Diploma up in Information Technology or networking -Experience with setup ; maintenance of windows servers, virtual machines (HyperV, Citrix), remote desktop, Fortinet firewall -Possess Experience in implementation ; technical support of accounting or inventory software and accounting knowledge will be an added advantage Work Location: Eunos Please submit resumes to michelle@careersg.sg with the following details in MS Word format: - Position applying for - Current remuneration - Expected remuneration - Notice period Michelle Goh EA License No : 22C1142 We regret that only shortlisted candidates will be notified.",
            "datePosted": "2023-04-01",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-application-support-executive-recruitment-alliance-fddbef73553a10e1e55d0818df1754d7?source=MCF&event=Search",
            "uuid": "301779d3-19e6-4f5d-8423-bdb70e4fa4bd"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Implementer (Accounting Software)",
            "skills": [
                "WMS",
                "Technical Assistance",
                "Warehouse Management",
                "Ability To Work Independently",
                "Interpersonal Skills",
                "Business Process Analysis",
                "Microsoft SQL Server",
                "Vehicles",
                "Data Migration",
                "Verbal Skills",
                "Customer Management",
                "Team Player",
                "Creative Thinking",
                "Disability Insurance",
                "Ability To Learn"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "30 KALLANG PLACE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/7783ae5061c808d309a1033601e6c0c2/info-tech-systems-integrators.jpg",
                "name": "INFO-TECH SYSTEMS INTEGRATORS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Provide support to end users on enquiries to Accounting Software via phone/email/remote assistance   Provide both on-site/ off-site software technical assistance, troubleshoot and resolve issues   Perform data migration works   Conduct product (Accounting Software) training to end users   Involve in ad-hoc projects, pre-implementation discussions   Resolve customer technical issues in a timely ; professional manner   Requirements    Candidate must possess at least a Diploma or relevant qualifications equivalent to the field   Minimum 3 years or above in the related field   Strong communication and interpersonal skills   Self-motivated and results driven   Focused and goal-oriented   Proactive team player with the ability to work independently.   Ability to work under pressure in a fast-paced working environment.   Responsible work attitude with a positive and cheerful personality.   Candidates who can start work immediately or within short notice will be advantaged.  Please forward a detailed resume indicating your current/last drawn and expected salary, reason for leaving last employment.  We regret only shortlisted candidates will be notified. Singapore Data Protection - https://www.info-tech.com.sg/data-protection-policy",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4500,
                "minValue": 3300,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/customer-service/software-implementer-info-tech-systems-integrators-ec49a34666f30e3f74cb4a3f872c837a?source=MCF&event=Search",
            "uuid": "830afd54-8d75-4d86-a096-1d79630f8638"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Software Engineer / Software Developer / Analyst Programmer",
            "skills": [
                "Desktop applications",
                "PHP",
                "PostgreSQL",
                "Software Engineering",
                "Application Development",
                "JavaScript",
                "HTML/CSS",
                "SDLC",
                "Web Technologies",
                "Software Development Life Cycle",
                "SQL",
                "C Programming",
                "Mobile Applications",
                "Web Applications",
                "Team Player",
                "Java",
                "Microsoft .NET",
                "Software Development",
                "Able To Work Independently",
                "Agile Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE SYNERGY, 1 INTERNATIONAL BUSINESS PARK"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/330f7bc52a59dc66e32e06c79978d2d4/openfeel.png",
                "name": "OPENFEEL PTE. LTD."
            },
            "jobType": [
                "OTHER",
                "FULL_TIME"
            ],
            "description": "The successful candidate will be working closely in teams and/or independently on business software or general software development projects. The individual will have good exposure to different phases of the software development cycle, for development of web applications or desktop applications or mobile applications. Qualifications and Qualities: • Knowledge in C/C++, web and database technologies is required • Knowledge in .NET/Java/PHP/MySQL/Postgres is preferred • Able to work independently and as a team • Strong background and keen interest in software development. Willing to learn and pick up new skills as required At OpenFeel, we believe in assisting individuals to develop themselves in their professional capacity and be capable of managing their own performance. We encourage our staff to actively contribute to the improvement of their work and operation. We are looking for committed, driven and open minded individuals to join us. We invite you to join our development team. If you are interested, please submit your application at http://www.openfeel.com/career.php. Kindly note that due to overwhelming response, only short listed candidates will be informed. Additional Tags: Software programming, software coding, mobile app development, mobile app programming, desktop app    development, desktop app programming, web app development, web app    programming, web portal development, web portal programming, software    application development, software application programming, web    technologies, mobile technologies, desktop technologies, SDLC, Agile    development, rapid application development, RAD",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4500,
                "minValue": 2000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/consulting/software-engineer-software-developer-analyst-programmer-openfeel-773117b2fc215ef85ab2a5db9877993b?source=MCF&event=SuggestedJob",
            "uuid": "d619a18c-34ac-43d6-ae2f-dbe2ae0a7300"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Engineer",
            "skills": [
                "CSS",
                "Software Engineering",
                "MySQL",
                "Software Documentation",
                "Agile",
                "JavaScript",
                "SQL",
                "Requirements Analysis",
                "Python",
                "Java",
                "C#",
                "API",
                "Databases",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "APPLIED MATERIALS BUILDING, 8 UPPER CHANGI ROAD NORTH"
            },
            "company": {
                "logo": null,
                "name": "APPLIED MATERIALS SOUTH EAST ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Key Responsibilities    Develops code for moderately difficult software projects.  Design and implement bug fixes.   Designs moderately difficult software projects.   Develops software documentation.   Troubleshoots a variety of moderately difficult software problems.  Performs software tests on code and enhancements.  Defines software specifications.   Interfaces with external customers regarding software issues   Interfaces with internal customers for requirements analysis and schedule.   Compiles data for regularly scheduled or special reports, analysis and statements. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7400,
                "minValue": 3700,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-applied-materials-south-east-asia-29e1d4ca4c1b3837b49f43779245fa23?source=MCF&event=Search",
            "uuid": "1bfd344e-1362-474e-aefc-3d4d659fd1ce"
        },
        {
            "dueDate": "2023-04-21",
            "jobTitle": "Software Tester",
            "skills": [
                "TestNG",
                "UAT",
                "Manual Testing",
                "Ability To Work Independently",
                "Quality Assurance",
                "Agile",
                "Information Technology",
                "Test Cases",
                "Test Automation",
                "Attention to Detail",
                "Python",
                "Software Testing",
                "Writing",
                "Continuous Integration",
                "Testing Process",
                "Selenium",
                "Business Analyst",
                "Java",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/adba3039c02bc57d3de1081b5988c383/kydon-holdings.png",
                "name": "KYDON HOLDINGS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "We are seeking a skilled and detail-oriented Software Tester to join our team. The successful candidate will be responsible for ensuring the quality and functionality of our software products. The Software Tester will work closely with our development team to identify and report any bugs, errors, or issues with our software. This role requires excellent problem-solving skills, attention to detail, and a passion for delivering high-quality software products. Key Responsibilities:    Develop and execute test cases, test plans, and test scripts to ensure the quality and functionality of our software products.   Collaborate with the development team to identify, diagnose, and report software bugs, errors, and issues.   Analyze and interpret software requirements to ensure that they are testable and meet quality standards.   Participate in all aspects of the software development life cycle, including design, development, testing, and deployment.   Use automated testing tools to streamline the testing process and increase efficiency.   Maintain accurate and detailed records of test results, defects, and other issues.   Communicate and collaborate with cross-functional teams to ensure that software products meet business and user requirements.   Participate in continuous improvement initiatives to enhance the quality and efficiency of the testing process.   Work with the DevOps Engineers to test software products running on on-prem solutions in the customer’s user environment.  Qualifications:    Bachelor's degree in Computer Science or a related field.   Proven experience as a Software Tester or similar role.   Strong knowledge of software testing methodologies, tools, and processes.   Familiarity with programming languages such as Java, C++, Python is a plus.   Experience with automated testing tools such as Selenium, TestNG is a plus.   Excellent problem-solving skills and attention to detail.   Strong communication and collaboration skills.   Ability to work independently and as part of a team.  If you are passionate about software testing and have the skills and experience we are looking for, we encourage you to apply for this exciting opportunity.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-tester-kydon-holdings-4b010ea0b13ef65d61195742250d856e?source=MCF&event=Search",
            "uuid": "8f3833e3-b5e8-43e9-9790-491a195bcaac"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "software developer",
            "skills": [
                "iOS",
                "Azure",
                "Design Patterns",
                "Unit Testing",
                "VMware",
                "OpenCV",
                "Visual Development",
                "Xen",
                "OpenStack",
                "Network Design",
                "Load Balancing",
                "SQL",
                "Python",
                "OOAD",
                "Web Applications",
                "KVM",
                "Debugging",
                "Software Development",
                "C++",
                "Technical Design"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "RIGEL INNOVATION CENTRE, 20 CHANGI BUSINESS PARK CENTRAL 2"
            },
            "company": {
                "logo": null,
                "name": "N8XT AEROSPACE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Summary In the role of a Software Engineer, you are responsible for the design, development, testing, deployment and maintenance of software applications mission-critical safety and security surveillance that are to be deployed in an operational environment.  Depending on the specific assignment, you will design and build innovative applications and solutions in one of the following areas: · Vision Software · Integration of -   advanced environment sensing equipment   equipment health monitoring and support systems for critical system functions · Adaptive software processes, and/or deep learning.  Main Responsibilities    Write, modify, debug, test and troubleshoot software code using source code debuggers and visual development environments to create single-threaded, multi-threaded or user interface event driven applications, either stand-alone and those which access servers or services   Analyse, design, review, implement, integrate, test and deploy software applications   Write technical design and associated design documentation   Track and manage the software code over its development cycle   Coordinate team activities with lateral teams across disciplines (e.g., QA) and vertical groups (e.g. project delivery teams), and upwards with project management elements   Ensure conformance to quality processes and practices  · Participate in the specification of product functions and interfaces · Design and building of solutions, frameworks, automation, and orchestration for a broad range of applications and infrastructures, for cloud, mobile, and desktop    Travelling maybe required from time to time  Skills and Experience · 3+ years hands-on experience in software development · Strong debugging skills to understand existing Source Code independently · Well-versed in:   Visual Studio   Python   C++   OpenCV   SQL Server · Experience in:   Developing real-time web applications   System interface design and human factor engineering   Building and integrating modules for large-scale software systems   Hands-on Unit Testing   Hands-on Integration Testing   Image Processing Software Development   Database design and performance tuning · Knowledge of (as a plus):   OOAD Design (Object Oriented Analysis Design)   Software/web architectures and design patterns   Inter-Process Communication   Networking, TCP/IP, load balancing and scaling   Virtualization Technology/Platforms such as VMware, Xen, KVM, OpenStack, Cloud Stack, Azure Stack   iOS and Andriod platforms   Cloud orchestration, configuration management and auto-scaling methodology is a plus   Matlab Minimum Qualifications · Min. Degree/Masters in Information Technology, Computer Engineering, Communications Engineering, or equivalent qualification · Practical experience in:   Software development life cycle and quality assurance methodologies   Code management Attributes · Good technical writing and presentation skills · Critical thinking and problem-solving skills · Strong interest and awareness of new technologies · Proactive with good time-management skills · Good interpersonal, analytical and communication skills; · Ability to:   Multi-task, prioritize activities, work independently and calmly under pressure   Interact positively, clearly and professionally with peers, customers and vendors   Anticipate and take proactive actions The Ideal Candidate · You possess big picture thinking and a willingness to learn and dive into unfamiliar systems and resolve complex issues both from a business and technical perspective Salary Range · SGD 3.5k – SGD 4.8k",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4800,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/design/software-developer-n8xt-aerospace-3c2da112dc30e2919fb8e724ab9dee2e?source=MCF&event=Search",
            "uuid": "3c733b77-6d4a-4bf2-9f33-db4cb534f3ce"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Engineer",
            "skills": [
                "UML",
                "Technical Documentation",
                "Troubleshooting",
                "Web Programming",
                "Multithreading",
                "Modeling",
                "MySQL",
                "Drawing",
                "Unix",
                "Windows",
                "Integration Testing",
                "Java",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/189ed670ccfa9dcd051769b47be0dcf8/flintex-consulting.jpg",
                "name": "FLINTEX CONSULTING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Scope ; Responsibilities  • Involves in AFC system software development, tool development, support and maintenance of software. • Responsible for software delivery, integration testing, deployment, create ; maintain technical documentation regarding design documents, interface specifications, operational drawing, user guides etc. • Issue investigation, troubleshoot, software patch and upgrade. • Competent in use and management of all internal and third-party test tools, create and maintain test plans. • Provide critical technical feedback on product specifications, features and payment structure and general industry standards.  Requirements  • Recognized tertiary qualification in Computer Engineering/Electronics Engineering/Computer Science or related discipline. • Proficient in C++, Java programming with at least 5 years of programming experience. • Proficiency with database management system such as MySQL and DB2. • Experience in web programming on UNIX / LINUX and Windows environment. • Experience in multi-threading, object-oriented programming, Spring Boot framework, UML modeling and message queue. • Experience in troubleshooting script or application when issue encountered during testing, e.g. programming/scripting knowledge. • Relevant knowledge EMV payment standard will be an added advantage. • Self-initiated, proactive, good communication and interpersonal skills. • Strong analytical and problem-solving skills. • Good written and verbal communication skills. • Resourceful and self-motivated team player with a positive work attitude. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-flintex-consulting-6f92ae2128a4f03a9f5112875272979d?source=MCF&event=Search",
            "uuid": "38725445-56eb-48a8-8588-01014cc07d9e"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Engineer",
            "skills": [
                "MongoDB",
                "ReactJS",
                "Cyber Security",
                "Unit Testing",
                "Software Engineering",
                "MySQL",
                "Documentation Skills",
                "Bootstrap",
                "JavaScript",
                "Python",
                "Apache Tomcat",
                "Docker",
                "Integration Testing",
                "Github",
                "Databases",
                "React.js",
                "jQuery",
                "Technical Design"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "80 UBI AVENUE 4"
            },
            "company": {
                "logo": null,
                "name": "CUSTODIO TECHNOLOGIES PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities:  • Work closely with researchers to develop cybersecurity products. • Adopt and build up the knowledge to be a domain expert in a specific field of cybersecurity • Participate in technical design reviews, integration, testing and documentation effort. • Develop effective solution/design/code/unit test. • Write APIs • Troubleshoot, debug and upgrade software • Create security and data protection settings • Documentation  Skills:  • Minimum 2-3 years’ experience as software developer • Familiarity with common stacks. • Front-end Frameworks (React, Next.js, jQuery, Bootstrap). • Web Servers (IIS, NGNIX, Apache TomCat). • Databases (MongoDB, MySQL). • Experience in any one programming languages (Nodejs, Python, C#). • Unit Testing (Supertest, Pytest). • Containerization (Docker). • Source Control (GitHub). • Excellent analytical, teamwork and communication. • Organized and ability to properly document software. • Cyber security experience is an added advantage. • Bachelor’s degree or equivalent in Computer Engineering/Science preferred.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/sciences/software-engineer-custodio-technologies-4fdb17f75a098331347fe6de495fa690?source=MCF&event=Search",
            "uuid": "ff8efc5a-6bc3-4075-ac83-de6b4369fdb9"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "SOFTWARE ENGINEER ",
            "skills": [
                "Ability To Work Independently",
                "Interpersonal Skills",
                "Software Engineering",
                "JavaScript",
                "Electrical",
                "Building Services",
                "Protocol",
                "SCADA",
                "SQL",
                "Python",
                "Integration Testing",
                "Java",
                "Commissioning",
                "Software Development",
                "Building Management Systems"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "GPC SERVICES & ENGINEERING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Programming Supervisory Control ; Data Acquisition (SCADA) software for building services (ACMV,Electrical, Lift etc)   Programming Programmable Digital Controllers (PLC), Direct Digital Controllers (DDC)   Attend project meetings, liaise with relevant parties to get development requirements and document them accordingly   Perform integration testing,commissioning and end user training   Basic knowledge in digital control (logic blocks, digital gates, programming etc)   Ability to work independently, as well as in a team ; Good interpersonal skills   Experiences in Integrated Building Management Systems (IBMS) will be an added advantage   Experiences in industrial communication protocol such as BACnet, Modbus, OPC   Candidate must possess at least a Bachelor Degree /Post Graduate Diploma in Computer/Electrical/Electronic Engineering or equivalent   Prefer 2 years of working experience in related fields   No experience is welcome, training provide ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3700,
                "minValue": 2900,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-gpc-services-engineering-8f9996baab4b3a4263aa8948ba98a5a1?source=MCF&event=Search",
            "uuid": "a2f23265-e5e3-45ef-a4f7-0af3462d052c"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "senior Software Engineer",
            "skills": [
                "Git",
                "Troubleshooting",
                "Software Engineering",
                "MySQL",
                "Agile",
                "JavaScript",
                "SQL",
                "JIRA",
                "Python",
                "Architecture Design",
                "Java",
                "C#",
                "API",
                "Databases",
                "Software Development",
                "Agile Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "RB CAPITAL BUILDING, 22 MALACCA STREET"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/3f3a1b99f9611bc0efa09419acc2be56/nanosoft-business-systems.jpg",
                "name": "NANOSOFT BUSINESS SYSTEMS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Experience in managing software development life cycle   Experience in managing a software team and guiding juniors   Experience in software development   Knowledge of more than 1 software programming language   Experience in software architecture design   Experience in bugs/issues troubleshooting   Experience in Software Development Tools (Jira, Git, etc)   Preferable to have knowledge in database systems (MS SQL, Postgres, etc)   Preferable to have agile development knowledge ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer-nanosoft-business-systems-4c57db4310673540611f4c47b93954dc?source=MCF&event=Search",
            "uuid": "cf788af6-927e-4a7b-af0a-d707ded7b9a5"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Testing Engineer",
            "skills": [
                "Performance Testing",
                "Automation Testing",
                "Software Engineering",
                "Agile",
                "Scripting",
                "Test Cases",
                "Test Automation",
                "JIRA",
                "Python",
                "Software Testing",
                "Writing",
                "Selenium",
                "Java",
                "Software Development",
                "Test Management"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/cc438f6df777519019475e9299375366/sparkle-networks.png",
                "name": "SPARKLE NETWORKS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Key Responsibilities:    Meeting with Development Managers to discuss software specifications and controls.   Designing manual and automated test procedures   Building, coding, and implementing software evaluation test programs.   Running test programs to ensure that testing protocols evaluate the software correctly.   Finalizing and documenting testing procedures.   Completing final tests and creating test reports.   Presenting test reports to management and suggesting software fixes.  Requirements:    Bachelor’s degree in computer science, software engineering, or similar field.   2 years’ work experience as a software testing engineer.   Experience in WEB/H5/APP function testing   Familiar with interface testing tools and interface testing methods   Experience in automated testing and performance testing is preferred.   Strong learning ability, seek continuous breakthrough and innovation   Effective communication and coordination skills with strong sense of responsibility  Salary will be commensurate with qualifications and experience.  For more information on our company, please visit http://sparkle.com.sg/",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4500,
                "minValue": 3600,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/software-testing-engineer-sparkle-networks-d0a20568030ee3dc29e972d01f37853f?source=MCF&event=Search",
            "uuid": "0b647145-7065-431a-83d2-4292325d4431"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Senior Software Engineer",
            "skills": [
                "Requirements Gathering",
                "Web Programming",
                "JavaScript",
                "ETL",
                "Unix",
                "IBM DB2",
                "SDLC",
                "JDBC",
                "Business Objects",
                "Servlets",
                "Windows",
                "Continuous Integration",
                "Linux",
                "Software Development",
                "Agile Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/189ed670ccfa9dcd051769b47be0dcf8/flintex-consulting.jpg",
                "name": "FLINTEX CONSULTING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The activities required to be performed shall include the following:   Requirements gathering;  Design, development and maintenance of the software;  Preparation and submission of deliverables throughout the software development lifecycles such as Business Rules, Software Requirement Specifications, Software Architecture Document, Design Specification, Interface Specifications, Source Codes, Testing Specification, Operation and Maintenance Manual, Training Manual and others documents as required in the standard adopted by the Authority;  Assist the Authority with day-to-day application support issues; and  Liaise with users on the requirement, design and testing issues.  (b) Qualifications ; Requirements:   Recognised degree / graduate diploma in Computer Science, IT or related engineering with at least 5 years’ relevant experience in software development;  Gone through at least one full software development lifecycle (SDLC) with experience in producing SDLC documentations;  Extensive experience in analysing requirements, designing, development and delivering complex enterprise applications in Java/JEE, web programming on UNIX / LINUX and Windows environment;  Extensive experience in web based applications development (EJB, Servlets, javascript) and database application interfacing (JDBC, SQL) in Websphere Application Server and IBM DB2;  Extensive experience in database design, development and performance tuning;  Extensive experience in Automatic Fare Collection (AFC) system  Experience in Enterprise Service Bus (ESB) and REST;  Experience in Agile development methodology and continuous integration;  Extensive Experience in Business Intelligence tool - Business Objects, IBM Cognos; and ETL tool - Data Stage  Knowledge on Data warehouse concepts will be an advantage;  Strong analytical and problem-solving skills; and  Good written and verbal communication skills.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer-flintex-consulting-7160f44c8c0e087dae93394607bd00c0?source=MCF&event=Search",
            "uuid": "4d3d27c5-a82d-4db3-ace1-5580a08c3f36"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software System Engineer",
            "skills": [
                "Performance Testing",
                "Troubleshooting",
                "Web Design",
                "Kubernetes",
                "Application Servers",
                "Software Engineering",
                "Scripting",
                "Test Cases",
                "Reliability",
                "Python",
                "Orchestration",
                "System Deployment"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/ed52fe36990ce2e72df49ad94b6e31cc/red-dot-analytics.png",
                "name": "RED DOT ANALYTICS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Red Dot Analytics is looking for a Software System Engineer to join our team. The ideal candidate will be responsible for deploying, testing, maintaining, and integrating software systems. This role will work closely with the development team to ensure software quality, reliability, and performance. Responsibilities    Deploy and test software systems to ensure functionality and quality.   Develop and maintain system documentation and test cases.   Collaborate with the development team to integrate software components.   Troubleshoot and resolve system issues.   Conduct system performance and reliability testing.   Monitor system performance and implement improvements as needed.  Qualifications    Bachelor's degree in Computer Science, Software Engineering, or a related field.   Proven experience in software system deployment, testing, and maintenance.   Experience with programming and scripting languages, such as Python and Bash   Familiarity with DevOps practices and tools   Experience with system monitoring and performance testing tools.   Experience with cloud platforms such as AWS and containerization technologies like Kubernetes (k8s).   Knowledge in IoT or digital twins will be a plus.   Excellent problem-solving and troubleshooting skills.   Strong communication and collaboration skills.  Benefits    Competitive salary and benefits package.   Opportunity to work with cutting-edge technologies and projects.   Collaborative and dynamic work environment.   Opportunities for growth and career development.  About Red Dot Analytics Pte Ltd: Red Dot Analytics (RDA) Pte. Ltd., is a deep tech spin-off from Nanyang Technological University (NTU) Singapore that are pioneers in the industrial AI space. We envision to transform the applications of AI solutions to digitalise, optimise and automate physical operations and systems for businesses and organisations, beginning with data centres as our beachhead market. Our company is known for its award-winning cognitive twin solution and has been working with well-known data centre operators in the APAC market, ranging from hyperscale to colocation and enterprise data centre customers. Red Dot Analytics was co-founded by a team of professors and researchers from NTU and industry veterans from the infrastructure sectors. For more information, please visit www.rda.ai",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-system-engineer-red-dot-analytics-b61890d6581a3c586513da2d842f2f5a?source=MCF&event=Search",
            "uuid": "52e1097c-c81a-4513-9670-dd0cb57a9663"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Software Implementation/Business Development Intern (6 Months)",
            "skills": [
                "Commodity",
                "Microsoft Office",
                "Business Process Analysis",
                "Microsoft SQL Server",
                "PowerPoint",
                "Enterprise Software",
                "Windows Server",
                "Operating Systems",
                "Accountability",
                "Facilitation"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "20 UBI CRESCENT"
            },
            "company": {
                "logo": null,
                "name": "APTIV8 IT SOLUTIONS PTE. LTD."
            },
            "jobType": [
                "OTHER"
            ],
            "description": "Job Description - Lead generation to gain new/potential projects. - Supporting clients on existing projects - Writing quotations - Liaising with clients and collaborating with different internal departments - Conducting training sessions to client - Supporting partners on site  Job Requirements - Able to work in fast-paced environment - Possess good interpersonal skills - Good communication and writing skills - Proficient in Microsoft Office (Word, PowerPoint, Excel) - Basic data skills - Good organization and management skill",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 1200,
                "minValue": 800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-implementation-business-development-intern-aptiv8-solutions-28b6482a72398ce95289553fa5b1a0df?source=MCF&event=SuggestedJob",
            "uuid": "980ec0d9-be07-437e-bfb0-31fff1dc16cf"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Architect",
            "skills": [
                "Service Design",
                "Troubleshooting",
                "Technology Architecture",
                "Design Patterns",
                "Architect",
                "Architectural",
                "Application Development",
                "SDLC",
                "Open Source",
                "Agile Methodology",
                "Writing",
                "Angular",
                "Java",
                "API",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TONG ENG BUILDING, 101 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "DEZIRE TECHNOLOGIES PTE. LTD."
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "Key responsibilities:     Writing outstanding code that follows best practice and is secure from inception    Actively participate in the end-to-end life cycle for the entire application, stack from conception to deployment    Working with the Platform team, and vendors where needed, to drive high quality application development    Support troubleshooting and implementation of solutions for any issues identified during QA and production use    Contribute to the continuing maturing of the software development process, advising and driving best practice    Help identify opportunities by understanding the current and future requirements of the internal and external users    Help estimate resource requirements and evaluate prioritisation metrics for projects according to the Business priorities    Key Requirements     More than 6+ years’ hands on experience as a full stack developer    Expert programming skills in Java and Angular    A broad set of technology skills in Java technologies, micro service design patterns, Open Source libraries and frameworks, and technology architecture concepts    Experience in architecting and developing performant and secure back-end Java applications    Experience in architecting and developing rich front-end applications using the latest technologies    Able to architect and develop flexible and extensible API layers, including extensive experience in writing code that interacts with external systems via API   Experience developing in a cloud environment, utilising the latest cloud technologies for both application development as well as execution    In depth understanding of SDLC and agile methodology, having led or participated in sprint based work  ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-architect-dezire-technologies-4797cf99148fd3f22a76caffc895fae8?source=MCF&event=Search",
            "uuid": "069d363f-b7cb-4d23-b396-9cc512601d6e"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Engineer",
            "skills": [
                "Negotiation",
                "Management Skills",
                "Data Analysis",
                "Mathematics",
                "Software Engineering",
                "Scripting",
                "JavaScript",
                "Investment Management",
                "Quantitative Finance",
                "SQL",
                "Foreign Exchange",
                "Conflict Management",
                "OOP",
                "Team Player",
                "Java",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "UOB PLAZA, 80 RAFFLES PLACE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/7afc587c2072deff7f1f1fd8189010c1/investment-company-peoples-republic-china.jpg",
                "name": "INVESTMENT COMPANY OF THE PEOPLE'S REPUBLIC OF CHINA (SINGAPORE) PTE LTD"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Investment Company of the People’s Republic of China (Singapore) Pte Ltd is a fully owned subsidiary of the People’s Bank of China. The company manages a part of foreign exchange reserve within the scope authorized by the People’s Bank of China, undertakes and transacts various kinds of investment businesses.  Job Description:    Work closely with the business for development of investment management functionalities, ensure the quality of deliverable for the work assigned;   Participate in the full RAD/Agile projects and also maintenance/ support post implementation;   Involved in analysis and scripting SQL queries for data analysis and data extraction, implement new regulatory changes, create new reports etc.;   Collaborate with internal technical team/users in investigating, testing and together providing delivery solutions;   Perform coding, implementation, integration, deployment, documentation and user guide of IT application systems;   Work with IT teams and senior management, regular reporting to management.   Requirements:    At least 5 years of IT experience in driving enterprise-wide projects;   Deep understanding with Software engineering, OOP, Database, OS and Network fundamentals.   Experience in C#/Python language and framework, SQL Developer, B/S projects, Strong skills in coding.   Experience in investment or financial sector, basic understanding of financial products and quantitative finance mathematics;   Good communication, negotiation, problem-solving, conflict management skills, Independent and proactive yet a strong team player;   Ability to interact with business users, senior management, IT teams effectively.   We offer a competitive salary which commensurate with experience, or beyond the stated salary range for unicorns.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10000,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-investment-company-peoples-republic-china-3f1b7b2abbbcb86d63f4d25acf9b0c38?source=MCF&event=Search",
            "uuid": "037b8b1a-8f0a-4ddb-b355-92a0d5420aec"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Developer",
            "skills": [
                "Aesthetics",
                "Usability",
                "CSS",
                "Visual Design",
                "HTML",
                "User Experience",
                "JavaScript",
                "UI",
                "Design Strategy",
                "C#",
                "Layout",
                "Software Development",
                "Adobe Photoshop",
                "Ability to Prioritize",
                "Web Analytics"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TONG ENG BUILDING, 101 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "DEZIRE TECHNOLOGIES PTE. LTD."
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "Resonsibilities    Use coding to develop the aesthetics implemented within a website or product, from the layout menus and drop-down options to colors and fonts    Collaborate with back-end developers and programmers to improve usability and implement the desired design of product team in Sprints    Conduct testing of completed applications, websites and software to assess user experience and functionality of application front end     Create surveys for research through various social media platforms to gather feedback on user's ease of use and incorporate the findings in the development    Build storyboards to conceptualize designs and convey project plans to clients and management    Seek to enhance the user experience by creating seamless navigation through various digital programs and interfaces within the company    Combine interface design concepts with digital design and establish milestones to encourage cooperation and teamwork    Develop and establish UI coding standards and guidelines   Requirements     Bachelor’s Degree in Computer Science/Information Technology or any related disciplines.    7-15 years of demonstrated experience in creating and implementing UI development    Detailed experience with coding and the ability to troubleshoot and analyse websites using HTML, CSS and comparable languages    Experience working on UI frameworks - React, Material-UI, Vue js    Experience working with Google Web Analytics or comparable web analytics tool is a plus    Continued education and research into UI development trends and current design strategy and technology    Proficient with visual design programs such as Adobe Photoshop    Professional written and interpersonal skills    Ability to prioritize and manage multiple milestones and projects efficiently    Advanced problem-solving skills and the ability to optimize code for the best possible outcome    Experience creating code to client's personalized needs and requirements    Ability to work effectively in a collaborative environment to create top-performing interfaces ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 14000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-developer-dezire-technologies-d40ead66ab6451d7a0093be8f5f679f8?source=MCF&event=Search",
            "uuid": "79739096-468a-4b15-af23-3494f5092137"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Junior Software Developer",
            "skills": [
                "Excellent Communication Skills",
                "Microsoft Excel",
                "Struts",
                "Design Patterns",
                "Team Development",
                "Application Servers",
                "Enterprise Software",
                "SQL",
                "Java",
                "C#",
                "J2EE",
                "Software Development",
                "C++",
                "Hibernate",
                "Agile Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/189ed670ccfa9dcd051769b47be0dcf8/flintex-consulting.jpg",
                "name": "FLINTEX CONSULTING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Responsibilities   •\tWorks with multi-disciplinary team to understand system / application requirements. •\tAs part of a team, develops enterprise software solutions that meets client’s needs and perform as designed.   Requirements   •\tYou have at least a /Degree in Electrical/Electronic Engineering/Computer Sciences or any IT related field. •\tYou ideally have 1 year of experience or academic training in coding and software development.  •\tProficient in any one of the programming languages such as C, C++ OR Java. •\tGood understanding of the benefits of the various design patterns and object- oriented programming will be an advantage.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8500,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/junior-software-developer-flintex-consulting-63b01b9739fa172027351cba41ca0e14?source=MCF&event=Search",
            "uuid": "4e4fa50f-5b43-4416-88e5-7f51adb55610"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Project Manager",
            "skills": [
                "Excellent Communication Skills",
                "Leadership",
                "Scrum",
                "SDLC",
                "PowerPoint",
                "Product Management",
                "Project Management",
                "JIRA",
                "PMP",
                "Accountability",
                "Agile Scrum",
                "Excel",
                "Microsoft Word",
                "Agile Software Development",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "FRAMEWORK BUILDING, 2 ALJUNIED AVENUE 1"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/4f1ad24043be5c23620f0d0c60740975/karooooo-management-company.jpg",
                "name": "KAROOOOO MANAGEMENT COMPANY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibility    Work alongside the Group CEO and CTO to deliver world-leading products that fulfil Karooooo’s vision and mission.   Ensure that projects are delivered on-time, within cost and of excellent quality.   Initiate and drive detailed processes based on internal defined milestones to track progress, increase accountability and ensure projects are kept on track.   Communicate to product owners, marketing, engineering and senior leadership on goals, progress, and process efficiencies.   Seek improvements to improve the practice of product management at Cartrack to help drive hyper-growth at scale.   All other ad-hoc duties as assigned by Group CEO.  Requirements    Bachelor Degree in engineering or related area from 1st tier university.   5+ years of project management in software development environment.   Understand of Agile software development practices.   Understand full cycle of software development life cycle (SDLC)   Strong proficiency in Microsoft Word, Excel and PowerPoint. Jira a plus.   Strong organizational, project management and coordination skills to prioritize activities, manage conflicting needs, and deal with many issues at any given time.   Experience in the automotive/SaaS industry is a plus.   Excellent communication skills to work multiple types of stakeholders. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10000,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-project-manager-karooooo-management-company-64af5470ae4c329b385aed28d5ecf064?source=MCF&event=Search",
            "uuid": "31a0c49f-644e-465a-8a0d-31c9432cb8c8"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Senior Software Developer",
            "skills": [
                "Confluence",
                "Oracle",
                "Unit Testing",
                "Kotlin",
                "Agile",
                "Vue.js",
                "SQL",
                "JIRA",
                "Mobile Applications",
                "Docker",
                "Java",
                "C#",
                "Orchestration",
                "Databases",
                "React.js",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "71 AYER RAJAH CRESCENT"
            },
            "company": {
                "logo": null,
                "name": "NODEFLAIR PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "My Client is a pioneer in delivering the first large-scale contactless payment system in Singapore. You will collaborate closely with Product Owners, Business Analysts, and other team members as a Senior Software Developer. You will create and maintain functionalities to support the Transport and Payment ecosystem and legacy applications while working with a team of software specialists under the direction of the Head of Department, putting you at the forefront of the organization's change. Responsibilities:    Work in the Agile team and collaborate closely with Product Owners, Business Analysts, and other team members to accomplish shared objectives.   Engage in tasks like designing, task estimating, developing, unit testing, releasing, and supporting production.   Enhance the quality of the code and conduct code reviews.   Create and maintain automated unit test scripts, carry out unit testing, and verify requirements with stakeholders such as BA, users, and users.   Investigate and troubleshoot problems with mobile applications, microservices, and applications.   Continually investigate and experiment with new technologies that will help to increase technical efficacy.   Provide end users with instruction and documents to aid in the transfer of knowledge.  Requirement:    Preferably with a Degree in Computer Science/Information Systems or relevant field.   Experience in software development for more than three years.   Have knowledge/experience in Agile Process.   Knowledge of Java, C#, Vue.js, React.js, and Kotlin.   Experience in databases such as Azure SQL, Redis and Oracle.   Skilled with various technology stacks and tools, including the Spark or Spring Boot framework, Docker containers, orchestration tools, Elastic Search ; Kibana (ELK), Grafana, Jira, and Confluence.   It will be advantageous to have experience with or knowledge of the Payments domain (such as QR, payment flow), secured API/Web Service, OAuth security framework, and JWE/JWS.   Excellent interpersonal, multitasking, and organizational skills ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8000,
                "minValue": 6500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-developer-nodeflair-ceac838f93b36316d7b194eb93c1ad53?source=MCF&event=Search",
            "uuid": "eadf856f-002c-4e55-9745-741300c97633"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Reader Software Engineer",
            "skills": [
                "Technical Documentation",
                "Troubleshooting",
                "XHTML",
                "Embedded Linux",
                "Multithreading",
                "Software Engineering",
                "Drawing",
                "Vehicle Routing",
                "Software Testing",
                "Windows",
                "Team Player",
                "Integration Testing",
                "Java",
                "Commissioning",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/189ed670ccfa9dcd051769b47be0dcf8/flintex-consulting.jpg",
                "name": "FLINTEX CONSULTING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Scope ; Responsibilities  • Involves in application and tool development. • Responsible for software delivery, integration testing, deployment, commissioning, create ; maintain technical documentation regarding design documents, operational drawing, user guides etc. • Conduct testing of contactless medias and readers used in transit systems with good documentation. • Competent in use and management of all internal and third-party test tools, create and maintain test plans. • Provide critical technical feedback on product specifications, features and payment structure and general industry standards.  Requirements  • Tertiary qualification in Computer Engineering/Electronics Engineering/Computer Science or related discipline with at least 5 years of experience. • Proficient in C++, Java programming in Windows and Embedded Linux platforms. • Experience in multi-threading, serial communication, object-oriented programming. • Relevant knowledge in smart card/EMVco technology will be an added advantage. • Experience in software testing and troubleshooting. • Self-initiated, proactive, good communication and interpersonal skills. • Strong analytical and problem-solving skills. • Good written and verbal communication skills. • Resourceful and self-motivated team player with a positive work attitude. • Ability and willingness to take on multiple roles to fulfil project needs. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/reader-software-engineer-flintex-consulting-bd39c09ea36afa63e257146ed1e4c66f?source=MCF&event=Search",
            "uuid": "85b26a49-eb34-4e26-83d5-ee5de1778942"
        },
        {
            "dueDate": "2023-04-07",
            "jobTitle": "Software Engineer #64498",
            "skills": [
                "Staff responsibility",
                "Discipline",
                "Hardware",
                "Software Engineering",
                "Agile",
                "JavaScript",
                "Protocol",
                "Social Responsibility",
                "SQL",
                "Python",
                "TCP",
                "Java",
                "C#",
                "Screening",
                "Manufacturing",
                "Linux",
                "Software Development",
                "UDP",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/737b2bbd5f7b6aa4a3e393db45fe9479/ANRADUS%20PTE.%20LTD..jpg",
                "name": "ANRADUS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description    Industry/ Organization Type: Manufacturing and Production   Position Title:  Software Engineer/Firmware Engineer   Working Location: Kallang   Working Hours: 5 days (Monday to Friday, 9.00 am to 6.00 pm)   Salary Package: Up to $6000 + AWS + Variable bonus + Medical Benefits   Duration: 1-year contract (Convertible to Permanent Role)  Key Responsibilities    Maintain, improve, design and develop application software for car parking systems.   Must have hardware interface/firmware experience.   Any other duties as and when assigned.  APPLY NOW!!!    Diploma/Degree in Computer/IT, with 3-5 years relevant experience.   Knowledge in C/C++, Linux, R232 Protocol, TCP and UDP protocol and Digital I/O preferred.  Kindly apply through ANY of the following methods:    Submit your application by clicking the APPLY button;   Email your resume to Job(at)anradus.com.sg. Please indicate #64498 on the email subject.  Anradus Policy: This clarifies Anradus' working procedures, from receiving the applicant's resume, screening to shortlisting. We assure you our consultants will go through every resume we receive but we regret that only shortlisted candidates will be notified. Anradus Pte Ltd | EA License No. 20C0161 | Angel Lim | EA Reg No.: R1769781",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-64498-anradus-a88017811d2df78c4db393a80b1995df?source=MCF&event=Search",
            "uuid": "e5e8114a-3e53-4e8a-a581-1d8db2ac5513"
        }
    ]
}