{
    "jobs": [
        {
            "dueDate": "2023-03-28",
            "jobTitle": "Software Engineer, Backend",
            "skills": [
                "Information Retrieval",
                "MASSIVE",
                "UI Design",
                "Data Structures",
                "Natural Language Processing",
                "User Experience",
                "System Design",
                "Distributed Systems",
                "Demand Planning",
                "Networking",
                "Performance Tuning",
                "Systems Design",
                "Java",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "Google Asia Pacific, Singapore, 70 Pasir Panjang Road"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/26b00abe7acb9b5449204a64fb45ab5a/google-asia-pacific.png",
                "name": "GOOGLE ASIA PACIFIC PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "PRODUCT AREA In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally. JOB DESCRIPTION Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. JOB RESPONSIBILITIES    Design and build scalable backend services for critical user journeys   Integrate with and optimize storage solutions for scale and performance   Collaborate closely with the frontend/mobile team to ensure a smooth and optimized end-to-end user experience   Collaborate closely with cross-functional team members (product, UX, legal, policy) to enable a positive experience for our users  MINIMUM QUALIFICATIONS    5 years of experience in software development   Experience with coding in data structures, algorithms and software design  PREFERRED QUALIFICATIONS    Experience programming in the following languages: C++, and/or Java   Experience with large scale distributed systems design ",
            "datePosted": "2023-03-14",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13500,
                "minValue": 7500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-backend-google-asia-pacific-a0ec5296098f5c2ac655c330cbd7cfad?source=MCF&event=SuggestedJob",
            "uuid": "dacbc973-5e96-458f-aabb-7f565810d8a8"
        },
        {
            "dueDate": "2023-04-18",
            "jobTitle": "Software Engineer (Hybrid / Good Career Progression) JO",
            "skills": [
                "Requirements Gathering",
                "UAT",
                ".NET",
                "Software Engineering",
                "JavaScript",
                "SDLC",
                "SQL",
                "Application Support",
                "Python",
                "User Acceptance Testing",
                "Presentation Skills",
                "Web Applications",
                "System Integration Testing",
                "Java",
                "C#",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/520ad499e341ed679f2bff9541649f36/search-index.jpg",
                "name": "SEARCH INDEX PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Software Engineer (Hybrid WFH/ Good Career Progression)  • Attractive Bonus + Attractive Benefits • Entry-level welcome to apply. Training will be provided. • 5 Days work week (Hybrid WFH Module) • Permanent Role Responsibility:    Responsible for Software Development Life Cycle (SDLC); Involved in IT Project requirements gathering and analysis for development / implementation of new systems and enhancements to existing systems.   Involvement in the system integration testing (SIT) and user acceptance testing (UAT) prior to production implementation of changes and design ; development/coding of software.   Provide on-going application support and be involved in various stages of the SDLC.  Requirement:    Minimum Diploma / Degree in computer science/IT or related certifications   Entry-level welcome to apply. Training will be provided.   Meticulous and excel under pressure ; deadlines   Candidates with more relevant experience will be considered for the Senior Analyst or even PM position  How to apply Interested candidates who wish to apply for the post, you may send in your updated resume (in MS Word format) to search77@searchindex.com.sg  We regret to inform that only shortlisted candidates will be notified.  Ooi Chuan Yi (Jacky) EA License | 14C7092 EA Registration Number | R1871737",
            "datePosted": "2023-03-19",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8500,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-jo-search-index-7f921ff0e7a4410a4b2dacc4d67dd126?source=MCF&event=SuggestedJob",
            "uuid": "ff59914f-712c-4b34-8cfd-f2f52db08ef5"
        }
    ]
}