{
    "jobs": [
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Engineer",
            "skills": [
                "Negotiation",
                "Azure",
                "Cloud Computing",
                "Interpersonal Skills",
                "MS Office",
                "Building Automation",
                "Project Management",
                "Good Communication Skills",
                "Writing",
                "Assertiveness",
                "Project Time Management",
                "Team Work",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE STRATEGY , 2 INTERNATIONAL BUSINESS PARK "
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/d5158817d15b30ca50ea3b605687c7a5/azbil-singapore.jpg",
                "name": "AZBIL SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Azbil Singapore Pte Ltd, was, established since 1998, as an overseas base in Singapore with the commitment of serving our valued customers at their doorstep. Today, we are a leading solutions provider of sensors, valves, controllers, system, software and maintenance for Industrial, Factory and Building Automation industries. We are currently strengthening and expanding our operations base in Singapore and is looking for a Software Engineer for the Building Automation business to join our team. You will work closely with our Sales and Project team and involve in Design, develop, and deploy software application products of IBMS projects through requirements gathering and analyzing, planning, documenting, organizing, and managing the software development life cycle (SLDC) with internal and external teams to fulfil the customer requirements satisfactorily and meet the project timeline without any delay and defects. In additions, researching new technologies to improve performance and enhance the software products' efficiency, supporting the sales and marketing team to understand tender requirements and build POC, and supporting the maintenance team to troubleshoot and implement new functions and features to existing products.  Responsibilities:    Establishing the critical milestones with the support of the project team.   Requirement breakdown for architecting of the software products and modulizing the significant components for continuous integration and deployment.   Participating in handshake tests and site testing when necessary.   Establishing the Software Quality assurance procedure and performing T;C and user training.   Conducting sessions and workshops directly with the stakeholders to get requirements.   Arrange and plan the workforce commitment with the internal and external teams as required.   Maintaining proper communication between all the teams and the stakeholders.   Support Sales and Marketing teams to understand the tender requirements, especially for cloud-related solutions.   Observe new technologies in software development, cloud computing and project management to enhance the performance of existing software products and design new solutions for future requirements.   Build POC (Proof of Concept) solutions for demonstrations and exhibitions to get new projects.   Troubleshooting bugs of existing software products.   Establishing preventive maintenance strategies to avoid future disturbance.   Analyzing the new requirements to the existing products and planning the implementation with minimum disruption to the system.  Requirements:    Minimum Bachelor Degree related to Computer Engineering/Software Engineering/Computer Science   Certification on Software Development Methodologies   Certificate on Cloud Computing (AWS, Azure, Google Cloud etc.)   2-3 Years of Software Development Experience with latest technologies preferred   1-2 years of BMS/IBMS related Experience   1-2 Years of Cloud computing experience   2-3 Years of Software Development management experience preferred   Good verbal and writing skills in English   Having good communication skills manage conflicts between team and stakeholders.   Having good interpersonal skills, including leadership to motivate and mentor the team ",
            "datePosted": "2023-03-15",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6600,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/software-engineer-azbil-singapore-0a6f60e662e3cc853fdcb9b83ddfe8f5?source=MCF&event=Search",
            "uuid": "c25d0a99-6478-4b93-883e-d50fb5877f23"
        },
        {
            "dueDate": "2023-04-16",
            "jobTitle": "Senior Software Engineer",
            "skills": [
                "Requirements Gathering",
                "UAT",
                "Hardware",
                "Project Quality",
                "Software Documentation",
                "System Testing",
                "JavaScript",
                "Information Technology",
                "Configuration Management",
                "Audits",
                "Team Lead",
                "Team Player",
                "Integration Testing",
                "Java",
                "Disposition",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "LTC BUILDING B, 12 ARUMUGAM ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/d3bf8a69518f9a037c3cdb5260a4f103/CARLSYS%20TECHNOLOGIES%20PTE.%20LTD..jpg",
                "name": "CARLSYS TECHNOLOGIES PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities:    Analyse process/program specifications ; translate specifications to program codes, conforming to program guidelines and programming best practices   Make changes to configurable items, which include hardware, software, documentation, etc. It covers configuration management planning, configuration identification, configuration controls ; audits   Develop unit test package, execute tests ; document test results to ensure the quality of the program   Assist in the integration testing, system testing, User Acceptance Test (UAT) ; implementation activities to fix the reported problems/bugs of the system to ensure the smooth execution of programs in the production environment   Investigate all reported problems/errors ; initiate amendments ; testing so that the system can operate correctly ; efficiently   Prepare ; maintain up-to-date system documentation.   Analyse functional requirements to translate into application design using established design methodologies and guidelines   Work with team lead to ensure design and programme codes conform to architecture and design standards, and that design satisfies functional and system requirements   Participate in requirements gathering; work with Business Analysts in reviewing and refining functional specifications   Participate in peer reviews to improve project quality  Requirements:    Diploma / Degree in Computer Science / Computer Engineering / Information Technology related field, or IT equivalent   Preferably 2 years of working experience in developing and delivering application software   Possess relevant system development / maintenance experience using JAVA-related technologies   Possess initiative and disposition with a strong commitment and orientation towards results and high-quality standards   Strong problem-solving skills and ability to think out of the box   Team player with strong communication and interpersonal skills   Self-motivator with a positive attitude and with high energy   Customer focused   Proficient in written and spoken English ",
            "datePosted": "2023-03-17",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 8000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer-carlsys-technologies-20f1636fb43d5fcc5002d8ba3d427f87?source=MCF&event=Search",
            "uuid": "4899c0f8-b94f-45ca-beca-674a2da98ae6"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Software Engineer",
            "skills": [
                "CSS",
                "Software Engineering",
                "Agile",
                "Scripting",
                "JavaScript",
                "SQL",
                "Python",
                "Java",
                "C#",
                "API",
                "Databases",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "81 AYER RAJAH CRESCENT"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/f3fa80399806c1a871cde8a4fd6014e6/insider-security.png",
                "name": "INSIDER SECURITY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Scope    Software development of innovative cybersecurity products   New software engineers generally start off on general software engineering, and are given the opportunity to over time become domain experts in either back-end, front-end, algorithms or devops.  Requirements    Degree in Computer Science, Computer Engineering or Electrical Engineering   Strong in coding, eg, C, Go, Javascript or high-level scripting languages   Cybersecurity background is a plus but not required   Must be a Singapore resident  Benefits    Do meaningful work in big challenging problems   Build cutting-edge solutions   Mentorship by cybersecurity experts   Chalk up valuable experience and insights in the cybersecurity industry   Competitive salary   Hybrid work model (staff can work 2 days a week remotely)  After applying via mycareersfuture, kindly also submit your resume via https://apply.workable.com/insidersecurity/",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-insider-security-9a99f7549f8501683758fc230bacafd3?source=MCF&event=Search",
            "uuid": "f3b658e6-82b9-4c8e-aec6-7ebc1f3b432e"
        },
        {
            "dueDate": "2023-05-04",
            "jobTitle": "SOFTWARE ENGINEER",
            "skills": [
                "Troubleshooting",
                "Hardware",
                "RF",
                "Dynamics",
                "Scripting",
                "Wireless",
                "Embedded Systems",
                "Networking",
                "Python",
                "Firmware",
                "Microcontrollers",
                "Robotics",
                "Wireless Networking",
                "Linux",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "KA CENTRE, 150 KAMPONG AMPAT"
            },
            "company": {
                "logo": null,
                "name": "DOODLE LABS (SG) PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Software Engineer Job Description Doodle Labs is the global leader in high-performance private IEEE 802.11 wireless networking systems. We provide cutting-edge Smart Radio mesh networks for robotics, drones, and the Industrial Internet of Things. Doodle Labs has experienced rapid growth over the past five years as our products have been adopted by Fortune 500 companies (e.g. Airbus, General Electric) and industry-leading innovators (e.g. Boston Dynamics, FLIR). We’re looking for an experienced software engineer to join our talented team of software, hardware and RF engineers and keen to take a leadership position in our organization. The candidate will be responsible for designing and implementing software that’s part of wireless router firmware. It should be a solid contributor and leader, able to design, develop, code, test, and debug system software and automation scripts. He/She must be able to write clean code and push the capabilities of our Smart Radio and respond to customer needs and problems, as well as perform prototyping and application tests to support the production process. Requirements · Candidate must possess at least a bachelor’s degree, Post Graduate Diploma or Professional Degree in Engineering or Computer Science or equivalent. A Master Degree or PhD is an additional plus. · Experience in Linux, C/C++ and microcontrollers and trouble-shooting embedded systems · Experience in common interfaces, networking protocols, and hardware subsystems · Knowledge of networking concepts · Experience with Linux wireless stack/kernel/driver/git is a plus · Scripting with Bash shell, Python is a plus · Experience with QCA drivers such as ath9k and ath10k and OpenWRT is a plus · Eager to learn and improve in tight deadline environment · Have project management experience · Strong communication skills and ability to engage and guide a cross-functional team",
            "datePosted": "2023-04-04",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8000,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-doodle-labs-b32a4e0156b608fe09ad42a1b3d92dd5?source=MCF&event=Search",
            "uuid": "a633ea3e-5e0b-4138-9df9-283b56e0d25a"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Senior Software Engineer",
            "skills": [
                "Cloud Applications",
                "Software Engineering",
                "Agile",
                "Scripting",
                "JavaScript",
                "Python",
                "Scalable Web Applications",
                "Docker",
                "Scalable Architecture",
                "API",
                "Databases",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "81 AYER RAJAH CRESCENT"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/f3fa80399806c1a871cde8a4fd6014e6/insider-security.png",
                "name": "INSIDER SECURITY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Scope    Design and develop scalable software and architecture   Guide junior engineers in good software engineering processes   Software development of innovative cybersecurity products  Requirements    Degree in Computer Science or Computer Engineering   At least 4 years experience in software development   Experienced in tackling software complexity issues   Experience in building high quality software that can scale   Experienced in good software engineering practices   Strong in coding, eg, C, Go, Javascript or high-level scripting languages   Cybersecurity background is a plus but not required   Must be a Singapore resident  Benefits    Do meaningful work in big challenging problems   Build cutting-edge solutions   Chalk up valuable experience and insights in the cybersecurity industry   Competitive salary   Hybrid work model (staff can work 2 days a week remotely)  After applying via mycareersfuture, kindly also submit your resume via https://apply.workable.com/insidersecurity/",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8500,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer-insider-security-41dada9949885383b16bdf69271be615?source=MCF&event=Search",
            "uuid": "2c49ab9c-9c99-42eb-bebf-c82ccbe526c5"
        },
        {
            "dueDate": "2023-05-04",
            "jobTitle": "Senior Software Engineer / Software Engineer",
            "skills": [
                "Aftersales",
                "Customer Interaction",
                "Software Engineering",
                "System Integration",
                "Drawing",
                "SDLC",
                "Team Player",
                "C#",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "11 Kian Teck Road"
            },
            "company": {
                "logo": null,
                "name": "VISION ONE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Requirements:    Full architecting and coding experience in C#, C++, C, for command, control and      communication (C3) applications;   Dashboards, .NET framework and backend server experience required;   Min 7 years experience in architecting and documentation in SDLC using C# or C++;   Min 5 years experience in design, system integration, drawing and reading electronic/electrical schematics;   Min BSEE or equivalent from a recognized university;   Self-starter, driven, hands-on and able to work under pressure;   Good communication and cheerful personality;   Positive working attitude and team player and overall team leader;   Holders of Bachelor’s degree in Computer Science are welcome to apply if the candidate has      experience in designing, programming in embedded environment, reading and      implementing systems integration with electrical schematics;   Candidates with less than 5 years experience are also welcome to apply with salary to commensurate with experience;  Responsibilities:    Supports new RFQ and customer interaction, if assigned;   Track project progress, drive external reviews with customer and internal reviews;   Ensure adherence to delivery schedule and product quality;   Write documentation for each stage of development and commercialization lifecycle, write user manuals and other bid documents, if assigned.   Drive internal and external reviews with team members and customers;   Drive all internal and external acceptance tests;   Support after-sales maintenance;   Other work as assigned. ",
            "datePosted": "2023-04-04",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-engineer-software-engineer-vision-one-a3fd2cf6018286fc7b0216f2533338f4?source=MCF&event=Search",
            "uuid": "df8da9d0-14a4-40c1-9c7e-84fd277f4523"
        },
        {
            "dueDate": "2023-04-15",
            "jobTitle": "Software Engineer",
            "skills": [
                "Troubleshooting",
                "Ability To Work Independently",
                "Software Engineering",
                "JavaScript",
                "Protocol",
                "SQL",
                "WebDriver",
                "Python",
                "Selenium",
                "Team Player",
                "Java",
                "C#",
                "Linux",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/7f0e993e14801db87bc8c0459017302a/films-foils-international.png",
                "name": "FILMS & FOILS INTERNATIONAL PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Roles ; Responsibilities What we expect:    Oversee the IT infrastructure and administration of the server, network, and relevant devices.  What we are looking for:    Candidate must possess at least a Diploma or Degree in Computer Science/Information Technology or equivalent.   At least 1 years of working experience in the related field is required for this position.   Ability to work independently and efficiently, managing timelines and expectations.   Good team player with strong analytical, communication, and troubleshooting skills.   1. Proficient in Linux, with experience in Linux development, able to independently resolve third-party software dependencies; 2. Proficient in at least one of the languages python/nodejs/golang, with experience in developing medium-scale projects; 3. Proficient in mysql/rabbitmq/redis, able to independently resolve general problems during use; 4. Experience using webdriver or selenium, with experience in crawling preferred; 5. Clear understanding and comprehension of the HTTP protocol; 6. Able to use excel for simple data conversion, processing, and analysis; 7. Experience in developing cluster systems, with experience in distributed/multi- node/high-latency environments.    What we offer:    Attractive rewards for long-term service staff   Energetic and friendly working environment (flexible working hours, quarterly events, staff birthday celebration and etc.)   Medical insurance  ",
            "datePosted": "2023-03-16",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 5500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-films-foils-international-9c1ff77a7789cf761fa15d0705ecbf27?source=MCF&event=Search",
            "uuid": "5260fa52-d0d3-46ef-a2c2-546eb3791316"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Software Engineer",
            "skills": [
                "Vendor Relationships",
                "RDS",
                "Multithreading",
                "Scripting",
                "SDLC",
                "EC2",
                "Continuous Integration",
                "Database Design",
                "Angular",
                "Java",
                "API",
                "S3",
                "System Architecture",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "VISIONCREST, 103 PENANG ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/d3a822689069452757c942f5d108b53d/asia-digital-exchange.png",
                "name": "ASIA DIGITAL EXCHANGE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "ABOUT Us  AsiaNext is a trusted digital exchange for institutional investors in Asia and globally. It will offer integrated listing, trading, and post-trade services for digital assets, including digital payment tokens. The joint venture between the SBI Group in Japan and SIX Group AG in Switzerland will provide an institutional-grade platform to enable the tokenization and trading of existing securities and non-bankable assets. AsiaNext will support the growing institutional demand for trading of public and private digital assets. It will leverage the extensive networks of SBI in Asia and SIX in Switzerland and Europe, as well as their joint expertise in fulfilling institutional investors’ needs. Both SBI and SIX have demonstrated leadership in digital asset markets globally through multiple investments, issuances and initiatives in the space.  Why Join Us?  With SBI and SIX as its shareholders, AsiaNext has significant backing supporting its mission of building the world’s first institutional-grade digital exchange for institutional investors and fostering trust through rigorous security and compliance to regulations. The team comprises members with traditional finance, digital finance and technology background spanning decades at major regional and global banks, brokerages, exchanges, regulators, digital exchanges, and many others. If you are looking to develop your career in a professional and well-run environment, yet which moves and grows rapidly, join our diverse and talented team to build the digital exchange of choice for institutional investors.  About This Role:-  Reporting to the Head of Application, you will engage in the software development lifecycle that shapes the AsiaNext exchanges. You will analyse requirements and design, implement, deliver and support the IT solutions of the exchanges. You should be passionate about Blockchain, Securities Trading and Digital Assets, and are able to translate business needs to applications that support digital exchanges ecosystem.  Responsibilities     Design, code and implement the IT solutions of AsiaNext exchanges. This includes APIs and smart contracts for connectivity with financial institutions and blockchains respectively.   Keep proper documentation of functional specifications, project plans, system architecture and database design.   Prepare and run User Acceptance, Non-functional and Industrial Wide tests.   Conform to Software Development Life Cycle (SDLC) best practices, company policies and regulatory requirements to implement secure, resilient and scalable solutions.   Perform project management tasks such as tracking of progress, issues, risks, milestones, deliverables changes and ensure dependencies are within schedule and allocated costs.   Perform continuous integration and continuous delivery (CI/CD) to optimise operational environments.   Analyse technology trends and develop application strategy and architecture in line with these trends to meet business needs.   Manage vendor relationships and deliverables.   Qualifications And Experience  Education     Bachelor’s degree or higher in a computer related major or equivalent   Experience And Skill     At least 5 years of software development experience   Experience in securities exchange, derivatives trading, cryptocurrencies and blockchain would be an added advantage   Full stack developer with hands-on experience in Java, micro-services and frameworks such as Spring, React or Angular   Experience with AWS technologies such as API Gateway, EC2, RDS, S3 and EKS   Experience with smart contracts and blockchain preferred   Familiar with CI/CD deployment and toolsets such as Jenkins and Gitlab   Experience with FIX version 4.2 and above   Familiarity with scripting Selenium or Katalon preferred   Experience with multithreading and concurrency is a plus   Knowledge in financial exchange system/framework, especially matching engine and market supervision is a plus   Strong analysis and communication skill   Result-oriented, diligent and a team player   Employment Benefits     Competitive staff benefits - annual leave, life insurance, and medical insurance (includes dependents)   Competitive remuneration including variable bonus   How to Apply:-  If you are ready to take up a new challenge in a dynamic and fast-growing platform, please send your resume to hr@asianext.comstating your name and title of the position applied for in the subject line.  Only shortlisted candidates will be contacted for further discussion. All personal data collected will be kept strictly confidential for recruitment purposes only.   AsiaNext is an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, colour, sex, gender identity or expression, sexual orientation, age, non-disqualifying physical or mental disability, national origin, or any other basis covered by appropriate law.",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 9000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-asia-digital-exchange-bfd8892375fd3d05e8164d08643227f7?source=MCF&event=Search",
            "uuid": "7d6c8232-62b2-4474-a9ae-8b3bdaf60274"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Software Engineer",
            "skills": [
                "Hardware",
                "Software Engineering",
                "Agile",
                "JavaScript",
                "Reliability",
                "Embedded Systems",
                "User Interface",
                "System Design",
                "FPGA",
                "Python",
                "Microcontrollers",
                "Satellite",
                "Team Player",
                "Java",
                "API",
                "Databases",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TCH TECHCENTRE, 71 TOH GUAN ROAD EAST"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/6d1ab31b6244dbb037970be423a53863/zero-error-systems.png",
                "name": "ZERO-ERROR SYSTEMS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Title: Software Engineer  Role and Responsibilities  \tInvolve in product conceptualization, design, verification/validation for space/satellite and high-reliability applications \tDevelop application programming interface (API) to satellite payload and/or high-reliability applications \tDevelop test protocols/test programs using microcontrollers and/or Field-Programmable-Gate-Array (FPGA) means \tWork with hardware engineers to develop Graphic User Interface (GUI) for data acquisition for embedded systems \tSupport functional and reliability tests to ensure functional safety and performance of the embedded system \tGenerate and maintain the necessary documents   Qualifications  \tHave at least a bachelor’s degree in an engineering discipline preferably in computer engineering, computer science, or electrical/electronic engineering \tExperience in software development for embedded systems (e.g., leveraging on microcontrollers or FPGA) \tSkilled in at least one programming language in C/C++, Python, Java, Golang, Verilog/VHDL, etc.  \tExperience in Graphic User Interface (GUI) design  \tExperience in various hardware communication protocols (e.g., UART, SPI, I2C, DDR2/3/4, CAN, eMMC, etc.) \tKnowledgeable in quality/qualification workflows, including verification, validation, and reliability testing   \tKnowledge of space/satellite applications is a plus \tKnowledge of hardware/software functional safety standard (e.g., IEC 61508) is a plus \tKnowledge of cloud-based software system design is a plus \tIs a good team player that can work well in a team to solve problems to deliver solutions to meet market needs ",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8000,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/design/software-engineer-zero-error-systems-3f0c695ec0096bf5148b85fecd3c97d3?source=MCF&event=Search",
            "uuid": "e316a6f4-9ffe-4d19-8181-16ed3dae134f"
        },
        {
            "dueDate": "2023-04-15",
            "jobTitle": "Software Engineer",
            "skills": [
                "UML",
                "Technical Documentation",
                "MongoDB",
                "Solutioning",
                "Agile",
                "Root Cause Analysis",
                "JavaScript",
                "JIRA",
                "Teamoriented",
                "Java",
                "Software Development",
                "Ability to Prioritize",
                "Business Requirements",
                "Technical Design"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "OXLEY BIZHUB, 71 UBI ROAD 1"
            },
            "company": {
                "logo": null,
                "name": "MGG SOFTWARE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "RESPONSIBILITIES    Work closely with project management team to identify and analyse business requirements for system development and enhancements   Design solution and develop technical documentation (flow, UML, processing rules) to support system development   Work closely with fellow software engineers in project team to develop systems using JavaScript and Java   Deploy and implement your codes in test and production environments using CI/CD   Participate in daily meetings with development team to provide clarifications on design, business rules and data requirements and ensure alignment with business requirements   Undertake root cause analysis for problems to implement preventive and corrective measures to meet business and performance needs   REQUIREMENTS    At least 1 year of experience in designing and building software using JavaScript (ReactJS, NodeJS, VueJS, Express, MongoDB)   Strong analytical, problem-solving skills, and solutioning skills   Attention to data relationship and accuracy   Strong communicator, highly proficient in English and Chinese (written and spoken). Knowledge of Malay or Indonesian is highly advantageous.   Participated in at least one software development cycle using Agile and CI/CD   Multi-tasking and time-management skills, with the ability to prioritize tasks   Able to work in a fast-paced, team-oriented environment   Experience with using Agile and technical design tools and cloud-based tools, eg. Jira, Trello, Gitlab and Draw.io, etc   BENEFITS    Up to 16 days of annual leave   Medical coverage   Hybrid work option   Opportunities for project-based travel ",
            "datePosted": "2023-03-16",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-mgg-software-7f8bd87df46794359fa0afd4c5bf2ea4?source=MCF&event=Search",
            "uuid": "5cc21a9a-1d85-4966-930d-00a3c48b3512"
        },
        {
            "dueDate": "2023-05-03",
            "jobTitle": "Senior Software Engineer",
            "skills": [
                "Coaching",
                "Mentoring",
                "Version Control",
                "Product Marketing",
                "Autonomy",
                "Analytic Thinking",
                "Node.js",
                "MySQL",
                "JavaScript",
                "SQL",
                "Publishing",
                "React Native",
                "Web Applications",
                "Java",
                "Databases",
                "React.js",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9cff4d61968c306a9d84fdfe0ceeea6b/2359-media.png",
                "name": "2359 MEDIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME",
                "CONTRACTOR"
            ],
            "description": "In 13 years, we've built an award-winning, multinational digital experience studio. It has been an adventure best described as a coherent and chaotic innovation. One that would not be possible without the ingenuity of our people. We still have the same dream. To improve the way people live and work through technology. Those who work here describe 2359 Media as a place to grow their skills and ability. The hierarchy is very flat and our time during work is focused on delivering great work to our clients. Here we value entrepreneurial spirit, initiative, teamwork and creativity. It’s rewarding to work where everyone is empowered to make a difference. Enjoy high-level autonomy, and be seen and heard for all the great work you do. Bask in our family-like culture, where we take every opportunity to celebrate our achievements because our most valued resource is our people. As a Senior Software Engineer, you will create impact by:    Utilizing and applying robust analytic thinking with the ability to identify, debug, and resolve technical issues.   Providing coaching and technical mentoring to more junior developers.   Conducting team code reviews.   Displaying initiative and an ability to lead others, and develop applications team disciplined manner.   Working and collaborating with the rest of the engineering team.   Working with product team and graphic designers.   Learning and understanding user interactions.   Developing and supporting graphical interfaces.   Supporting existing solutions.   Optimizing components for maximum performance across a vast array of web-capable devices and browsers.   Working independently to evaluate and make strategic decisions that will address specific technology design needs and issues within their technology area.  As a Senior Software Engineer, it would help for you to be:    Proficient in Node.js, Java, React Native or React.js  If you have what it takes to be part of a rapidly-iterating, highly dynamic ecosystem, get in touch with us at talent@2359media.com!",
            "datePosted": "2023-04-03",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 8000,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer-2359-media-51d26c3441921b81cad283983e37b191?source=MCF&event=Search",
            "uuid": "5d8363f0-085f-4706-a2fc-ed8464f48aee"
        },
        {
            "dueDate": "2023-04-10",
            "jobTitle": "Software Engineer",
            "skills": [
                "MongoDB",
                "Design Patterns",
                "Software Engineering",
                "MySQL",
                "JavaScript",
                "SQL",
                "System Design",
                "Ruby",
                "Python",
                "Web Applications",
                "Product Development",
                "Java",
                "C#",
                "Debugging",
                "System Architecture",
                "Databases",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "12 TAI SENG LINK"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9a91b15fa83adfb53758da8df368187f/lorenz-technology.jpg",
                "name": "LORENZ TECHNOLOGY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Roles ; Responsibilities  Responsibilities:    Responsible for the new product development in the server   In-depth exploration and analysis of business needs, writing technical   solutions and system designs   Complete system design and coding according to product requirements   Remodel and optimize the system architecture   Deliver at the pace of business changes and requirements   Solve challenging technical problems both individually and cooperatively with   the team   Passion to bring out innovative ideas and try out new solutions, while being   open minded to feedback from the team   Relentless focus on quality   Requirements    Minimum 5 years of experience in software development (any tech stack included but not limited to Golang / Java / Python experience)   Minimum a Masters Degree in Engineering or any related course   ProCcient in at least one programming language such as Python, Go, Java, Node.js, Ruby, etc., and understand Python; Familiar with the use and optimization methods of common databases such as Redis, MySQL, MongoDB, and Memcached;   Familiar with consensus algorithm or consensus algorithm is preferred, such as PoW, PoS, DPoS, PBFT, Raft, etc.; Build the back-end of applications by creating the necessary APIs for integration.    Identifying risks involved with the development and providing solutions to resolve complex problems. Setting up best coding practices and conducting regular code reviews.   ",
            "datePosted": "2023-03-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13000,
                "minValue": 11000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-lorenz-technology-d9a9f2550f56b2700b6878eca44e5990?source=MCF&event=SuggestedJob",
            "uuid": "39e56d58-137e-43e6-bb22-3e19202d7e08"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "Software Engineer ",
            "skills": [
                "UML",
                "JSON",
                "Troubleshooting",
                "XHTML",
                "Web Services",
                "JSP",
                "Eclipse",
                "XML",
                "SOAP",
                "Scripting",
                "JDBC",
                "SQL",
                "AJAX",
                "HTML 5",
                "EJB",
                "Java"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "ALLTECH SYSTEMS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description  · Code, modify, test, correct and document new and existing programs using assigned languages, tools and coding conventions; · Prepare and document test data; · Prepare and set up testing and production environment; · Prepare and maintain program and system documentation; · Assist in establishing file structures and processing logic requirements; · Produce deliverables according to group standards and procedures; · Assist Project Leaders in the study and design of application systems and work coordination, project management and user training work; · Troubleshooting and supporting end-users in the implementation and maintenance of application systems; · Train other contract programmers in the relevant skills; · Participate in Disaster Recovery activities eg simulation exercise at Disaster Recovery sites; · Learn / pick up new programming skills related to System Development and Maintenance as assigned by the supervisors; · Any other tasks related to System Development and Maintenance as assigned by the supervisors;  Job Requirements  a) Have three (3) years’ experience, within the past four (4) year’s timeframe, in each of the programming skills: - JSP, Servlet, Java Bean, Java Script, Session management, JDBC ; SQL b) Have two (2) years’ experience, within the past three (3) year’s timeframe, in coding programs using each of the skills: - HTML 5, XHTML, AJAX, Web Services (REST API), JSON, Java Server Faces ; EJB (session, entity ; message, Service Locator, Business Delegate, Data Transfer Object, Data Access Object). c) Preferably have hands on experience on the following: - IBM RAD9.0 or above or Eclipse or equivalent, Portal and Portlet development, n-Tier Architecture, Java Web Security/LDAP, JEE Security, JEE Transaction, XML, Web Services (SOAP), JNDI, UML diagrams ; Secure coding to prevent application vulnerabilities (for e.g. Cross-site scripting; Injection vulnerability flaws such as SQL injection, command injection; Race conditions; Improper error/ exception handling, etc).",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 9000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-alltech-systems-c91587f36a858e71342ca1e5305a1cbe?source=MCF&event=Search",
            "uuid": "8cd79ad6-6970-4c37-837a-979b508e771b"
        },
        {
            "dueDate": "2023-04-21",
            "jobTitle": "Software Engineer ",
            "skills": [
                "MVC",
                "Xamarin",
                "CSS3",
                "CSS",
                "HTML",
                "REST",
                "Unit Testing",
                "JavaScript",
                "HTML5",
                "Adonet",
                "SQL",
                "SQL Server",
                "Windows Services",
                "C#",
                "Debugging",
                "API"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "600 SIN MING AVENUE"
            },
            "company": {
                "logo": null,
                "name": "AUTOSCAN TECHNOLOGY PTE LTD"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Design, Develop, test and maintain both new and existing code, ranging from client-side development using JavaScript, HTML, and CSS, to server-side code using C# and ASP.NET MVC, Web API, Windows Services, and ADO.NET for data persistence and retrieval. Xamarin for Moblie Development.   Work with management to create and adhere to schedules, while maintaining flexibility to adapt shifting market demands.   Rapid prototyping, and presenting conceptual design and working prototypes to mangement.   Collaborate on technical architecture and design.  Requirments    Solid understanding of OOP design and principles   Visual Studio 20XX, SQL, Server 20XX   Remote Debugging   Unit Testing  Front-End    C3, ASP.NET MVC, Web API   JavaScript, JQuery, AJAX   HTML5, CSS3, Reponsive deisgn   Understanding of web technology stacks including HTTP, REST,Cookies, caching, and asset loading.  Requirment    Diploma, Advanced/Higher/Graduate Diploma, Bachelor's Degree, Post Graduate Diploma, Professional Degree in Computer Science or Related Field   Min 2 years experience   Singaporean or PR   Office near Bishan MRT ",
            "datePosted": "2023-03-22",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 4500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-autoscan-technology-e31799cd6174482cb4495ee0774529f5?source=MCF&event=Search",
            "uuid": "d5577e6e-9efd-4ae9-97b6-6663aafd497a"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Engineer",
            "skills": [
                "Machine Learning",
                "MVC",
                "MongoDB",
                "CSS",
                "PHP",
                "HTML",
                "REST",
                "MySQL",
                "UI",
                "Continuous Integration",
                "Angular",
                "Web Applications",
                "Debugging",
                "Web Development",
                "Databases",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TRIVEX, 8 BURN ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/1413f503a6d9cda298a627a2fbbc07c1/iotalents.png",
                "name": "IOTALENTS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Gather and refine web site/application design specifications and requirements based on business needs   Participate in the entire application lifecycle, focusing on coding and debugging   Write clean code to develop functional web applications   Build reusable code and libraries for future use   Develop well-designed, tested and efficient code using best software development practices   Create website layout/user interfaces by using standard HTML/CSS practices integrating data from various back-end servers and databases   Create and maintain software documentation   Maintain, expand, and scale the site as needed   Stay current with emerging technologies/industry trends and make recommendations accordingly.   Understanding of UI, cross-browser compatibility, general web functions and standards  Requirements    Degree/Diploma in Computer Science/Computer Engineering or related fields   Proven experience as a full stack developer   Comfortable creating and using web-based REST APIs   Proficiency with languages such as HTML, CSS, ECMAScript 6 (ES6), PHP   Expertise in Web development using Laravel, CakePHP (or other MVC frameworks)   Familiarity with front-end frameworks such as React, Angular.   Knowledge in relational and no-SQL databases (MongoDB, MySQL).   Knowledge of machine learning algorithms a big plus   Experience with software projects - source code control, continuous integration, documentation ",
            "datePosted": "2023-03-15",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-iotalents-d8b553dd2c8700270ba06e98fe01dc5b?source=MCF&event=Search",
            "uuid": "466d64a5-cf42-48a6-a5c5-bfcba52c5baf"
        },
        {
            "dueDate": "2023-04-16",
            "jobTitle": "Software Engineer",
            "skills": [
                "Troubleshooting",
                "Software Engineering",
                "JavaScript",
                "Positive Team Player",
                "Windows",
                "Software Design",
                "Software Configuration Management",
                "Java",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "PLAZA 8 @ CBP, 1 CHANGI BUSINESS PARK CRESCENT"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/bf550dd7a52653fb5f88ec996b518edc/hollysys.png",
                "name": "HOLLYSYS (ASIA PACIFIC) PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities · Designing and delivering software to meet customer requirements including architecture, design,   reuse, development, integration and verification. · Collaborating with the software development team on application design and development. · Developing software and overseeing the deployment of applications across platforms. · Software requirement analysis and documentation. · Trouble-shooting at site. · Using version control for software release management and documentation. · Guide and mentor junior developer in the technical aspect.  Requirements · At least 5 years of practical experience and excellent in C++ programming (Solid understanding of pointers, memory, polymorphism, STL and etc.). · Object-oriented programing knowledge and experience with QT framework. · Experience in Software design and implementation using C++/C/QT under a Windows or Linux environment. · Have an understanding of and experience with multithreaded systems, and low latency IO. · Strong analytical and problem-solving skills. · Experience with software configuration management tools/version control tools. · Knowledge of ACE or OPC UA is a plus. · Experience guiding/mentoring junior developers. · Excellent collaboration and communication skills.",
            "datePosted": "2023-03-17",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 9000,
                "minValue": 6500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-hollysys-e14bdc50da7b6d8ad8871d3299d6fe88?source=MCF&event=Search",
            "uuid": "4157b571-9ba8-47fe-8945-1fcf05d9bbad"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Software Engineer",
            "skills": [
                "Operation",
                "HTML",
                "Job Descriptions",
                "Software Engineering",
                "MySQL",
                "JavaScript",
                "Production",
                "SQL",
                "Python",
                "Inspection",
                "Java",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TRITECH BUILDING, 31 CHANGI SOUTH AVENUE 2"
            },
            "company": {
                "logo": null,
                "name": "TRITECH SYSENG (S) PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description Job Description:    Develop in-house program for engineering instrument data process.   Design/setup/develop/maintain gateway for data transmission.   Documentation on operation ; maintenance instructions and manual.   Coordinate fabrication, inspection, testing, installation, and commissioning of hardware and software system.   Support daily operation and provide customer support.   Find out root cause of hardware, software, and system failure. Apply solution and implement future prevention.  Job Requirement:    Familiar Python 3 and its built-in libraries.   VueJS Framework, Go language   In depth experience in  o Network, TCP/IP o SQL o Managing Linux / windows OS    Bilingual in English and Chinese (to handle Chinese speaking customers’ technical enquires ; conduct trouble shooting based on customers’ feedback)   Graduate from Polytechnics/University   Must be hands-on and able to debug.   At least 3 years relevant experience ",
            "datePosted": "2023-03-15",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-engineer-tritech-syseng-56f2a21f7101969fbbdafbce31526d3f?source=MCF&event=Search",
            "uuid": "880ef34b-d49b-4227-9044-7c099c24ae93"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "Software Engineer",
            "skills": [
                "UML",
                "MVC",
                "JSON",
                "Troubleshooting",
                "Web Services",
                "JSP",
                "Eclipse",
                "Scripting",
                "JDBC",
                "SQL",
                "AJAX",
                "EJB",
                "Java",
                "WSDL",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/34fa7a4b350df9ea167bca4c7c1fe6eb/stie.png",
                "name": "STIE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description:  The Programmers shall be required to:  i. Code, modify, test, correct and document new and existing programs using assigned languages, tools and coding conventions; ii. Prepare and document test data; iii. Prepare and set up testing and production environment; iv. Prepare and maintain program and system documentation v. Assist in establishing file structures and processing logic requirements; vi. Produce deliverables according to group standards and procedures; vii. Assist Project Leaders in the study and design of application systems and work coordination, project management and user training work; viii. Troubleshooting and supporting end-users in the implementation and maintenance of application systems; ix. Train other contract programmers in the relevant skills; x. Participate in Disaster Recovery activities, e.g. simulation exercise at Disaster Recovery sites; xi. Learn / pick up new programming skills related to System Development and Maintenance as assigned by the supervisors; xii. Any other tasks related to System Development and Maintenance as assigned by the supervisors.  Working Experience and Skill Requirement  (i) Have six (6) years’ experience in each of the programming skills: - JSP, - Servlet, - Java Bean, - Java Script, - Session management - JDBC, SQL (ii) Have five (5) year experience in coding programs using each of the skills: - MVC modeling; - Java Server Faces - EJB (session, entity ; message, Service Locator, Business Delegate, Data Transfer Object, Data Access Object), (iii) Preferably have hands on experience on the following: - IBM RAD9.0 or above or Eclipse or equivalent - Portal and Portlet development using JSF - Jtpl (page template) - n-Tier Architecture - Java Web Security/LDAP - JEE Security - JEE Transaction - XML - Web Services (WSDL) - JNDI - Ajax - JSON - UML diagrams - Secure coding to prevent application vulnerabilities (for eg. Cross-site scripting; Injection vulnerability flaws such as SQL injection, command injection; Race conditions; Improper error / exception handling, etc)",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-stie-b374b915abc4b7b22427dff366089b69?source=MCF&event=Search",
            "uuid": "6aa750c4-c84c-445f-b068-9bbc65ba7c30"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Software Engineer",
            "skills": [
                "Git",
                "JSON",
                "Able To Multitask",
                "PHP",
                "Software Engineering",
                "MySQL",
                "Agile",
                "Bootstrap",
                "JavaScript",
                "SQL",
                "Python",
                "Docker",
                "Applications Support",
                "Java",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "Vertex (Tower A), 33 Ubi Avenue 3"
            },
            "company": {
                "logo": null,
                "name": "COMMONTOWN PRIVATE LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Analyse, design, develop and implement mobile and/or web-based applications.   Develop Front-end and/or back-end applications.   Support product implementation and maintenance.  Requirements    Diploma/Degree in Computer Science.   Strong programming skills and good problem solving skills.   At least 2 years of extensive experience in 1 or more of these tool sets: 1. PHP, Nodejs, MySQL, JSON and Bootstrap, or 2. Java technologies (Spring Framework, RESTful/SOAP).    Working experience with these tools: NPM, Docker, Git is an advantage.    Knowledge of AWS is an advantage.    Proactive, able to multitask and work independently. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-commontown-09a7bf4d379eee3ac73252e75fb91ebe?source=MCF&event=Search",
            "uuid": "82dd044b-52a8-4a0b-a983-3426edc8fffc"
        }
    ]
}