{
    "jobs": [
        {
            "dueDate": "2023-04-06",
            "jobTitle": "EXECUTIVE CHEF",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Restaurants",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Sanitation",
                "Compliance",
                "Finish",
                "Catering",
                "Food Service"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "RITZ @ FARRER, 142 RACE COURSE ROAD"
            },
            "company": {
                "logo": null,
                "name": "OCEANDA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME",
                "CONTRACTOR"
            ],
            "description": "EXECUTIVE CHEF As a executive chef you will be responsible for everything that goes on in your employer’s kitchen. Not only will you be required to oversee all dishes from start to finish, you are also tasked with hiring and firing employees, meeting health and safety standards and dreaming up new recipes for the restaurant you work in. If you love to cook, enjoy being creative and relish the challenges that come with responsibility, read on to learn more about becoming a head chef.  REQUIREMENTS o Ready to work any shift. o Need to work long term. o Ready to work for public holidays ; Sunday. A candidate who wants to become a head chef must acquire on the job training which is most important for career progress and advancement in the path of becoming a head chef. A executive chef must possess a lot of stamina and will power to be able to stand for long hours and work for extended hours too in order to experiment in creating new dishes. The candidate should also possess good knowledge of food products and their availability in order to plan cuisine accordingly. A executive chef should have good organizing, supervising and time management skills to be able to oversee all the activities that take place in the kitchen in a proper manner.",
            "datePosted": "2023-03-23",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10500,
                "minValue": 6500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/general-management/executive-chef-oceanda-43f1a498ee65b4dfabc066f4997f30a3?source=MCF&event=SuggestedJob",
            "uuid": "e67bb338-df15-479d-b93d-587b3cb007c3"
        },
        {
            "dueDate": "2023-04-15",
            "jobTitle": "head chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Restaurants",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Sanitation",
                "Inventory Control",
                "Chemistry",
                "Inventory Management",
                "Equipment Maintenance",
                "Transportation",
                "Prevention",
                "Nutrition",
                "Culinary Skills",
                "Food Service",
                "Training Staff"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/6b77cf731bfe3b52848db2cb07c47722/1880.jpg",
                "name": "1880 PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job posting for 1880 Group  Job Description ; Requirements  Requirements The Head Chef manages and oversees operations in the kitchen as well as the kitchen staff of an outlet. He/She plans the menu and liaises with suppliers. He/She controls the budget and ensures the quality of kitchen operations. He/She ensures that problems that arise are rectified in a positive and professional manner. As we do high end events, we expect a high level of standard and quality from our restaurant.   An experienced, forward-thinking Chef who is passionate about culinary arts. The ideal candidate for this position will be a natural leader who always has a finger on the pulse of current culinary trends. The Chef will be responsible for assigning work in the kitchen, preparing meals for our diners, interviewing and training staff, kitchen inventory management and partnering with the Executive Chef to come up with delectable new dishes to add to our growing menu. If you are passionate about the restaurant industry and have prior experience as a Chef, we invite you to apply today.  Having work in a member's club or high end restaurants ; hotels will be an advantage.  Role    Administer purchasing and receiving procedures.   Apply principles of culinary science.   Apply principles of food chemistry.   Apply principles of food psychosociology.   Apply principles of gastronomy.   Implement loss/risk prevention.   Innovate with new culinary ingredients.   Interpret culinary nutrition.   Manage compliance with food and beverage hygiene policies and procedures.   Manage cost and quality controls.   Manage culinary operations.   Manage food ; beverage operations.   Manage inventory control system.   Manage site/outlet and equipment maintenance.   Master cook and chill methods.   Master recipes from various cuisines.   Perform culinary application and techniques.   Plan and develop menus for food service establishments.   Prepare herb and spice blends of various cuisines.   Use herbs and spices in various cuisine preparation and presentations.  Perks • 5-day work week with diverse and energetic colleagues who work hard and play hard • Employee discount on F;B at the club • Staff meals every day • Late night transportation • $100 Transport allowance every month • Birthday credits • $1,000 Sign-on bonus and a referral bonus • Flexible benefits, and more!",
            "datePosted": "2023-03-16",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 9000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/head-chef-1880-d02eb98a84a0d57b937267ef9508a461?source=MCF&event=SuggestedJob",
            "uuid": "859fcd19-c5e5-4174-9b29-181c6a3e0747"
        }
    ]
}