{
    "jobs": [
        {
            "dueDate": "2023-04-29",
            "jobTitle": "CHEF",
            "skills": [
                "Recipes",
                "Drainage",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Housekeeping",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Raw Materials",
                "Compliance",
                "Baking",
                "Culinary Skills",
                "Pastry",
                "Japanese"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "6 TEBING LANE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9fd2757c2cc660deb96e7419190bff57/idea-management-services.jpg",
                "name": "BANYAN BEER GARDEN PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description To perform cooking duties in a non-aircon F;B working environment. Detailed Responsibilities - Assist the head chef in daily kitchen operation - Cutting, steaming, frying, etc. - Washing and handling raw materials such as vegetable, seafood, pork, poultry, beef, etc. - Periodically cleaning ; maintenance of fridge, freezer, cooking area, exhaust hood, drainage, etc. - Periodically review menu with the management and design new promotion dishes - Other ad hoc duties assigned by the management Requirements - Min 2 years' experience as Chef in a restaurant - Able to get along with team members - Needs to work on split shift daily: 10am – 2pm ; 6pm – 10pm - Needs to work on weekends ; public holidays - OT may be required with short notice to cover other colleagues’ MC or leaves - Able to work in a Non-Aircon environment Interested applicants, please email resume to: ideamgt@yahoo.com.sg (Licence No. 04C4555, by applying this job, it's agreeable that you consent us to collect, use, disclose and/or process your personal data for your job placement purposes.)",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-banyan-beer-garden-2283cce26058765c1d6ef5a6becc1a5d?source=MCF&event=Search",
            "uuid": "0e3aeaf5-0d9d-46e5-9d8a-52ad330a379b"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Sous Chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Sanitation",
                "Fine Dining",
                "Strategy",
                "Banquets",
                "HACCP",
                "Staff Management",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "CHIJMES, 30 VICTORIA STREET"
            },
            "company": {
                "logo": null,
                "name": "THE WINERY SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description: A Sous Chef is the culinary chef located just below the executive or head chef in a kitchen chain of command. Therefore, the Sous Chef has a vital role in any commercial kitchen. As second-in-command, he/she has a large amount of responsibility in the kitchen.  Job Responsibilities:    Work with the executive chef to produce diversified menus in accordance with the restaurant’s policy and vision.   Come up with new dishes which appeal to the clients whenever required.   Establish the working schedule and organize the work in the kitchen so that everything works like “well-oiled machinery.”   Produce high-quality dishes that follow up the established menu and level up to the location’s standards as well as to client's requirements.   Plan the food design in order to create a perfect match between the dish’s aspect and its taste.   Discover talented chefs and train the min order to reach the high standards of the location.   Train the auxiliary kitchen staff in order to provide the best results in minimum time and using the maximum available resources.   Maintain order and discipline in the kitchen during working hours.   Create tasting menus for clients interested in contracting the food for different events(weddings, banquets, corporate dinners,birthday parties etc.) from their kitchen.   Developing a cross-marketing strategy in order to increase profit such as pairingdrinks with the food served.   Minimum Qualifications:    Proven experience as Sous Chef   Understanding of various cooking methods, ingredients, equipment and procedures.   Excellent record of kitchen and staff management ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3700,
                "minValue": 2800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/sous-chef-winery-singapore-0ffca236757e700a63c4bb4ec4056f21?source=MCF&event=Search",
            "uuid": "9683d30c-ac5e-4b50-b191-87a769b1d7ca"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "EXECUTIVE SENIOR CHEF",
            "skills": [
                "Recipes",
                "Microsoft PowerPoint",
                "Leadership",
                "Ingredients",
                "Microsoft Office",
                "Microsoft Excel",
                "Cooking",
                "Social Media",
                "Inventory",
                "Sanitation",
                "Marketing",
                "Accounting",
                "Microsoft Word",
                "Catering",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "162 BUKIT MERAH CENTRAL"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/a123c3157c4047b4cee090abbc0d33ba/careers-compass-consultants.png",
                "name": "ALLSPICE INSTITUTE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   The Chef De Cuisine is responsible for the day to day running of the entire kitchen operation.   Ensure the preparation and presentation of all menu items in accordance with established recipes and standards. Planning of daily set lunch menu.   Responsible in the daily requisitioning of all food goods and maintain procedures to ensure proper storage minimize waste.   Responsible for and accountable for the overall food as well as kitchen supplies, energy and utensil costs in the assigned section.   Provide leadership, training and supervision to the Kitchen team.   Plan in conjunction with the Director/ Chef de Cuisine (Head office) on activities, promotions, and menu implementations according to the annual marketing plans.   Coordinate functions and activities with other relevant departments. ",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12500,
                "minValue": 9500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/education-training/executive-senior-chef-allspice-institute-d018a9c09ef045a233eb018c775f7a12?source=MCF&event=SuggestedJob",
            "uuid": "b3db9178-d913-4c14-813d-9db348f92470"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Sous Chef",
            "skills": [
                "Recipes",
                "Weddings",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Sanitation",
                "Fine Dining",
                "Strategy",
                "Banquets",
                "HACCP",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "CHIJMES, 30 VICTORIA STREET"
            },
            "company": {
                "logo": null,
                "name": "THE ORGANIC WINERY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description: A Sous Chef is the culinary chef located just below the executive or head chef in a kitchen chain of command. Therefore, the Sous Chef has a vital role in any commercial kitchen. As second-in-command, he/she has a large amount of responsibility in the kitchen.  Job Responsibilities:    Work with the executive chef to produce diversified menus in accordance with the restaurant’s policy and vision.   Come up with new dishes which appeal to the clients whenever required.   Establish the working schedule and organize the work in the kitchen so that everything works like “well-oiled machinery.”   Produce high-quality dishes that follow up the established menu and level up to the location’s standards as well as to client's requirements.   Plan the food design in order to create a perfect match between the dish’s aspect and its taste.   Discover talented chefs and train the min order to reach the high standards of the location.   Train the auxiliary kitchen staff in order to provide the best results in minimum time and using the maximum available resources.   Maintain order and discipline in the kitchen during working hours.   Create tasting menus for clients interested in contracting the food for different events (weddings, banquets, corporate dinners,birthday parties etc.) from their kitchen.   Developing a cross-marketing strategy inorder to increase profit such as pairing drinks with the food served.   Minimum Qualifications:    Proven experience as Sous Chef   Understanding of various cookingmethods, ingredients, equipment andprocedures.   Excellent record of kitchen and staffmanagement ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3700,
                "minValue": 2800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/sous-chef-organic-winery-9bdf08c2c889c698d507bf024052b21d?source=MCF&event=Search",
            "uuid": "bb93a2d9-c174-400f-9a0f-1e4ba86c9d89"
        },
        {
            "dueDate": "2023-04-13",
            "jobTitle": "Chef",
            "skills": [
                "Recipes",
                "Ability to Multitask",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Housekeeping",
                "Interpersonal Skills",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Compliance",
                "Pressure",
                "Culinary Skills",
                "Pastry"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "FARRER HORSE PTE. LTD."
            },
            "jobType": [
                "PART_TIME",
                "FULL_TIME"
            ],
            "description": "   Well versed in Western and Indian cusines   Plan and execute menus in collaboration with other junior chefs   Ensure adequacy of supplies at all times   Place orders in a timely manner   Manage ingredients that should be frequently available on a daily basis   Suggest new ways of presentation of dishes   Suggest new rules and procedures for optimizing the cooking process   Give attention productivity of the kitchen such as speed and food quality   Ensure adherence to all relevant health, safety and hygiene standards   Collaborate with the management to achieve food and service quality   Excellent use of various cooking methods, ingredients, equipment, tools and processes   Ability to multitask   Ability to work efficiently under pressure   Great time management skills   Great communication and interpersonal skills ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3000,
                "minValue": 2400,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-farrer-horse-8b20d088a8d5fc61c55e831d441fd7bd?source=MCF&event=Search",
            "uuid": "75bf30b0-4213-46c7-9c9f-f5368cb1d8f9"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "CHEF",
            "skills": [
                "Recipes",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Cutting Tools",
                "Compliance",
                "Good Communication Skills",
                "Culinary Skills"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/fcf1ed412b9ce0fb63ff35d1f9ca316c/57-employment-agency.jpg",
                "name": "JP PEPPERDINE GROUP PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Set up workstations with all      needed ingredients and cooking equipment   Prepare ingredients to use in      cooking (chopping and peeling vegetables, cutting meat etc.)   Cook food in various utensils      or grillers   Check food while cooking to      stir or turn   Ensure great presentation by      dressing dishes before they are served   Keep a sanitized and orderly      environment in the kitchen   Ensure all food and other items      are stored properly   Check quality of ingredients   Monitor stock and place orders      when there are shortages  Requirements and skills    Proven experience as chef   Experience in using cutting      tools, cookware and bakeware   Knowledge of various cooking      procedures and methods (grilling, baking, boiling etc.)   Ability to follow all      sanitation procedures   Ability to work in a team   Very good communication skills   Excellent physical condition      and stamina ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-jp-pepperdine-group-4d1e477f1d1b3254c76889dd511ca547?source=MCF&event=Search",
            "uuid": "05d921ac-2ec0-467e-9b14-ba5cecd48024"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Sous Chef",
            "skills": [
                "Recipes",
                "Microsoft Office",
                "Food Safety",
                "Cooking",
                "Sanitation",
                "Reliability",
                "Raw Materials",
                "Restaurant Management",
                "Good Communication Skills",
                "Attention to Detail",
                "Excess",
                "Staff Management",
                "Hazard Analysis"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "UNITED HOUSE, 20 KRAMAT LANE"
            },
            "company": {
                "logo": null,
                "name": "CLAYFUL PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description    Assists the Head Chef in carrying out all aspects of the kitchen’s day-to-day operations that precludes the management of food hygiene and safety, enforcing performance and quality standards, and monitoring to ensure attainment of these goals   Helps control and direct the food preparation process efficiently and professionally   Ensures that the kitchen runs on schedule and that food and related services are of a high grade   Supports the Head Chef in planning and coordinating tasks while keeping labor expenses in mind   Identifies and resolves any challenges that emerge in the kitchen as well as takes charge of any potentially dangerous scenario   Helps create meals using new or current culinary inventions or as the business prescribes   Approves and polishes dishes before they are delivered and served to customers   Produces quality menu that could change seasonally as the business requires   Places equipment, tools or ingredient orders in response to possible detected shortfalls   When required and directed, makes arrangements for repairs of cooking equipment   When directed by the Head Chef, hires, manages, trains and educates kitchen workers to be par with the highest possible culinary standards   Manages kitchen stocks and ensures minimal wastage   Assists to forecast and assess personnel requirements ensuring no shortage or excess of kitchen staff while keeping labor costs in control   Helps purchase, store, and handle all food products and materials within the agreed-upon budget and to maximize gross profit to include the effective staff management and staff salary   Helps supervise subordinates’ work on dishes and guides them, at times hand holding them, to produce the best expected outcome   Assists in ensuring that base food preparations and mise en place are well organized for service, allowing smooth kitchen operations   When required, regulates the workload of junior kitchen staff   Helps train kitchen staff to maintain consistency in the highest possible standard in food production and workplace hygiene, as well as to support a continuous improvement process   Helps maintain punctuality and attendance records   Follows and strictly implements all food and sanitary rules as well as safety guidelines   Encourages coworkers to cooperate and respect one another, motivates team work   Keeps updated in the latest trends in culinary trends and kitchen processes and technologies   Helps in the sourcing of food raw materials to ensure quality dishes and coordinates with vendors to guarantee reliability of ingredient supplies at the best possible quality within the department’s food cost target set by management   Assists in the preparation of duty rotas for kitchen staff to provide appropriate coverage at all times while accounting for the seasonality of the business and keeping overtime to the minimum   Ensures that staff are aware of the job list and the different sections it covers such as meal schedules, functions, and holidays   Helps the Head Chef to ascertain that the personnel follow the regulations on hygiene, stock rotation, dates, storages, refrigerator temperature control, pest control, reporting of malfunctioning equipment, reporting of notifiable illnesses, and reporting of absenteeism, whether due to illness or otherwise   If and when directed by the Head Chef, keeps recipe files in excellent condition and up-to-date   Undertakes any other duties and ad hoc related roles as the business requires  Qualifications    Associate or Bachelor’s Degree in Culinary Arts or Science, Business, or relevant fields   Three (3) to five (5) years of experience as a sous chef   Completed the WSQ Basic Food Hygiene Course – Food Safety Course Levels 1 and 2   Updated in control of substances hazardous to health (COSHH) regulations or hazard analysis critical control point (HACCP) methods   Working knowledge of kitchen organizing   Strong interpersonal and leadership skills   Quick in picking up concepts and possesses good logical and analytical problem-solving skills   Able to grasp business requirements and processes   Good understanding of computer software such as POS, restaurant management system, and Microsoft Office   Service oriented, meticulous, attention to detail   Good communication skills   Team player ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3800,
                "minValue": 2800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/sous-chef-clayful-69d18d47f3d6c0ea0026f6c320a10434?source=MCF&event=Search",
            "uuid": "b17018eb-f7c5-48b8-93b0-68cc0d863e61"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Chef De Partie",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Restaurants",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Communication Skills",
                "Working Under Pressure",
                "Team Player",
                "Catering",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TANGLIN MALL, 163 TANGLIN ROAD"
            },
            "company": {
                "logo": null,
                "name": "MAISON ANLI (PTE. LTD.)"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "We are looking for a talented chef de partie to help our culinary team create memorable meals for our restaurant's patrons. You will be responsible for a specific section of the kitchen, preparing high-quality food that meets the head chef's standards, and ensuring that your station is sanitary and well-stocked. To be successful as a chef de partie, you should be someone who can keep a level head when working under pressure. The ideal candidate will be an excellent team player, willing to go the extra mile in pursuit of great food and exceptional service. Chef de Partie Responsibilities:    Preparing specific food items and meal components at your station.   Following directions provided by the head chef.   Collaborating with the rest of the culinary team to ensure high-quality food and service.   Keeping your area of the kitchen safe and sanitary.   Stocktaking and ordering supplies for your station.   Improving your food preparation methods based on feedback.   Assisting in other areas of the kitchen when required.  Chef de Partie Requirements:    Qualification from a culinary school.   Past experience working in a similar role.   Ability to work well in a team.   Excellent listening and communication skills.   Knowledge of best practices for safety and sanitation.   Passion for delivering great food and service.   Multitasking and organizational ability. ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3000,
                "minValue": 2500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-de-partie-maison-anli-08e2c49154633e8e4fd13d86b0f21895?source=MCF&event=Search",
            "uuid": "6e8606f8-2c6a-4ae3-ba95-61403ea8bc6f"
        },
        {
            "dueDate": "2023-04-20",
            "jobTitle": "Junior Sous Chef",
            "skills": [
                "Recipes",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Stress",
                "Food Quality",
                "Inventory",
                "Team Spirit",
                "Problem Solving",
                "Sanitation",
                "Communication Skills",
                "HACCP",
                "Scheduling",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "26 MOHAMED SULTAN ROAD"
            },
            "company": {
                "logo": null,
                "name": "BISTECCA RESTAURANT PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description Warm, out-going, passionate, authentic, and inspiring? Yes, that’s you! Artemis Grill is hiring someone who associates with all the above. Join us as a Junior Sous Chef in Bistecca Restaurant. Because of this vital role, we are looking for someone who can:    To receive and manage deliveries   To control ; order cleaning ; hygiene items   To work in conjunction with Head chef ; sous chef in keeping hygiene ; safety standards through out the work place   To prepare, control the designated food items to the standards set by the Chef   To assist on preparing a healthy/ varied family meal   To carry out any other further task and responsibilities set out by the Head chef  You should have the following skills that we are looking for:    A supportive personality along with positive attitude   (1) year of related experience preferred   Passion to work in a dynamic environment   Strong interpersonal and communication skills  In return for your hard work, you can look forward to a highly competitive salary and benefits package:    Attractive salary including monthly incentives and overtime   Joining bonus (T;C applies)   Full training provided   Growth opportunities within the group   Welfare ; benefits   5 days work week ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/junior-sous-chef-bistecca-restaurant-c893471574c8031a4a1efdbd6f63c3ff?source=MCF&event=Search",
            "uuid": "66c74de0-e736-45fd-bb68-e6077e3b3164"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Head Chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Cecil",
                "Ingredients",
                "Cooking",
                "Appraisals",
                "Food Quality",
                "Inventory",
                "Job Descriptions",
                "Purchasing",
                "Enforcement",
                "Unloading",
                "Sanitation",
                "Compass",
                "Turnover",
                "Japanese"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "54 Tras St"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9f53132f07bdf9be45513ea67eafdd3c/nextbeat-singapore.png",
                "name": "AROMA SEITA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Descriptions    Control and direct the food preparation process and any other relative activities   Approve and “polish” dishes before they reach the customer   Plan orders of equipment or ingredients according to identified shortages   Arrange for repairs when necessary   Remedy any problems or defects   Be fully in charge of hiring kitchen staff.   Managing and training kitchen and service staff   Oversee the work of subordinates   Estimate staff’s workload and compensations   Maintain records attendance   Contacting the Executive Chef in the event of an emergency.   Maintain high standards of behaviour and discipline throughout their shift   Comply with nutrition and sanitation regulations   Foster a climate of cooperation and respect between co-workers   Having high communication skills and leadership   Correctly use and maintain the security of equipment   Actively promoting a customer focused culture within the kitchen and service teams and promptly addressing any customer complaints, concerns or queries.   Ensuring that fresh food and the full menu choice is available throughout the service period.   Providing a chef presence on dining area when required.   Working with front and back of house developing clear communication and an inclusive culture among all staff.   Construct menus with new or existing culinary creations ensuring the variety and quality of the servings   Suggesting ideas to develop and improve the food and service provided to meet and exceed the expectations of all its customers.   Working as an active and co-operative member of the team, willing to be flexible in approach to changes in practices and customer demands and needs.   Ensuring that all appropriate procedures are properly completed and appropriate kitchen records are maintained, in keeping with statutory requirements and policies and procedures.   Taking responsibility for your actions and your part in maintaining a safe working environment in all areas.   Proactively identifying risks and eliminating accidents from the work place by promoting an excellent Health ; Safety culture and practices among staff.   Reporting all complaints and incidents affecting health or hygiene to the Executive chef.  Job Requirement    10 years of related experience  Working hours    Mondays to Fridays : 10am - 3pm, 5pm - 10:30pm   Saturdays : 3:30pm - 10:30pm   Sundays : Not working ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/customer-service/head-chef-aroma-seita-faba6b5bc87f33ccb6194bf5bf249b16?source=MCF&event=Search",
            "uuid": "c2112061-5e01-4239-80c3-a5045409cf17"
        },
        {
            "dueDate": "2023-04-13",
            "jobTitle": "Head Chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Cost Management",
                "Purchasing",
                "Sanitation",
                "Payroll",
                "Climate",
                "Compliance",
                "Nutrition",
                "Directing",
                "Food Service"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE WARREN, 55 CHOA CHU KANG LOOP"
            },
            "company": {
                "logo": null,
                "name": "C3J LLP"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Prepare, control and direct food preparation process and any other relative activities Be responsible on cost management - plans order of equipment or ingredients and labour costs Managing and training kitchen staff Oversee the work of subordinates Compliance of SFA - sanitation regulations and safety standards At least 2 years of relevant experience Able to cook Western food (pasta, chicken chop, fish and chips etc) Cutting, grilling, frying etc Must be able to work shift and on weekends Willing and experienced to work as a Chef in eating house Able to work in a Non-Aircon environment",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3500,
                "minValue": 2600,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/head-chef-c3j-dd1813fd05cfcb1bbb2afc3359bea62e?source=MCF&event=Search",
            "uuid": "2f23c369-76a8-496c-b940-5852a8d235d8"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Head Chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Inventory Control",
                "Directing",
                "Food Service"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/8045f3ac082bde171ff2b3c83423fa31/aroma-food-enterprise.jpg",
                "name": "AROMA FOOD ENTERPRISE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "We are looking for an Izakaya Head Chef to work and lead a team at Holland Village / Bugis area.  Benefits: 1. 5.5 days work week 2. Accessible work location 3. Daily incentive upon hiting target 4. Health benefits provided upon confirmation 5. Staff meal allowance provided 6. Simple and sharp menu  Requirements: 1. Experience in both Sushi Bar and Hot Kitchen of at least 5 years 2. Creative, energetic, dynamic, passionate and always up for new challenges 3. Looking to grow a long-term career in our growing F;B company  ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/head-chef-aroma-food-enterprise-74b88da36392ee1b5462c5550836da5b?source=MCF&event=Search",
            "uuid": "d0a37a0a-2c2f-4bde-ae18-56e639d434c1"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Housekeeping",
                "Food Quality",
                "Inventory",
                "Purchasing",
                "Sanitation",
                "Compliance",
                "Baking",
                "Time Management",
                "Culinary Skills",
                "Pastry",
                "Japanese"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "ENTERPRISE ONE, 1 KAKI BUKIT ROAD 1"
            },
            "company": {
                "logo": null,
                "name": "GOLDEN PILLOW 933 PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Prepares and cooks dishes to a high standard, in accordance with recipes and instructions from the Executive Chef/Sous Chef.   Monitors and manages inventory levels within their section, ensuring that all ingredients are stocked and stored correctly.   Ensures that food is cooked and presented to the highest standards, following health and safety guidelines and adhering to food hygiene regulations.   Communicates effectively with other members of the kitchen team, including the Executive Chef, Sous Chef, and other Chef de Parties, to ensure a smooth and efficient service.   Assists with menu planning and development, providing ideas and suggestions for new dishes and improvements to existing ones.   Maintains a clean and organized section of the kitchen, including equipment and work surfaces.   Performs any other duties as assigned by the Executive Chef/Sous Chef. ",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-golden-pillow-933-766d383c43fa99cf43372a72afdb13d8?source=MCF&event=SuggestedJob",
            "uuid": "deb1d523-9f0c-4619-abeb-f17c5f2e0ed4"
        },
        {
            "dueDate": "2023-04-13",
            "jobTitle": "Chef de Partie",
            "skills": [
                "Recipes",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Fine Dining",
                "Pressure",
                "Catering",
                "Able To Work Independently",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "Century Square, 2  Tampines Central 5"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/89b64fd7aac4bf850442b92c925e94b6/prime-supermarket.png",
                "name": "PRIME SUPERMARKET LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "We are looking for dedicated individuals who strive to produce good quality and delicious food!  Job Responsibilities    Oversee the production of Chinese cuisines   Ensure all food preparation meets standards   Prepare and present good quality food   Keep all working areas clean and tidy   Ensure proper storage of food   Report maintenance, hygiene and hazard issues   Comply with all health and safety and food safety regulations   Support Head Chef in all areas of kitchen management  Job Requirements    1-2 years’ experience as a Chef de Partie in Chinese cuisine   Possess Basic Food Hygiene Certificate   Good working attitude   Able to work independently and under pressure  Job Types: Full-time, Permanent  Benefits:    Employee discount   Food provided   Professional development  Schedule:    Day shift  Supplemental pay types:    Attendance bonus   Performance bonus  Experience:    Chef: 1 year (Preferred)  License/Certification:    basic food hygiene certification (Required)  Benefits:    Employee discount ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 2800,
                "minValue": 2600,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-de-partie-prime-supermarket-0e3ceee81b2900c4d1304ca23ee77c54?source=MCF&event=Search",
            "uuid": "15a9055d-c046-4bb0-a2d0-99cb81b2f0e8"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Sous Chef",
            "skills": [
                "Recipes",
                "Leadership",
                "Cecil",
                "Ingredients",
                "Cooking",
                "Appraisals",
                "Food Quality",
                "Inventory",
                "Job Descriptions",
                "Purchasing",
                "Enforcement",
                "Unloading",
                "Sanitation",
                "Compass",
                "Turnover",
                "Japanese"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "20 Teck Lim Rd"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9f53132f07bdf9be45513ea67eafdd3c/nextbeat-singapore.png",
                "name": "EIGHT ONE NINE ONE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Brief description of the Restaurant    Located in the buzzing Keong Saik Road dining enclave, Ahāra is chef-owner Vikramjit Roy’s rock ballad to India.    Through both food and art, Roy’s first restaurant in Singapore, is a reflection of his roots and culinary journey that has taken him across the seas from India to Japan.  Job Descriptions (Roles and Supporting Responsibilities)    Help in the preparation and design of food menus   Produce high quality plates both design and taste wise   Ensure that the kitchen operates in a timely way that meets our quality standards   Fill in for the Head Chef in planning and directing food preparation when necessary   Resourcefully solve any issues that arise and seize control of any problematic situation   Manage and train kitchen staff, establish working schedule and assess staff’s performance   Order supplies to stock inventory appropriately   Comply with and enforce sanitation regulations and safety standards   Ensure that the team is always well turned out and provide adequate training to ensure that they offer professional and courteous service to all internal and external guests   Be able to recognise our regular patrons and their needs and preferences  Job Requirement    2-3 years of working experience in a similar role   Understanding of various cooking methods, ingredients, equipment and procedures   Familiar with industry’s best practices   Working knowledge of various computer software programs (MS Office, restaurant management software, POS)   Positive attitude and excellent communication skills   Well-organised and clean   Keen for opportunities to learn and grow within the organisation   Able to commit to shift work   Location – Walking distance from Outram Park or Maxwell MRT Station  Benefits    14 days AL, Medical and Hospitalization  Working hours    5 days / 44hrs Sunday and Monday Closed ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/customer-service/sous-chef-eight-one-nine-one-89edfcccbc63077775e4d39b90336319?source=MCF&event=Search",
            "uuid": "c496c06c-5e42-4173-8eff-4960ba7fd387"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Chef de Partie",
            "skills": [
                "Recipes",
                "Budgets",
                "Leadership",
                "Ingredients",
                "cook the menu",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Administration",
                "Sanitation",
                "Italian cuisine, cooking experience",
                "Attention to Detail",
                "Prevention",
                "Food Service",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "126 Neil Road"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/e95b61dfdee9cb289f7ec9c159fd8d36/craig-road-property-holdings.png",
                "name": "CRAIG ROAD PROPERTY HOLDINGS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The Chef de Partie is required to supervise and oversee the preparation of breakfast, lunch, and dinner food items per guest orders or as assigned by kitchen management in accordance with production requirements and quality standards while maintaining a safe, sanitary work environment.  We are looking for an individual who is passionate about cuisine! He/She should be attention to detail and has a strong work ethic. The candidate is expected to work together with other team members on a daily basis to ensure a flawlessly executed final product and the ability to supervise and train the line cooks is required.     In the absence of the Chef de cuisine / Sous Chef take full responsibility for the running of the kitchen.   Assist in the employment and retention of all staff.   Supervise all commis chef's in the department.   Assist in the maintenance of company paperwork.   Assist in maintaining budgets and cost throughout all of the kitchens.   Assist and supervise the agreed standard of food service during shift.   Liaise and co-operate effectively with all other associated members of staff.   Supervise the training of all new staff members in the department.   Promote the safe use of the kitchen, its equipment and building under the Health and Safety at Work acts, Hygiene and other regulations.   Ensure all relevant food controls and correct temperatures are logged and adhered to at all time.    Ensure the agreed standards of food preparation and presentation are adhered to at all times.   Ensure all daily paperwork is filled out in accordance to company and government guidelines.   To provide a friendly, courteous, quick, efficient and professional service at all times.   Be aware of all relevant food suppliers and their products. Be in charge of ordering.   Supervise the smooth and efficient service and production of food from the department by working and liaising with other departments and Restaurant staff, and ensuring all necessary work is completed prior to the commencement of service.   To assist in the prevention of pilferage from the dry stores and refrigeration within the department. Control wastage by maintaining the correct stock levels and rotation from dry stores and avoid the over production of food and mis en place.   To be aware of the required food cost percentages as set down by the budget and to assist in the supervising and running of the department within these guidelines at all times.   To assist other sections of the kitchen in the production and service of food or the cleaning down of the section as and when required due to the workload.   To ensure all working areas of the kitchen, dry stores and refrigeration are maintained in a clean and hygienic condition at all times, and especially after your shift has finished.   To make sure, in conjunction with your team that all section files and recipes are maintained and updated.   To maintain constant quality control of all food prepared and cooked ensuring it is to the Head Chef’s and Restaurant standards.   To ensure all main cool rooms are tidy and clean at all times, especially after each service, so the Duty Chef can carry out daily ordering.   To ensure that all health marks are collected and allocated to the correct administration.   To operate the pass service of food from the kitchen to the restaurant, liaising with the Restaurant staff and ensuring the food is to the standard required by the Head Chef.   To provide a clear handover during shift changes   To ensure all staff within your team are well briefed on the daily responsibilities and are given constant supervision and motivation in all aspects of their work.   To report any problems, accidents or kitchen equipment defects to the Head Chef.   To confirm with the Head Chef and Senior Sous Chef any special requirements (including menu items and dishes), outstanding orders or work tasks required from your section.   To ensure all staff within your team are well briefed on the daily responsibilities and are given constant supervision and motivation on all aspects of their work.   To make yourself aware and notify your staff to all menu changes, specialties, function menus and changes to standards prior to the commencement of service. ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3600,
                "minValue": 2500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-de-partie-craig-road-property-holdings-bf0009a5030cb09aa8f7bb3a6c37260a?source=MCF&event=Search",
            "uuid": "4e62a7b0-e6b1-4491-910b-1de74a37bf30"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Junior Sous Chef",
            "skills": [
                "Recipes",
                "Lifestyle",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Workplace Safety",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "UNITED HOUSE, 20 KRAMAT LANE"
            },
            "company": {
                "logo": null,
                "name": "CLAYFUL PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Get to know us first! What is INITIA GROUP? The biggest lifestyle beauty lounge. INITIA Group sets out to find a consumer service business that is experience-based, differentiated and advantaged, non-seasonal, non-cyclical, highly predictable, has strong senior management, and strong online presence. Initia has been in the beauty industry and has created a series of new concept salons that blend with lifestyle and trends to provide unique and fascinating lounges. Initia is not just doing beauty business alone, but it also has business in the F;B Industry and Art. It has been around for years and it has been working with local and many Korean companies in Singapore and in Malaysia.  Our brands : Bada (Previously known as Leekaja Salon) Singapore Walking on Sunshine You are my Sunshine F;B  We are looking for a talented Chef/Cook to be our Junior Sous Chef. If you are currently a cook or Chef De Partie (CDP), welcome to challenge yourself by joining and supporting our culinary team in creating delightful meals for our restaurant/cafe. This is an important job in any kitchen that comes with a lot of independence. He/She will be responsible for preparing high-quality food that meets the head chef's standards.  DUTIES ; RESPONSIBILITIES :    Following directions provided by the head chef.   Collaborating with the whole culinary team to ensure high-quality food and service.   Keeping the kitchen safe and sanitary.   Stocktaking and ordering supplies.   Assisting in other areas of the kitchen when required.   Handling any problems that may arise.  QUALIFICATIONS :    Associate or Bachelor’s Degree in Culinary Arts or Science, Business, or relevant fields   At least 3 years experience working in a similar role.   Ability to work well alone and in a team.   Passion for delivering great food and service.   Knowledge of best practices for safety and sanitation.   Multitasking and organizational ability.   Flexibility in working hours subject to the demands of the business. ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3000,
                "minValue": 2200,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/junior-sous-chef-clayful-cade1b565c44410fef55b32349ba7d69?source=MCF&event=Search",
            "uuid": "09f63bea-7264-41ad-a77b-3acdd46fb9ec"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Junior Sous Chef",
            "skills": [
                "Recipes",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Stress",
                "Interpersonal Skills",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Attention to Detail",
                "Teamoriented",
                "HACCP",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "120 TANJONG PAGAR ROAD"
            },
            "company": {
                "logo": null,
                "name": "KINTSUGI SPECTRE PRIVATE LIMITED"
            },
            "jobType": [
                "PART_TIME",
                "CONTRACTOR",
                "FULL_TIME"
            ],
            "description": "Job Title: Junior Sous Chef   Location: Singapore Job Type: Full-time  Job Description: We are currently seeking energetic and experienced kitchen crew to join our team in Singapore. As a kitchen crew, you will be responsible for assisting the head chef in preparing and cooking food, maintaining kitchen cleanliness and hygiene, and ensuring that all dishes are presented in an attractive and appetizing manner. Responsibilities:    Assist the head chef in food preparation, cooking, and plating of dishes   Follow standard recipes and cooking techniques to ensure consistency in quality and taste of food   Ensure that food is prepared and cooked in a timely and efficient manner   Maintain cleanliness and hygiene in the kitchen area, including washing dishes, utensils, and equipment, and cleaning food preparation areas   Stock and organize inventory, including food, ingredients, and supplies   Collaborate with other kitchen staff to ensure smooth and efficient kitchen operations   Adhere to all food safety regulations and guidelines   Report any issues or concerns to the head chef   Participate in kitchen training and development sessions  Requirements:    At least 1-2 years of experience working in a kitchen environment   Strong knowledge of food preparation techniques and kitchen safety practices   Ability to work in a fast-paced environment and prioritize tasks effectively   Attention to detail and a commitment to delivering high-quality dishes   Good communication and interpersonal skills, and the ability to work well as part of a team   Flexibility to work early morning, evening, and weekend shifts as required   Relevant certification or training in culinary arts is preferred but not mandatory  If you are passionate about cooking and enjoy working in a fast-paced, team-oriented environment, we encourage you to apply for this exciting opportunity in Singapore.",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3000,
                "minValue": 2600,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/junior-sous-chef-kintsugi-spectre-589a55d563b9e898d6ff7c3a2bec9839?source=MCF&event=Search",
            "uuid": "e099508f-27e2-49c5-b659-049d900317f3"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Chef De Partie",
            "skills": [
                "Recipes",
                "Ability to Multitask",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Fine Dining",
                "Climate",
                "Pressure",
                "Catering",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "TIME FOR THAI PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Prepare menus in collaboration with colleagues   Ensure adequacy of supplies at the cooking stations   Prepare ingredients that should be frequently available (vegetables, spices etc.)   Follow the guidance of the executive or sous chef and have input in new ways of presentation or dishes   Put effort in optimizing the cooking process with attention to speed and quality   Enforce strict health and hygiene standards   Help to maintain a climate of smooth and friendly cooperation  Requirements and skills    Proven experience in a Chef de Partie role   Excellent use of various cooking methods, ingredients, equipment and processes   Ability to multitask and work efficiently under pressure   Knowledge of best cooking practices ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-de-partie-time-thai-0d5809530078f1858fe1ae4a7abbe1db?source=MCF&event=Search",
            "uuid": "daec9867-ad52-4df9-807e-3e15e9972fc9"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Chef De Partie",
            "skills": [
                "Recipes",
                "Ability to Multitask",
                "Leadership",
                "Ingredients",
                "Quality Control",
                "Food Safety",
                "Cooking",
                "Food Quality",
                "Inventory",
                "Sanitation",
                "Fine Dining",
                "Climate",
                "Pressure",
                "Catering",
                "Hospitality"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "AL CAPONE'S KALLANG PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Prepare menus in collaboration with colleagues   Ensure adequacy of supplies at the cooking stations   Prepare ingredients that should be frequently available (vegetables, spices etc.)   Follow the guidance of the executive or sous chef and have input in new ways of presentation or dishes   Put effort in optimizing the cooking process with attention to speed and quality   Enforce strict health and hygiene standards   Help to maintain a climate of smooth and friendly cooperation  Requirements and skills    Proven experience in a Chef de Partie role   Excellent use of various cooking methods, ingredients, equipment and processes   Ability to multitask and work efficiently under pressure   Knowledge of best cooking practices ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/chef-de-partie-al-capones-kallang-652d44b843757ea79cf42a4e4941b0df?source=MCF&event=Search",
            "uuid": "045fd043-c96a-4b79-bfc7-2e746456494c"
        },
        {
            "dueDate": "2023-04-29",
            "jobTitle": "Assistant Chef",
            "skills": [
                "Product Knowledge",
                "Recipes",
                "Ingredients",
                "Food Safety",
                "Cooking",
                "Appraisals",
                "Workplace Safety",
                "Food Quality",
                "Inventory",
                "Assurance",
                "Sanitation",
                "Compliance",
                "Team Management",
                "Communication Skills",
                "Team Player",
                "Cut"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "114 SIMS AVENUE"
            },
            "company": {
                "logo": null,
                "name": "MING LI'S EATING HOUSE"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Main Job Responsbilities    Assist Chef with daily food preparation   Resolves issues in a tactful way.   Assist in bi-monthly stock take and ensure quality and account for each delivered item   Mentor kitchen team on maintaining recipe, cooking and preparation procedures ; standards   Perform routine inspection and evaluation of work station; including food presentation, quality, food hygiene, kitchen cleanliness and safety   Conduct orientation, training for new trainees   Adhere to company’s standard operating procedures   Any other appropriate duties and responsibilities as assigned   Able to work night shift and split shift   Able to do OT on weekends and public holiday  Requirements    Minimum 5 years of relevant experience in F;B industry   Have good product knowledge on food items   Candidate must possess basic computer knowledge and strict sense of hygiene and safety standards   Excellent organizational skills and communication skills ",
            "datePosted": "2023-03-30",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4600,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/food-and-beverage/assistant-chef-ming-lis-eating-house-3066901449f269228a14c2a9190b644c?source=MCF&event=Search",
            "uuid": "62f3efc2-6d27-4653-b1a1-ab768113836d"
        }
    ]
}