{
    "jobs": [
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Mechanical Engineer (Design)",
            "skills": [
                "Equipment Sizing",
                "Feasibility Studies",
                "Revit",
                "Autodesk Revit",
                "Modeling",
                "HVAC",
                "Building Services",
                "3D",
                "Fabrication",
                "Compliance",
                "Digitization",
                "AutoCAD",
                "Bridge",
                "Layout",
                "CAD",
                "Mechanical Engineering"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "UE SQUARE, 83 CLEMENCEAU AVENUE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/21c7fd650fb37e317fc226d6797d4d32/coens-energy.jpg",
                "name": "COENS ENERGY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Responsibilities:    To involve in the planning and design of mechanical engineering works for building services    Prepare design reports, calculations, tender documents, detail design, technical specifications, and BOQ for tenders.   To attend the tender briefing and clarification meetings and to respond to RFI.   To carry out design authorship site visits for inspection, necessary supervision, and preparation of inspection reports.   To provide supervision when necessary for the installation and commissioning of mechanical services and airport systems.   To collaborate with peers of other disciplines in feasibility studies and design, as well as ensure excellent delivery of service to clients.  Job Requirements:    Degree in Mechanical Engineering/Building services from a recognized University.   Minimum 3 years of working experience in the building services design industry as a design engineer. Those with more than 6 years will be considered for the Senior role.    Proficient in Autodesk Revit MEP, and AutoCAD applications for mechanical, plumbing services design layout modeling, and detailing.   Proficient in mechanical and plumbing services design calculations   Well-versed in international building codes, International plumbing codes, NFPA standards 13, 14, 2001, and ASHRAE standards for understanding the requirement and design compliance check.   Candidates will be required to travel overseas to attend design presentations, client meetings, and design workshops. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/mechanical-engineer-coens-energy-dfd17e8c370495a4144a16ca8344f64d?source=MCF&event=Search",
            "uuid": "0ed030f4-9d9d-4d70-8fb4-1c8a547bb878"
        },
        {
            "dueDate": "2023-05-06",
            "jobTitle": "Technical Designer",
            "skills": [
                "Designer",
                "Construction",
                "Concept Design",
                "Asbuilt Drawings",
                "Architectural",
                "Drawing",
                "3D",
                "Attentive",
                "Autodesk Autocad",
                "Engineering Design",
                "Communication Skills",
                "AutoCAD",
                "Layout"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "21 TUAS WEST AVENUE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/06109d2fc66de53921768ffd28d88923/two-nine-six-o-trading.jpg",
                "name": "TWO NINE SIX O TRADING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Roles ; Responsibilities · Coordinate with principals, sales, project team and clients to produce valued engineering design ; construction documents. · Strong knowledge of building/Façade systems · Plan concept design by studying construction specifications and material details. · Prepare 2D ; 3D Detail Drawings with Autocad. · Well organize design drawing sets. · Obtain approvals from clients with concept drawings. · Preparation of Shop, Construction and As-built drawings. · Maintains technical knowledge by attending design workshops. · Contributes to team effort by accomplishing related results as needed.  Requirements · Degree in Engineering related to construction sector. · Well versed with Autodesk Autocad software. · Good verbal, written and graphic communication skills. · Able to communicate well in English. · Self-motivated and enjoys contributing to highly collaborative teams · Possess initiative ; good working attitude · Flexible and well-rounded to accommodate shifting schedules, project demands, multiple time zones, and deadlines.  Kindly indicate the following information in your CV · Current / Last Drawn Salary (in SGD) · Expected Salary (in SGD) · Availability · Residency Status in Singapore",
            "datePosted": "2023-04-06",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/technical-designer-two-nine-six-o-trading-ed1697442d4db17623d1080d293b6123?source=MCF&event=Search",
            "uuid": "69ee1e76-5836-4091-a606-6517d008faa3"
        },
        {
            "dueDate": "2023-04-13",
            "jobTitle": "Project Engineer",
            "skills": [
                "Revit",
                "Autodesk Software",
                "Microsoft Office",
                "Construction",
                "BIM",
                "Drawing",
                "Electrical",
                "Risk Management",
                "Project Planning",
                "Project Management",
                "Construction Drawings",
                "Communication Skills",
                "AutoCAD",
                "Civil Engineering",
                "Scheduling",
                "Commissioning"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "102 HENDERSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/45b77b45d154693c4b2d7783bc2aa23f/gws-living-art.png",
                "name": "GWS LIVING ART PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "GWS Living Art is a team of urban greenery specialists based in Singapore, we specialise in green technologies such as Green Wall and roof systems to bring greenery into your urban spaces. We also do Rainwater harvesting, automated irrigation systems to allow low watering requirements within an urban city. We truly believe that since our inception in 2017, that it is an urgent need to have more carbon sinks around our city and our world. We are looking a Project Engineer to join our team! In a construction team, the Project Engineer works under the guidance of the Project Manager in the execution of construction projects. Candidates who possess suitable qualities will be closely mentored to gain both technical and management qualities. It is a role with good developmental potential as candidates can eventually pursue a career in Project Management, Safety Management or Professional Certifications.  Job Description:    Assisting to plan for the progress of various projects through the deployment of manpower, equipment and logistics   Assist in the preparation of technical documents, such as construction drawings   Work together with other members of the team to effectively execute the operations plan   Assist in the safety and risk management of operations   Other ad hoc duties as required  Requirement:    1 or 2 years of working experience as a Project Engineer would be an advantage.   Both fresh graduate and experienced candidates are welcome to apply (mature and non-mature).   Recent postgrads with a Bachelor’s degree in Engineering preferably Mechanical ; Electrical / Civil Engineering / Environmental.   Basic Microsoft Office skills and Construction knowledge.   Knowledge of Safety and Risk Management would be advantage.   Knowledge of using any Autodesk software (e.g. AutoCAD/ Revit/ BIM 360) would be an advantage.   Good interpersonal and communication skills.   Able to start work in short notice will be preferred. ",
            "datePosted": "2023-03-14",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3500,
                "minValue": 2800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/project-engineer-gws-living-art-34297c690e7fcb6e43119cdb96b056bb?source=MCF&event=Search",
            "uuid": "06d9aa5b-028a-46bb-bebd-8184c15effcd"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "Software Engineer [PSET- Developer Enablement - Autodesk Connected Delivery]_23WD67894",
            "skills": [
                "Troubleshooting",
                "Analytical Abilities",
                "Software Engineering",
                "Agile",
                "JavaScript",
                "Python",
                "Writing",
                "Team Player",
                "Java",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview We are Autodesk’s Delivery Platform Team. Our vision is to provide Autodesk's customers with a platform that enables a consistent and intuitive way to access Autodesk's products and services in a fast and reliable manner. We are on a mission to modernize our existing platform to offer a world-class experience. We embrace the values of an agile team. We are looking for an engineer who shares our values, particularly those who aspire to build cross-platform services, api, and applications. We are offering recent graduates or engineers with 0-2 years of Software Engineering experience with an exciting opportunity to join our amazing team, based in Singapore. Responsibilities    Collaborate with a team of highly skilled engineers and product managers in delivering software following agile practices and principles such as continuous improvement and continuous delivery   Help design, develop, deploy, and operate a platform that serves millions of users globally   Contribute to a team culture that values openness, collaboration, initiatives, and innovation while promoting individual and collective growth  Minimum Qualifications    Bachelor’s or Master’s degree in Computer Science, Computer Engineering or related technical discipline   0-2 years of Software Engineering experience   Good understanding of object-oriented design, and a good grasp on at least one programming language like C++, Java, Python etc.  The Ideal Candidate    You think about systems and love writing high-quality code We work mostly in C#/C++/Java/Python/Golang/JavaScript and AWS. However, languages and technology can be learned: we care much more about your general engineering skill than knowledge of a particular programming language, framework, or technology   You enjoy working in a highly collaborative team following agile practices such as test-driven development (TDD) and pair programming   You are passionate about learning new technologies and committed to continuous improvement   You are an ideal team player; you work with a sense of energy, passion, and personal responsibility, and taking on whatever you possibly can for the good of the team   You possess excellent communication, sharp analytical abilities, and love problem-solving ",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7017,
                "minValue": 4683,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-pset-developer-enablement-autodesk-connected-delivery23wd67894-autodesk-asia-4f9bb281dc092bab78dbd9f96028dd53?source=MCF&event=Search",
            "uuid": "ab82bede-8a91-41a1-8a16-6ac5c06def25"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "Software Engineer_23WD67320",
            "skills": [
                "Troubleshooting",
                "Pipelines",
                "Design Patterns",
                "Data Structures",
                "REST",
                "Agile Methodologies",
                "JavaScript",
                "Amazon Web Services",
                "3D",
                "Logging",
                "Ruby",
                "Adaptability",
                "Docker",
                "Databases",
                "Software Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview Autodesk's Design and Engineering innovative software enable Designers and Engineers to imagine, design, and create the world around us: cars, buildings, bridges, movies, clothes, 3D printed objects and so much more.  We provide our customers with a broad portfolio of software to solve their design, business, and environmental challenges. Autodesk’s cloud transformation is revolutionizing our industry, enabling Designers and Engineers to collaborate from anywhere on any device. Autodesk is seeking a highly motivated Software Development Engineer on Consolidated Subscription Services (CSS) team. You will be part of a team that designs and develops high-performance mission-critical cloud services that serve millions of requests per day using some of the latest technologies. Responsibilities    Demonstrate technical excellence resulting in scalable, reliable, performant and maintainable services   Contribute to the design and architecture to enable secure, scalable and maintainable software   Write high quality code and tests following test-driven design principles   Participate in code and design reviews to ensure new code conforms to highest standards   Work within an agile framework to continuously deliver quality software in a fast-paced environment   Assist in improving the operations of services, e.g., monitoring, alerting, metrics, logging and troubleshooting  Minimum Qualifications    Bachelor’s degree or higher in Computer Science, Engineering or related field   Experience of working with one or more of the following languages: Go, Ruby, JavaScript   Understanding of Object-Oriented design, data structures and algorithms  Preferred Qualifications    Experience in a variety of backend technologies:  REST APIs, caching, databases, event driven systems, stream processing, deployment pipelines, systems monitoring etc   Demonstrated ability to pick up new languages, tools and design patterns as needed   Hands-on experience working with Amazon Web Services   Experience with agile methodologies   Team player — you love to teach others about cool new tricks you have learned and absorb tips and tricks from developers; love solving problems as a team across platforms, and are enthusiastic about synchronous collaboration in addition to heads-down work   Comfortable working in newly forming ambiguous areas where learning and adaptability are key skills  Some of the technologies we use    All things AWS…   Go   JRuby   Node.js   Docker   Redis ",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7017,
                "minValue": 4683,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer23wd67320-autodesk-asia-535ac315f9c4cfafd7ed6c646796e5d6?source=MCF&event=Search",
            "uuid": "8cc65f49-6916-48be-8115-5c95e5f0217f"
        },
        {
            "dueDate": "2023-04-16",
            "jobTitle": "Mechanical Design Engineer",
            "skills": [
                "Feasibility Studies",
                "Pneumatics",
                "Process Automation",
                "Tolerance",
                "Solidworks",
                "Drawing",
                "3D",
                "Design for Manufacturing",
                "Autodesk Inventor",
                "Project Timeline",
                "Vibration Control",
                "Assembly Processes",
                "Assembly",
                "Manufacturing",
                "CAD"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TECHPLACE II, 5008 ANG MO KIO AVENUE 5"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/e4935c12f6f124c4af40b7c8b7ee9596/axis-tec.jpg",
                "name": "AXIS-TEC PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Duties and Responsibilities:    To apply proper feasibility studies, drive design specifications, and provide support of design proposal.   Responsible of conceptual and detail design for standard and customized build automation/equipment such as material handling, process automation, fixturing and tooling.   Generation of detail CAD design and drawing using Autodesk Inventor or equivalent.   Generation and release full set of design documentation.   Perform tolerance stack-up and various analysis on critical design parameters on the quality of the development project.   Working closely with manufacturing team on DFM, generating assembly processes and qualification procedure including of documentation.   Hand on prototype assembly, testing and qualification inclusive of trouble shooting.   Collaborate with other teams to ensure the project timeline and budget is adhered and all design requirements are specified and delivered.  For Senior Engineer    To source, evaluate and procure all mechanical and process components.   Participation in implementation of development documentation control and database system.  Job Qualifications:    Min Bachelor’s degree in Mechanical/Mechatronics Engineering or equivalent   At least &gt;3 years / &gt;5 years for senior position in designing industrial automation equipment, product assembly and test fixtures.   Familiar with components sizing of pneumatics and motion components such as servo motors and mechanical drive components.   Experience in Design for Manufacturing (DFM) and Design for Assembly (DFA).   Good knowledge in Geometric Dimensioning and Tolerancing (GD;T)   Must be proficient in 3D cad preferable Autodesk Inventor.   Experience in several of these areas are added advantage such as motion system, opto-mechanical systems, thermal and vibration control, design of laser structures.   Committed and self-motivated, a life-learner and good team player, able to work with minimum supervision in a dynamic environment.   Willing to travel in Asia region for assignments with short notice. ",
            "datePosted": "2023-03-17",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/mechanical-design-engineer-axis-tec-debf94e682114266e60f96f09b74583e?source=MCF&event=Search",
            "uuid": "65322737-e257-4f12-8379-3659485c015f"
        },
        {
            "dueDate": "2023-05-06",
            "jobTitle": "Drafter",
            "skills": [
                "Microsoft Office",
                "Construction",
                "Asbuilt Drawings",
                "Architectural",
                "Drawing",
                "3D",
                "Autodesk Autocad",
                "Communication Skills",
                "AutoCAD",
                "Layout",
                "CAD"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "21 TUAS WEST AVENUE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/06109d2fc66de53921768ffd28d88923/two-nine-six-o-trading.jpg",
                "name": "TWO NINE SIX O TRADING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Roles ; Responsibilities · Prepare 2D ; 3D Detail Drawings with Autocad. · Well organize design drawing sets. · Preparation of Shop, Construction and As-built drawings. · Maintains technical knowledge by attending design workshops. · Contributes to team effort by accomplishing related results as needed.  Requirements · Well versed with Autodesk Autocad software. · Good verbal, written and graphic communication skills. · Able to communicate well in English. · Self-motivated and enjoys contributing to highly collaborative teams · Possess initiative ; good working attitude · Flexible and well-rounded.  Kindly indicate the following information in your CV. · Current / Last Drawn Salary (in SGD) · Expected Salary (in SGD) · Availability · Residency Status in Singapore",
            "datePosted": "2023-04-06",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3800,
                "minValue": 2900,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/drafter-two-nine-six-o-trading-589081f9d5ec08543f226736cb492732?source=MCF&event=Search",
            "uuid": "e8626883-7dfe-4e52-b98b-ed4ca914f7d6"
        },
        {
            "dueDate": "2023-04-23",
            "jobTitle": "Junior MEchanical Design Engineer (AUTOMATED TESTING EQUIPMENT)(ATE)",
            "skills": [
                "Pneumatics",
                "Process Automation",
                "Solidworks",
                "Design for Manufacturing",
                "Autodesk Inventor",
                "Project Management",
                "Geometric Dimensioning & Tolerancing",
                "opto-mechanical engineering",
                "Design for Assembly",
                "Mechanical Engineering"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": null,
                "name": "RECRUITMENT ALLIANCE"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "5days, permanent, Ang Mo Kio Our client: Original equipment manufacturer (OEM) and of automated testing equipment (ATE) and system integrator of industrial automation solution. Year in business: 20 years Industries served: Semiconductor Job description: · To conceptualise and design for standard and customized automation equipment such as material handling, process automation, fixturing, and tooling. · To generate detailed CAD design and drawing using Autodesk Inventor or equivalent and release of the design documentation · To perform tolerance, stack up analyses on critical design parameters on the quality of the development project. · Project manage and cross department collaboration for DFM and DFA · Hands on in prototype assembly, testing, and qualification inclusive of troubleshooting. Requirement: · Diploma up in Mechanical/Mechatronics Engineering. · Familiar with components sizing of pneumatics and motion components such as servo motors and mechanical drive components. · Experience in Design for Manufacturing (DFM) and Design for Assembly (DFA) n project management. · Proficient in tolerance stack up in GD;T · proficient in the following are added advantage:  motion systems, Opto-mechanical systems, thermal and vibration control, design of laser structures. Whats on offer: (1) Good benefit (2) Stable Management (3) Dynamic work environment Please submit resumes to michelle@careersg.sg with the following details in MS Word format: - Position applying for - Current remuneration - Expected remuneration - Notice period Michelle Goh EA License No: 22C1142 We regret that only shortlisted candidates will be notified.",
            "datePosted": "2023-04-09",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/junior-mechanical-design-engineer-recruitment-alliance-30803ba7a44a76fd1e77befeb325d1ff?source=MCF&event=Search",
            "uuid": "a7433172-3fd4-4c36-930f-6c17e991be78"
        },
        {
            "dueDate": "2023-05-06",
            "jobTitle": "Technical Designer",
            "skills": [
                "Designer",
                "Construction",
                "Concept Design",
                "Asbuilt Drawings",
                "Architectural",
                "Drawing",
                "3D",
                "Attentive",
                "Autodesk Autocad",
                "Engineering Design",
                "Communication Skills",
                "AutoCAD",
                "Layout"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "21 TUAS WEST AVENUE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/82cffd62d5868a297824ec956c52a25f/zgg.png",
                "name": "ZGG PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Roles ; Responsibilities · Coordinate with principals, sales, project team and clients to produce valued engineering design ; construction documents. · Strong knowledge of building/Façade systems · Plan concept design by studying construction specifications and material details. · Prepare 2D ; 3D Detail Drawings with Autocad. · Well organize design drawing sets. · Obtain approvals from clients with concept drawings. · Preparation of Shop, Construction and As-built drawings. · Maintains technical knowledge by attending design workshops. · Contributes to team effort by accomplishing related results as needed.  Requirements · Degree in Engineering related to construction sector. · Well versed with Autodesk Autocad software. · Good verbal, written and graphic communication skills. · Able to communicate well in English. · Self-motivated and enjoys contributing to highly collaborative teams · Possess initiative ; good working attitude · Flexible and well-rounded to accommodate shifting schedules, project demands, multiple time zones, and deadlines.  Kindly indicate the following information in your CV · Current / Last Drawn Salary (in SGD) · Expected Salary (in SGD) · Availability · Residency Status in Singapore",
            "datePosted": "2023-04-06",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/technical-designer-zgg-6a7abd0896814613fe12600f2be3f08f?source=MCF&event=Search",
            "uuid": "fd71a778-aadb-47ff-bb2c-43b442ca1fab"
        },
        {
            "dueDate": "2023-04-22",
            "jobTitle": "BIM Modeller",
            "skills": [
                "3D Modeling",
                "Designer",
                "Autodesk Revit",
                "Ability To Work Independently",
                "BIM",
                "Plant Design",
                "3D",
                "Autodesk Inventor",
                "Structural Engineering",
                "Piping",
                "Autocad 2d",
                "Wastewater Treatment",
                "CAD",
                "Commissioning"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "CLEANTECH ONE, 1 CLEANTECH LOOP"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9923a166de0c37224f9ca74aa94f52fe/gradiant-international-holdings.png",
                "name": "GRADIANT INTERNATIONAL HOLDINGS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Summary: Gradiant is seeking a CAD Design Engineer to support CAD Design engineering work for Water ; Wastewater Treatment Projects in Asia Pacific region. The candidate should have good technical, organizational and communication skills related to developing, supporting, and managing CAD detail design ; engineering work. Essential Duties ; Responsibilities:    Support CAD detail design ; engineering work as per the instruction and guidance from the supervisor / Sr. Mechanical Engineer / Manager.   Prepare CAD drawings and documents as per the guidance of supervisor / Sr. Mechanical Engineer / Manager.   Responsible for the Plant design including Tanks, Skids, equipment and piping design for Water and wastewater treatment projects.   Ensure compliance with approved design standards to provide quality designs.   Develop 3D Drawings and Models as per the project requirement.   Work closely with the Mechanical and piping engineer to ensure the designs are applicable and feasible.   Support other engineering, project management, installation, commissioning, and operation department as per the supervisor’s instruction and company requirements.  Requirements:    Candidate must possess bachelor’s degree or Diploma in Mechanical / Civil / Structural engineering or similar qualification.   Minimum 4+ years’ experience for CAD detail design and 3D model design work for engineering projects.   Software Proficiencies in: Autodesk Revit ; BIM 360, AutoCAD 2D ; 3D, Autodesk Inventor.   Technical experience Plusses: Tank, Skids and plant piping design in AutoCAD 2D ; 3D, Autodesk Inventor and other 3D modeling software knowledge ; experience, Autodesk BIM 360 knowledge ; experience, Autodesk Revit Site Designer knowledge ; experience.   Basic understanding of water and wastewater processes, PFDs and PIDs.   Experience of CAD detail design work for Water / Wastewater Treatment projects.   Familiar with International and Singapore CAD design standards.   Excellent analytical thinking, interpersonal/communication skills, writing and problem-solving capacities.   Reliable, well-organized and detail oriented.   Must have the ability to work independently and in an interdisciplinary team environment to perform all duties in a professional and timely manner.   The job scope may require travelling and working outside Singapore. ",
            "datePosted": "2023-03-23",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4200,
                "minValue": 3400,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/design/bim-modeller-gradiant-international-holdings-1fc1c7f4b0f754235239a56669bd7b39?source=MCF&event=Search",
            "uuid": "8a820a04-254d-4afb-9a59-c79d6b277855"
        },
        {
            "dueDate": "2023-04-12",
            "jobTitle": "BIM Modeller",
            "skills": [
                "structural drawings",
                "Revit",
                "Autodesk Revit",
                "Teamwork",
                "Microsoft Excel",
                "Construction",
                "BIM",
                "Civil & Structural Drafting",
                "Highly responsible",
                "Responsible for reporting",
                "Drawing",
                "Data Integration",
                "Tekla Structures",
                "Takeoffs",
                "AutoCAD",
                "Responsible for delivery"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "22 TANJONG KLING ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/0c80fb660a783e9b556e6ad28ead15de/natsteel-holdings.png",
                "name": "NATSTEEL HOLDINGS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Responsibilities 1. Perform BIM modelling in Tekla structures or autodesk revit 2. Perform reinforcement bar detailing in Tekla structures or autodesk revit 3. Perform reinforcement bar quantity take-offs. 4. Produce shop drawings (plans, elevations, sections and bar bending structures etc) 5. Maintenance company BIM standards / Carry out clash detection 6. Perform 2D reinforcement detailing as and when needed 7. Provide plug-ins and components to automate modelling and reinforcement detailing.  Job Requirements • Diploma or Degree in Civil structure engineering or its equivalent • Diploma or Modelling training in BIM certification • Minimum 2 years’ experience working as BIM coordinator/Modeller • Minimum 3 years of working experience in the Construction or consultancy industry • Initiative, teamwork, hardworking ; responsible • Able to work in a fast track project with tight deadlines • Familiar with BIM related software",
            "datePosted": "2023-03-13",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4900,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/bim-modeller-natsteel-holdings-988d12f2749c4576dc266ec0fd2d0aad?source=MCF&event=Search",
            "uuid": "aaba5c68-0467-40e9-ba35-5bba110ad10d"
        },
        {
            "dueDate": "2023-04-26",
            "jobTitle": "Senior / Mechanical Engineer",
            "skills": [
                "Feasibility Studies",
                "Autodesk Revit",
                "Construction",
                "Building Services",
                "Project Management",
                "AutoCAD",
                "Building Codes",
                "Green Building",
                "Building design",
                "Commissioning",
                "Mechanical Engineering"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "WESTGATE TOWER, 1 GATEWAY DRIVE"
            },
            "company": {
                "logo": null,
                "name": "CPG CONSULTANTS PTE LTD"
            },
            "jobType": [
                "FULL_TIME",
                "CONTRACTOR"
            ],
            "description": "Job Responsibilities:    Responsible for leading the planning and design of Mechanical engineering works for building services and infrastructure works.   Review reports, specifications, calculations, drawings and other documents prepared for the different stages of a project.   Supervise the installation, testing and commissioning of Mechanical engineering works.   Work together with other disciplines in feasibility studies and design, as well as to ensure excellent service delivery to Clients.   Job Title will correspond with project experience acquired and individual competency in technical knowledge/skills, project management and contract administration.  Job Requirements:    Degree in Mechanical Engineering recognised by the Professional Engineers Board, Singapore.   Registered with the Professional Engineers Board, Singapore.   Minimum 6 years of relevant experience in Mechanical engineering design for building services and infrastructure works.   Good working experience in a consulting firm with a proven track record in major development projects.   Conversant with local codes and regulations, and authority submission procedures.   Strong planning, organizational and supervisory skills.   Knowledge of AutoCAD and/or Autodesk Revit is advantageous. ",
            "datePosted": "2023-03-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7500,
                "minValue": 5000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/architecture/senior-mechanical-engineer-cpg-consultants-50f10f551c65bf28142cf980d59f2dfc?source=MCF&event=Search",
            "uuid": "8c9870f4-b590-46d3-8cb3-a8168936ca07"
        },
        {
            "dueDate": "2023-04-23",
            "jobTitle": "Engineer",
            "skills": [
                "Troubleshooting",
                "Construction",
                "Hardware",
                "Electrical",
                "PowerPoint",
                "SQL",
                "Networking",
                "Python",
                "Java",
                "Manufacturing",
                "CAD",
                "Linux",
                "Electronics",
                "Software Development",
                "Technical Support"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "202 BEDOK SOUTH AVENUE 1"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/a5a0ed826fa42265aa221dc5fb14161a/panasonic-asia-pacific.jpg",
                "name": "PANASONIC ASIA PACIFIC PTE. LTD."
            },
            "jobType": [
                "FULL_TIME",
                "CONTRACTOR"
            ],
            "description": "Responsibilities:    As part of Manufacturing Innovation Group activities, we are developing and commercializing autonomous mobile robot systems. The target of this activity is to develop new autonomous mobile robot system based on the commercialized AMR, ”HOSPI”.   The main responsible is for developing autonomous mobile software and its server system software for control multiple robots and facilities. The responsible is also including robot instalment and ramping up to the customer.   Understand control software of the autonomous mobile robot “HOSPI” and modify it to the local customers   Understand management software of “HOSPI” (HOSPI server) and develop additional functions to it for the local customers   Develop and verify integration between the HOSPI server and the Robot Middleware Framework developed by CHART   Promote POC of the autonomous mobile robot with Panasonic System Solutions Asia Pacific which is the sales department.   Understand the operation and adjustment of HOSPI, and operate HOSPI   Install and ramp up HOSPI to the customers with applying the designates local functions  Requirements:    Technical skills in ROS or ROS2.   At least Diploma and above in engineering related fields.   Able to use CAD system (AutoDesk/Inventor, Solid works)   Basic PC knowledge (Excel, Word, Powerpoint)   Good IT knowledge and experience in OT environment (manufacturing) is an advantage. ",
            "datePosted": "2023-03-24",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/engineer-panasonic-asia-pacific-b4b1535058d3010e13bf20527a4d05d9?source=MCF&event=Search",
            "uuid": "f6bdbe94-cbc1-4518-94ac-7eb6202d69c4"
        },
        {
            "dueDate": "2023-05-05",
            "jobTitle": "BIM/CAD Technician MEP",
            "skills": [
                "Revit",
                "Construction",
                "BIM",
                "Architectural",
                "Rail",
                "Drawing",
                "HVAC",
                "Electrical",
                "Building Services",
                "Sustainable Development",
                "3D",
                "Wellbeing",
                "AutoCAD",
                "Electrical Engineering",
                "CAD"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "FRASERS TOWER, 182 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "ARUP SINGAPORE PRIVATE LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Do you want to make a positive impact on the world? Sustainable development is at the heart of everything we do. Seventy-five years ago, we created a home for creative thinkers seeking to solve the world’s biggest challenges. Today, a collective of 16,000+ Arupians gather across the globe from 140 different countries to build a sustainable future. We strive to create an inclusive environment and give everyone a voice. Diversity drives innovation in our projects and offers empathy to the communities we serve. We welcome and encourage applications from people living with disability and provide workplace adjustments. At Arup, you’ll do more than work — you’ll shape a better world. About this role This role will be responsible for the production and quality checks on Building Services (Mechanical, Electrical and Plumbing) BIM Models and Drawings. What will I do?    Responsible in the production and quality checks on Building Services (Mechanical, Electrical and Plumbing) BIM models and drawings, and Combined Services coordination and drawing preparation   Produce or support production and quality checks on Civil and Structural, Architectural or other disciplines BIM models and drawings as the need arises   Resolve complex multidisciplinary modelling, engineering and design issues through coordination and liaison with internal Arup parties and external parties.   Perform spatial checks and undertake clash detection.   Prepare documents and drawings to assist engineers, planners or designers for submission to relevant Authorities and required to author non-standard models, drawings, letters, reports and other documentation.  What will I bring?    Recognized tertiary qualifications in Mechanical and Electrical Engineering, Architecture, Building Information Modelling, Computer Aided Drafting or similar domain   A minimum of 5 years relevant experience in the construction industry and built environment, and preferably in Heavy Infrastructure, Rail and Underground Metro   Building Construction Authority Academy Specialist Diploma in Building Information Modelling is preferred.   Experience in HVAC (Heating, Ventilating and Air-Conditioning) are preferred.   Working knowledge of at least one primary 3D BIM product including configuration, set-up and management of models supported by a common data environment with strong background using Autodesk suite of products, especially Revit and Autocad as well as Bentley suite products (V8i and Connect Edition)  Our firm  Dedicated to sustainable development, the firm is a collective of 16,000 designers, advisors and experts working across 140 countries. Founded to be both humane and excellent, we collaborate with our clients and partners using imagination, technology and rigour to shape a better world. We create spaces where everyone feels safe, seen and included and able to perform at their best. We take an approach to flexible working that supports the diversity and well-being of our members. Are you ready to shape a better world? Our open roles are waiting for you on the Arup careers page. If you like what you see here, apply today. Arup does not accept unsolicited resumes from recruiters or employment agencies.",
            "datePosted": "2023-04-05",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4500,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/bim-cad-technician-mep-arup-singapore-da998d7bffcb0a0c97bef40c87b97717?source=MCF&event=Search",
            "uuid": "51d5a3b7-f817-4b8b-9ad6-8c5af93d9fa5"
        },
        {
            "dueDate": "2023-04-28",
            "jobTitle": "2D & 3D Drafter",
            "skills": [
                "Excavation",
                "Revit",
                "Construction",
                "Concept Design",
                "Asbuilt Drawings",
                "BIM",
                "Career Development",
                "Drawing",
                "3D",
                "Vray",
                "Interior Design",
                "AutoCAD",
                "Civil Engineering",
                "3D Modelling",
                "Layout",
                "CAD"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "601 MACPHERSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/6fd102af748f74fc2c09de49c26f497b/nj-works.jpg",
                "name": "NJ WORKS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "    Positive and fun working environment   Career development opportunities   Walking Distance from MRT station (Tai Seng)      Job Responsibilities:      Produce accurate 2D ; 3D drafting and layout plan according to project requirement (Interior Design).   To prepare and update equipment, construction, coordinate and as-built drawings for submission based on information from Project Team.   Prepare AutoCAD drawings, such as plans, elevations, sections ; details.   Thinking creatively and critically to support the project team in the design process, to create sketches and drawings that work.   To plan all drawings to meet the stipulated deadline.   Other duties as and when assigned by the Management.      Requirements:   At least 1-2 years of experience and knowledge in AutoCAD.   Proficient in AutoCAD, 3D Max, V-Ray, 3D modelling competent, preferably in (Advance REVIT, AutoCAD, AutoDesk Inventer).   Preferably Junior Executive specialized in Architecture/Interior Design or equivalent.   Possess a recognized degree/diploma in Architecture or relevant field.   Required language: English and Mandarin   Able to Start Work Immediately or within short notice     ",
            "datePosted": "2023-03-29",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/architecture/2d-3d-drafter-nj-works-255214316b796eeb12f46979f234942a?source=MCF&event=Search",
            "uuid": "eec40a63-d8db-41ff-9153-02b8ddf9d74c"
        },
        {
            "dueDate": "2023-05-05",
            "jobTitle": "2D / 3D Drafter",
            "skills": [
                "Excavation",
                "Revit",
                "Microsoft Office",
                "Concept Design",
                "BIM",
                "Architectural",
                "Electrical",
                "Estimates",
                "Civil Engineering",
                "SketchUp",
                "Layout"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "MAPEX, 37 JALAN PEMIMPIN"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/c01022f34844e1b8ac5d335b8b728ba7/ping-engineering.png",
                "name": "PING ENGINEERING (S) PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "SME - M;E organisation seeking for 2D / 3D Drafter urgently. Proficient in MS Office/Project/AutoCAD (Autodesk 2D / 3D), ability to understand tender design drawings and develop 2D / 3D design drawings as well as create, review and modify drawings based on project requirement.",
            "datePosted": "2023-04-05",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/professional-services/2d-3d-drafter-ping-engineering-472e7c972f23f72306f48f306fc1cbcb?source=MCF&event=Search",
            "uuid": "168f5044-fc23-4f12-a4e4-e95d596fdf93"
        },
        {
            "dueDate": "2023-05-05",
            "jobTitle": "BIM/CAD Technician STR",
            "skills": [
                "Revit",
                "Factory",
                "Construction",
                "BIM",
                "Architectural",
                "Rail",
                "Drawing",
                "Electrical",
                "Sustainable Development",
                "3D",
                "Composites",
                "Wellbeing",
                "AutoCAD",
                "Team Player",
                "CAD"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "FRASERS TOWER, 182 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "ARUP SINGAPORE PRIVATE LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Do you want to make a positive impact on the world? Sustainable development is at the heart of everything we do. Seventy-five years ago, we created a home for creative thinkers seeking to solve the world’s biggest challenges. Today, a collective of 16,000+ Arupians gather across the globe from 140 different countries to build a sustainable future. We strive to create an inclusive environment and give everyone a voice. Diversity drives innovation in our projects and offers empathy to the communities we serve. We welcome and encourage applications from people living with disability and provide workplace adjustments. At Arup, you’ll do more than work — you’ll shape a better world. About this role This role will be responsible for the production and quality checks on Civil and Structural BIM Models Drawings. What will I do?    Be responsible for the production and quality checks on Civil and Structural BIM models and drawings.   Produce or support production and quality checks on Civil and Structural, Architectural, or other disciplines BIM models and drawings as the need arises.   Resolve complex multidisciplinary modelling, engineering and design issues through coordination and liaison with internal Arup parties and external parties.   Prepare documents and drawings to assist engineers, planners or designers for submission to relevant Authorities.   Be responsible for checking the quality and accuracy of their own and others work  What will I bring?    Recognized tertiary qualifications in Civil and Structural, Architecture, Building Information Modelling, Computer Aided Drafting or similar domain   A minimum of 5 years relevant experience in the construction industry and built environment, and preferably in Heavy Infrastructure, Rail and Underground Metro   Building Construction Authority Academy Specialist Diploma in Building Information Modelling is preferred.   Working knowledge of at least one primary 3D BIM product including configuration, set-up and management of models supported by a common data environment with strong background using Autodesk suite of products, especially Revit and Autocad   Knowledge with Bentley suite products (V8i and Connect Edition)  Our firm  Dedicated to sustainable development, the firm is a collective of 16,000 designers, advisors and experts working across 140 countries. Founded to be both humane and excellent, we collaborate with our clients and partners using imagination, technology and rigour to shape a better world. We create spaces where everyone feels safe, seen and included and able to perform at their best. We take an approach to flexible working that supports the diversity and well-being of our members. Are you ready to shape a better world? Our open roles are waiting for you on the Arup careers page. If you like what you see here, apply today. Arup does not accept unsolicited resumes from recruiters or employment agencies.",
            "datePosted": "2023-04-05",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4500,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/bim-cad-technician-str-arup-singapore-0a2f36b60cbe6f7c2472085c5e8185d6?source=MCF&event=Search",
            "uuid": "e94e082c-7e9a-4616-9045-46364c984e7e"
        },
        {
            "dueDate": "2023-05-03",
            "jobTitle": "(C&S) BIM Modeller",
            "skills": [
                "Revit",
                "Autodesk Revit",
                "Microsoft Excel",
                "Construction",
                "Modeling",
                "BIM",
                "Architectural",
                "Mathematics",
                "Drawing",
                "Data Integration",
                "3D",
                "Python",
                "AutoCAD",
                "Layout",
                "Credit Risk"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SLF BUILDING, 510 THOMSON ROAD"
            },
            "company": {
                "logo": null,
                "name": "RANKINE & HILL (SINGAPORE) PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description    Create accurate and organized structural Revit (BIM) models and/or AutoCAD drawings   Develop plan, elevation, section, and detail drawings from the models with adequate detail and proper annotation for tender and construction.   Develop and maintain office BIM/CAD standards and procedures for sheet layout, layering, modelling processes, and drawing formats.   Work productively and coordinate activities on numerous projects concurrently.   Ability to work individually and as part of a team to meet deadlines  Requirements    Basic hand drafting skills   Experience utilizing Autodesk Revit modeling and AutoCAD software in a consultancy office preferred   Ability to read and understand architectural and structural construction documents   Graduate of a qualified technical school or program   Excellent time management skills ",
            "datePosted": "2023-04-03",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/building-construction/bim-modeller-rankine-hill-6e0ea7369f0a0dd127eda38741badd0c?source=MCF&event=Search",
            "uuid": "1b033ab4-55bc-4b7b-adc7-b2c47d060f1f"
        }
    ]
}