{
    "jobs": [
        {
            "dueDate": "2023-04-26",
            "jobTitle": "AEC Industry Sales Manager, ASEAN_22WD64789",
            "skills": [
                "Forecasting",
                "Team Collaboration",
                "Oral Communication Skills",
                "Sales Management",
                "Financials",
                "Territory Management",
                "Channel",
                "Selling",
                "Sales Process",
                "Team Management",
                "Presentation Skills",
                "Publications"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview Grow Autodesk architecture, engineering, and construction (AEC) business by leveraging channel sales ecosystem and closing the deal with direct client engagement. The candidate must be able to utilize a strategic, solution-oriented sales approach to create compelling events though Autodesk unique business value. Work as part of a cross functional team, to identify and define customer business objectives, develop solutions proposals, set appropriate expectations, and coordinate hand offs to the implementation teams. Build strong relationships with strategic Clients by coordinating all available resources in a territory to exceed customer expectations. Responsibilities    Achieve or exceed monthly/quarterly/annual revenue objectives in conjunction with strategic clients   Accurately forecast revenues and build a pipeline to achieve monthly, quarterly, and annual sales goals   Manage the progress of sales opportunities throughout the sales process, including pipeline development, management, and forecasting   Develop and implement a territory sales strategy to balance solutions, run rate and services bookings through direct and channel sales management   Effectively present technical/business value propositions to Key Industry (architecture, engineering, and construction)   Locates or proposes potential business deals by contacting potential partners, discovering and exploring opportunities   Closes new business deals by coordinating requirements; developing and negotiating contracts; integrating contract requirements with business operations   Effectively communicate with and coordinate the activities of cross functional team collaboration   Understand and keep current on competitive and business environment in the architecture, engineering, and construction market segment   Screen potential solution sales by technical requirements, potential, and financials; evaluate options   Update job knowledge by participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations   Travel as required to meet objectives  The Ideal Candidate    Ideal Candidate would have a proven track record of success in managing a sales territory through both direct and indirect sales across ASEAN region   Must have at least 10 years’ experience prospecting and establishing relationships with AEC customers within the territory   Previous Team Management experience will be preferred   Domain expertise of/in the architecture, engineering, and construction (AEC) software industry   Closing skills, motivation for sales, prospecting skills, sales planning, selling to customer needs, territory management, market knowledge, presentation skills, energy level, meeting sales goals, professionals   Excellent written, oral communication skills and strong presentation skills   Experience with solutions selling and team selling in a cross functional environment a plus ",
            "datePosted": "2023-03-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 20000,
                "minValue": 12170,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/aec-industry-sales-manager-asean22wd64789-autodesk-asia-006e36601b8b20cea450b0d87a9a0d4d?source=MCF&event=Search",
            "uuid": "11ae2a4a-cb30-451d-97a6-f96358b270c1"
        },
        {
            "dueDate": "2023-04-20",
            "jobTitle": "Senior Software Engineer in Test_23WD68523",
            "skills": [
                "Licensing",
                "Git",
                "Mac",
                "Architectural",
                "Agile",
                "Test Cases",
                "Test Automation",
                "Attention to Detail",
                "Python",
                "Windows",
                "Writing",
                "Test Methodologies",
                "Docker",
                "Ansible",
                "Debugging",
                "Linux"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview  The ways we design and build the world are changing rapidly, which is also changing the tools we use, and the ways companies and individuals buy and access software. We are embracing this change with a complete transformation of our Try, Buy, and Subscribe platform. Autodesk Subscriber Licensing Platform team is seeking a passionate Test Engineer to join a team of professionals who are responsible for building the build pipeline and automating our test suite for the multi-platform desktop licensing framework. The licensing framework will be used by all Autodesk desktop products like AutoCAD, Maya, Inventor, etc. for managing licensing workflows. The Test Engineer works within a highly visible team at Autodesk where the developed code will have a direct, positive impact on millions of users of our products. Specifically, when any of our customer Try, Buy, or Access any of our software products, they will be touching the licensing services platform you are helping to build and test. You will be responsible for Promoting DevOps culture to ensure fast delivery of software to the customer's while ensuring stability of the infrastructure behind it and will be using agile practices to ensure rapid, iterative execution Responsibilities    Lead technical and architectural discussions and decision making   Collaborate with stakeholders to understand requirements, understand use cases and build towards a cohesive technical strategy   Work with the team to automate testing of new functionalities and services using existing service architecture, delivery pipeline and test framework   Create test harnesses and infrastructure supporting Windows, Mac ; Linux   Analyze and decompose a complicated software system and design a strategy to test it   Develop and take ownership of the following activities/areas for the infrastructure ; build pipeline which can be used to build desktop products:   Infrastructure-as-code to build and manage repeatable, reliable infrastructure at scale   CI/CD as pipeline-as-code   Device methodologies and execute them to improve pipeline performance   Help with release management activities (Ex: Versioning, Branching, Merging, Release)   Conceptualize and develop Metrics which can be used to monitor the usage of Infrastructure and measure the effectiveness of build/test pipeline   Implement the appropriate Monitoring and Alerts   Automate all aspects of application life cycle so that we can build, test, and release the software better   Triage the pipeline related issues on a regular basis and device solutions to reduce the triage effort   Evaluate (commercial, open-source or proprietary) tools and frameworks for better infra and pipeline management   Drive and champion CI/CD and Automation practices across the platform   Enforce Engineering Excellence practices and drive quality early in code development; enforcing coding standard and other strategies to improve and ensure code quality   Cross-train and mentor teammates   Align with team goals that connect to the wider organizational goals   Collaborate with internal and external teams  Minimum Qualifications    6+ years of test automation ; build pipeline experience   Ability to write professional code (clean code ; design)   Deep knowledge of test methodologies, writing test plans, mock data/services, creating test cases, debugging ; testing   Successfully implement performance and/or load testing   Strong hands-on knowledge of one or more of Infrastructure-as-Code tools and technologies like Ansible   Experience leading DevOps implementation in large programs especially integrating applications, reengineering and automating systems   Experience working in an agile team, CI/CD with Jenkins and automated deployment   Experience with Metrics, Monitoring ; Alerting tool like ELK, Grafana etc   Experience with security, secrets management, certificates, encryption and keys like Vault   Experience with CI/CD and Pipeline-As-Code: Jenkins, Groovy, etc   Passion and Drive to lead initiatives on continuous pipeline improvements   High attention to detail   BS in Computer Science/Engineering or a related field   Have excellent communication skills   Strong Experience with Python is a plus  Preferred Qualifications    Ansible   Docker   ELK, Grafana   Python   Jenkins, Groovy, Shell   Windows, Mac ; Linux   Git ",
            "datePosted": "2023-03-21",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13325,
                "minValue": 7491,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-engineer-test23wd68523-autodesk-asia-529413a95fc3e3435b51831c46a05f74?source=MCF&event=Search",
            "uuid": "56b3ccd0-2395-46cd-af40-a978c7fe357f"
        },
        {
            "dueDate": "2023-04-06",
            "jobTitle": "Design & Construction Manager",
            "skills": [
                "3D Modeling",
                "Revit",
                "Autodesk Software",
                "Leadership",
                "Construction Management",
                "Construction",
                "Concept Design",
                "Ability To Work Independently",
                "Cost Management",
                "Architectural",
                "Value Engineering",
                "Career Development",
                "MS Project",
                "Industrial Design",
                "Architecture Design",
                "Pizza",
                "AutoCAD",
                "SketchUp"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "ALFA CENTRE, 99 BUKIT TIMAH ROAD"
            },
            "company": {
                "logo": null,
                "name": "PIZZA HUT ASIA PACIFIC FRANCHISE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The Pizza Hut Asia Pacific Design ; Construction Manager is responsible for the implementation of restaurant planning, design and construction standards; providing strategic thought leadership, process ownership, and innovation to drive the brand’s asset strategies forward; leading the functional center of excellence for the region; providing critical know-how to Pizza Hut leadership and system-wide support to franchisees engaging in new unit development, remodeling, and replacements.  The candidate will establish and enhance processes designed to ensure Pizza Hut’s design and brand standards are upheld and delivered with excellence every time by providing ongoing professional construction and design assistance to the Pizza Hut brand. This will include design reviews, providing corrective actions as appropriate, and undertaking all reasonable measures to ensure that annual store and remodeling targets are met. This position will also drive research and implementation of new concepts and innovations on restaurant designs; and will support other programs and initiatives (e.g. cost optimization and sustainability agenda) in order to accelerate Development growth in Asia.  Major job functions include: Concept Design ; Architecture    Build the Brand through owning and driving Pizza Hut’s Asia Region asset innovation and design strategies to deliver consumer relevant, insights driven, and cost-effective assets   Deliver top-notch, global-leading assets in every restaurant build/action   Spearhead holistic roll out of comprehensive brand image standard across all consumer-facing touchpoints to drive brand image across the “Pizza Your Way” Design palette.   Ownership of all Pizza Hut Franchise architectural plan submittal, review, approval processes, including post audit to brand standards after project completion. Ensure development activity is consistent with registration policies, contractual obligations, and uphold integrity through standard conformance. Deliver support pipeline insight through data integrity and tracking.   Develop and deliver effective one-system communication, productivity, and process through a combination of education, online tools, and third-party support.   Implement the company’s business policies, programs, standards, specifications, and procedures related to planning, construction and design for Pizza Hut restaurants.   Drive research on new store designs that will successfully work for the Pizza Hut brand. Incorporate innovation and creativity on restaurant planning and design.   Review store layout and design of new builds (i.e., equipment, seating, exterior elevations, etc.), relocations and image enhancements for compliance with international policies and facilities guidelines/standards, in addition to enhancing each proposed design through creative inputs   Identify construction and design cost savings opportunities and ensure effective implementation.   Undertake all reasonable measures to ensure that annual agreed new store build/relocations/image enhancements are met on international basis for Asia franchisee markets.   Provide restaurant design assistance and construction project management support to franchisee development teams in order to ensure new openings and redevelopments are completed and up to corporate standards.   Keep abreast of retail and Restaurant industry design practices and trends with the objective of transferring learnings and insights to Pizza Hut design standards   Maintain liaison with Yum! International and domestic teams in order to identify, cascade, and implement YRI Global programs and regional initiatives.   Provide tools, training programs, seminars, development colleges and best practice sharing in order to ensure franchisees capabilities to growth.  Strategic    Demonstrate Asia region concept design thought-partnership and successful collaboration with Dallas central leadership; provide industry insights and regional competitive benchmarking to monitor and inform retail design trends and their potential application for Pizza Hut   Provide thought leadership to help define and develop asset strategies and processes to drive profitable growth and image upgrade pace. Engage with Franchisees and internal partners to find solutions to development barriers to drive growth and image upgrades.   Drive process and discipline deep into the organization to deliver world class one system commercial business mindset and improve the Pizza Hut business model. Drive focus on cost management, value engineering, and investment returns.   Develop the right sustainability platform for the asset.  Requirements:    BA/BS in Architecture, Design, Industrial Design, or related field required. Professional registration and business degree a plus.   10+ years of demonstrated organizational impact in Architecture/Design field with increasing responsibility in commercial and retail/restaurant design related areas.   Demonstrated proficiency in design ; retail branding; familiarity with related technical areas including architecture, concept design, consumer insights, construction management, facilities management.   Excellent interpersonal ; team skills with ability to present to Senior Leadership and Franchisees. Intentionality to lead direct reports with track record of career development.   Strong project management and interpersonal skills are a necessity. Ability to partner well with cross functional departments, franchisees, and work with all levels of management, including senior management.   Ability to efficiently manage workload well with shifting priorities. Ability to work independently and multi-task in a fast paced and deadline-driven environment and generate actionable recommendations.   Strong analytical and problem solving skills. Familiar with architecture/development related systems including AutoCAD or Revit, Adobe Create Suite and Autodesk software for 3D modeling and production documents, Photoshop, Sketch-up, MS project, PowerPoint, and Excel. ",
            "datePosted": "2023-03-23",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13500,
                "minValue": 10000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/architecture/design-construction-manager-pizza-hut-asia-pacific-franchise-0489ec3b15070f2c43e6165a754c7774?source=MCF&event=Search",
            "uuid": "8ed86b1f-df33-4ee5-84bf-caba5e214674"
        },
        {
            "dueDate": "2023-03-29",
            "jobTitle": "Senior Software Engineer in Test, Desktop SDK_22WD65243",
            "skills": [
                "Machine Learning",
                "Version Control",
                "TestNG",
                "Mac",
                "Big Data",
                "Test Cases",
                "Test Automation",
                "JUnit",
                "Software Testing",
                "Windows",
                "Business Analytics",
                "Instrumentation",
                "Test Strategy",
                "Linux",
                "Software Development",
                "Business Requirements"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview Autodesk is looking for a Senior Software Engineer in Test to join a data team within Analytics Data Platform, Product Analytics (ADPPA). You will be working in Product Data Capture team. This is a wonderful opportunity to join a team that delivers both internal and customer facing applications and services that provide the data collection needs of all data scientists, data analysts and data engineers throughout the organization. You will have the opportunity to understand the entire data platform from product instrumentation through to business analytics, machine learning, and data-driven products. As a Senior Engineer, you will be joining an incredibly talented and seasoned engineering team. You will have the opportunity to work with many new and exciting technologies and frameworks used in our data platform. We are looking for people who are as excited about data technology as we are.  We believe that testing is an integral process of software development. You can play a vital role to ensure and improve the quality of our data capture SDK for desktop applications. Responsibilities    Define quality targets for ADP desktop SDK and plan test strategy to achieve it   Define end-to-end testing strategy which covers ADP desktop SDK and its supporting components   Apply your knowledge of various testing frameworks and technologies to propose and define the best fit to meet business requirements   Schedule and coordinate various software testing tasks   Create and execute plans to test features and functionalities of ADP desktop SDK including functional, performance, and compatibility tests   Write and maintain test automation codes that work across different desktop OSes (Windows, Mac ; Linux) and integrate it with CI/CD pipeline   Write and execute manual test cases   Develop and maintain necessary tools and frameworks to support test automation   Evaluate test results to troubleshoot, identify, document, and communicate anomalies and defects   Collaborate with developers and other SDETs to continuously improve software testability   Collaborate with Product Manager, Engineering Manager, and other stakeholders to deliver features according to agreed scope and schedule  Minimum Qualifications    At least 7 years of hands-on experience in writing automated tests for desktop libraries/applications   Proficient in writing white-box and black-box automated test codes in Java using testing frameworks such as TestNG (preferred), JUnit, etc.   Proficient in designing functional and non-functional test cases   Experience with distributed version control system (preferably git)   Experience in integrating automated tests execution into CI/CD pipeline   Team player who is willing to help and collaborate well with other team members   Working experience in an agile environment using test driven methodologies   Effective communication skills (written and spoken)   Good analytical and problem-solving skills   Ability to work with minimal supervision and commit to agreed business goals   Good command of English (Speaking, Writing and Reading)   Degree in computer science or related field  Preferred Qualifications    Experiences in libraries/applications testing across different desktop OS (Windows, Mac ; Linux)   Knowledge of C/C++ programming   Experience with Big Data, especially on Product data   Proficient in writing SQL queries ",
            "datePosted": "2023-02-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12491,
                "minValue": 7491,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-engineer-test-desktop-sdk22wd65243-autodesk-asia-e1310aa751e5611d06027a19231bdb58?source=MCF&event=Search",
            "uuid": "6b4e7032-5a18-481d-a377-aca1d74cf927"
        },
        {
            "dueDate": "2023-04-05",
            "jobTitle": "Senior Software Engineer_22WD65537",
            "skills": [
                "Mentoring",
                "Git",
                "Scalability",
                "Pipelines",
                "Architect",
                "Architectural",
                "Hadoop",
                "User Experience",
                "Agile",
                "Reliability",
                "SQL",
                "Distributed Systems",
                "Python",
                "Writing",
                "Databases",
                "Business Requirements"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview Autodesk is looking for a Senior Software Engineer to join the Data Ingestion team within the Analytics Data organization. The Data Ingestion team processes around 100 billion events and 250TB of data per day from all Autodesk products. The team is responsible for building and maintaining streaming real-time enterprise level data pipelines and developing simple, repeatable ingestion patterns for Autodesk’s internal data platform. As a Senior Software Engineer, you will be responsible for developing best practices and making architectural choices to rapidly improve critical data processing ; analytics pipelines. You will collaborate with highly motivated and wonderful software engineers. You will lead and support innovative solutions to sophisticated and modern engineering problems. As part of the team, you will learn, teach, grow, and help bring data closer to our users. You will make critical choices, tackle hard problems and improve the platform’s reliability, resiliency, and scalability. We are looking for someone who is enthusiastic about working in a team, can own and deliver long-term projects to completion. You are detail and quality oriented, and excited about the prospects of having a big impact with data at Autodesk. Responsibilities    Contribute to the team’s vision and articulate strategies to have fundamental impact at our massive scale   You will need a product-focused mindset. It is essential for you to understand business requirements and architect systems that will scale and extend to accommodate those needs   Diagnose and solve complex problems in distributed systems, develop and document technical solutions and sequence work to make fast, iterative deliveries and improvements   Build and maintain high-performance, fault-tolerant and scalable distributed systems that can handle our massive scale   Ideate and drive innovative projects that will improve user experience   Provide solid leadership within your very own problem space, through data-driven approach, robust software designs, and effective delegation   Participate in, or spearhead design reviews with peers and stakeholders to adopt what’s best suited amongst available technologies.   Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency)   Automate cloud infrastructure, services, and observability   Develop CI/CD pipelines and testing automation   Establish and uphold best engineering practices through thorough code and design reviews and improved processes and tools   Groom junior engineers through mentoring and delegation   Drive a culture of trust, respect and inclusion within your team  Minimum Qualifications    5+ years of relevant industry experience in large back-end distributed systems and cloud computing   Strong overall programming skills, able to write modular, maintainable code, preferably Python ; SQL   Experience building code-driven infrastructure on public cloud platforms, preferably AWS   Understanding of SQL, dimensional modeling, and at least one relational database   Experience with automation frameworks/tools like Git, Jenkins, Ansible, and Terraform   Familiarity with containers and infrastructure-as-code fundamentals   Solid Proficiency with Amazon Web Services   Problem solver with excellent written and interpersonal skills; ability to make sound, complex recommendations in a fast-paced, technical environment   Humble, collaborative, team player, willing to step up and support your colleagues   Effective communication, problem solving and interpersonal skills   Commit to grow deeper in the knowledge and understanding of how to improve our existing applications   Enthusiasm for cutting edge technologies, complex problems, and building things   Familiar with non-functional testing such as load, performance and resiliency testing   Good command of English (Speaking, Writing and Reading)   Working in an agile environment using test driven methodologies   Bachelor’s degree in Computer Science, Engineering or related field, or equivalent training, fellowship or work experience  Preferred Qualifications    Experience with data processing and SQL databases   Experience with Spark   Experience with Hadoop / Spark Source Code   Experience with Map Reduce   Experience with Hive and/or Snowflake   Strong knowledge and experience in Hadoop 2.0 and its ecosystem.   Experience with Airflow ",
            "datePosted": "2023-03-06",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13150,
                "minValue": 7891,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-engineer22wd65537-autodesk-asia-36edcbd6ffe7c46b5bfca2180a78ca21?source=MCF&event=Search",
            "uuid": "bd6ddee4-9c9c-45c6-951f-a6587ce4612b"
        },
        {
            "dueDate": "2023-04-08",
            "jobTitle": "Customer Success Manager, Autodesk Construction Solutions Singapore_23WD68130",
            "skills": [
                "Ability to Multitask",
                "Customer Retention",
                "Mentoring",
                "Account Management",
                "Sales",
                "Construction",
                "BIM",
                "Customerfacing",
                "Customer Success",
                "Strategy",
                "Adaptable",
                "B2B",
                "Digitization",
                "Advocate",
                "Turnover"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview About Autodesk Construction Solutions Autodesk has fully reimagined the construction business for the digital age, enabling companies to address the most important challenges they face today while preparing for new ways of working in the future. The Autodesk Construction Solutions (ACS) portfolio connects the office, trailer and field. This enables customers to move seamlessly through each phase of the construction lifecycle from design and preconstruction to construction, turnover and operations, with best-in-class Autodesk Construction Cloud solutions. General contractors, subcontractors, and owners around the world rely on ACS to win more work, enhance collaboration, speed up decision-making, reduce risk, and improve overall project outcomes. Role: Customer Success Manager Autodesk Construction Solutions (ACS) is looking for a Customer Success Manager to retain and expand our construction customers. The Customer Success Manager is responsible for enabling continuous adoption of our cloud solutions and helping our customers fulfil their desired business outcomes. In this role, you will be a trusted, strategic partner to your assigned customers and build lasting, meaningful relationships. Reporting to the Regional Manager of Customer Success, you will develop a network within each customer, align with their business objectives and maximize the value of ACS workflows to the customer. You will be the main driver for product adoption and collaborate with ACS Sales teams to help close account expansion opportunities. You will lead the digital expansion of your customers with a passion for technology and the construction industry.  About You ​    You are familiar with the direction and strategy of Autodesk to become the leading construction platform company   You enjoy discussing and driving digitization and digitalization of our customers and the AEC industry as a whole   You will onboard new construction customers with a focus on accelerating their time to value and helping them achieve their positive business outcomes   In order to achieve those positive business outcomes, you will seek areas to expand solution adoption, as well as recommend best practices to optimize their post-purchase utilization   You are comfortable exceeding target goals by maintaining a high customer retention rate, coordinating with ACS sales to ensure on-time renewals, and identifying expansion opportunities   You will hold regular check-in calls, executive business reviews, webinars, and mentoring sessions with customers   You will collect product feedback from customers and contribute to product roadmap discussions   You will track account health to identify churn risk and work proactively to eliminate that risk   You will drive product usage and adoption of the Autodesk Construction Cloud (ACC)   You will develop a trusted advisor relationship with your customers and serve as an advocate for customer needs within the Autodesk Construction Solutions (ACS) team   You are comfortable proposing and building processes that will allow our organization to scale, and collaborate with numerous stakeholders and teams, both internally and externally.   You will act as an ACS evangelist while identifying industry positive business outcomes, required capabilities, and finding relevant forums to increase awareness of ACS services  Minimum Qualifications    At least 3 years' experience in a customer-facing, B2B role   Experience in the Architecture, Engineering and Construction Industry, OR   Experience in Customer Success, Account Management or a client facing role   Ability to travel up to 30% of your time   Intellectual curiosity with the horsepower to understand one of the largest, most complex industries out there (construction)   Excellent written and verbal communication skills   Ability to multi-task, prioritize, and manage time effectively   Process-driven and organized by nature   Willingness to be adaptable and help problem solve   Hard working, have a record of accomplishment, and demonstrated drive for achievement  Preferred Qualifications    Previous experience in the Construction Industry - (i.e. Project Manager, VDC Manager, Superintendent, Project Engineer, Foreman)   Advanced knowledge of AEC workflows and awareness of BIM solutions focused on Construction   Extremely beneficial would be detailed understanding of our ACS Solutions (BIM 360, Plangrid, Assemble, Autodesk Construction Cloud) or similar CDE and Construction/Project Management solutions  Incentives ; Benefits    Career Growth Programs   Employee Stock Purchase Plan   Flexible remote work policy   Work with a leading technology company that is socially and environmentally conscious – see our 2022 Impact Report   Autodesk is a top 25 employer in Glassdoor's Best Places to Work in 2022 ",
            "datePosted": "2023-03-09",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13409,
                "minValue": 8041,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/customer-success-manager-autodesk-construction-solutions-singapore23wd68130-autodesk-asia-0ba5abda13d848a9c96a51b90fe838e5?source=MCF&event=Search",
            "uuid": "e6729ba4-1998-4ccf-a851-bafa3ca23221"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Senior Software Engineer_22WD65707",
            "skills": [
                "Git",
                "Mac",
                "Agile",
                "JavaScript",
                "Maya",
                "Perforce",
                "Python",
                "Windows",
                "Java",
                "C#",
                "Business Transformation",
                "Linux",
                "Software Development",
                "C++"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description Position Overview The ways we design and build the world are changing rapidly, which is also changing the tools we use and the ways companies and individuals buy and access software. We are embracing this change with a complete transformation of our Try, Buy, and Subscribe platform. This Sr. Software Engineer will help to build a multi-platform Licensing Framework that will be used by all Autodesk desktop products like AutoCAD, Maya, Inventor, etc. for managing licensing workflows. This Sr. Software Engineer works across a highly visible program at Autodesk where the platform you implement, will have a direct and positive impact to the millions of users of our products. Specifically, when any of our customer’s Try, Buy, or Access any of our software products, they will be touching the licensing services platform you are helping to implement. This system and experience is a center piece in supporting Autodesk’s top-line business transformation objectives. Responsibilities    Design, build and maintain efficient, secure, reusable and reliable code   Develop solutions that are portable across platforms   Apply continuous attention to technical excellence and good design, resulting in a straightforward solution and reducing complexity   Write test automation and help your team to deliver frequent incremental releases using CD pipeline   Help promote and drive sound engineering design, process and quality practices  Minimum Qualifications    5+ years of software development experience   Ability to write professional code (clean ; good design)   Strong experience with C++ language and related tooling (e.g. compilers, cross platform, etc.)   Experience building cross platform Desktop/GUI applications on Windows/Linux/Mac   Experience working in an agile team, CI/CD with Jenkins and automated deployment   High attention to detail   BS/MS in Computer Science/Engineering or a related field   Experience with Python is a plus’  Preferred Qualifications Experience in:    Go, C#, Java, JavaScript ; Python   Windows, Mac ; Linux   QT   Cmake, Nuget   Jenkins   Git, GitHub, Perforce ",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13150,
                "minValue": 7891,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-software-engineer22wd65707-autodesk-asia-2e616284ddccd573f8968f22a14d7e5e?source=MCF&event=Search",
            "uuid": "5b528558-ff69-4f63-8162-0b4046b03465"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Senior Software Development Engineer_22WD62280",
            "skills": [
                "Mentoring",
                "Web Services",
                "Scalability",
                "Architect",
                "Scrum",
                "Unit Testing",
                "Architects",
                "Agile",
                "JavaScript",
                "Maven",
                "Distributed Systems",
                "Python",
                "Java",
                "C#",
                "API",
                "Agile Development"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview Imagine, Design and Create a Better World is our vision at Autodesk. Our flagship product, AutoCAD software, has become synonymous with CAD and is a fixture in design shops worldwide. We have industry-leading 3D solutions for industrial design and manufacturing; architecture, engineering and construction; as well as media and entertainment. Over 10 million professionals in 185 countries are using Autodesk products to save time and money, gain competitive advantage, and change the way ideas are brought to life. Autodesk products are switching to a subscription-based business model. The team critical to this business transformation is looking for a Senior Software Engineer. You will be designing and delivering APIs that help improve existing backend platform and subscriptions APIs. You will work with developers, architects, product owners, and operations to collaboratively deliver various team requirements and goals to advance the platform for subscriptions, order processing and entitlements. You will proactively work to evaluate and adopt technology solutions that help with improving the quality of the APIs as well as productivity of the team. Responsibilities    Architect, design, code, test, debug, and document new and existing components to ensure that software meets business, quality and operational needs   Technically lead and guide the team in delivery, research and development of business requirements   Championing the development and implementation of innovative concepts in the areas of API development, DevOps, automation, and testing   Ensure that high quality code is delivered by the team following best practices like peer code reviews, code standards, unit testing and test driven development   Drive and participate in code and document reviews, mentoring team in best practices   Collaborate with peer organizations, DevOps, support organizations on technical issues and provide guidance   Work with business and technical product owners to interpret and translate business needs to technical requirements and provide technical breakdown of work with estimations   Evaluate and recommend tools, technologies and processes to ensure the highest quality and performance is achieved   Work with team to troubleshoot code level problems quickly and efficiently   Apply deep technical expertise to resolve challenging programming and design problems   Focus on scalability, security and availability of all applications and processes   Champion security requirements and secure coding practices and perform various security reviews with Autodesk wide security teams   Design and architect solutions to enable secure, scalable and maintainable software   Contribute to risk identification and risk mitigation strategies associated with the architecture   Contribute to technical roadmap and technical debt elimination, balancing time, resource, and quality constraints to achieve business and strategic goals and requirements  Minimum Qualifications    BS/MS in Computer Science or equivalent work experience   5 years and above hands-on experience developing scalable, distributed applications   Experience with JSON/XML, designing and building REST/SOAP based web services   Strong development proficiency in one or more backend languages Node.js, Java, Ruby, python, Go, C#, etc   Strong experience with building cloud based API platforms or backend systems in a Unix environment   Possess strong verbal and written communication skills   Possess strong analytical skills with excellent problem solving abilities   Must be extremely detail-oriented with respect to documentation and communication   Experience with AWS or other cloud based service providers   Experience in designing and deploying distributed microservices architecture  Preferred Qualifications    JavaScript, NodeJS, Java, GraphQL   Serverless Cloud Architecture on AWS   Infrastructure as Code using Terraform and AWS CloudFormation   Other tools: Serverless Framework, Express, Jest, Jenkins   Experience with Agile development, preferably Scrum   Experience with code management using Git ; build using Maven   Experience with Jenkins for Continuous Integration/Continuous Deployment  The Ideal Candidate    You enjoy making highly scalable and highly available distributed systems   You write clean, testable, and effective code   You hold yourself and others to high technical standards (design, architecture and implementation)   You have a deep understanding of object-oriented design and at least one modern backend framework   You enjoy shipping features following agile methods   You are a talented Software Engineer who is passionate about code quality, usability, and technology   You excel at working with multidisciplinary teams to deliver great user experiences   You are a power user of infrastructure, keeping yourself up-to-date with the latest trends and breakthroughs in platform development technology   You have a strong record of project execution and completion and have experience with Scrum and agile development practices   You love working with smart people and want to be part of a team   You are excited by the challenge of pushing the limits of the infrastructure to deliver disruptive, innovative solutions to the world that will delight your customers ",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 13150,
                "minValue": 7891,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/senior-software-development-engineer22wd62280-autodesk-asia-9996a6bf16a33e66e24b9d984dbcfd9d?source=MCF&event=Search",
            "uuid": "5768bab5-1f66-40b3-bda0-61f50f65996e"
        },
        {
            "dueDate": "2023-04-09",
            "jobTitle": "Senior Supplier Manager (Cloud Vendor Management)_23WD67620",
            "skills": [
                "Legal Documents",
                "Supplier Performance",
                "FMEA",
                "Localization",
                "Risk Management",
                "Procurement",
                "Demand Planning",
                "Strategic Sourcing",
                "Change Control",
                "Stakeholder Management",
                "Sourcing",
                "Databases",
                "Performance Management"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SYMBIOSIS, 3 FUSIONOPOLIS WAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5b42fc4da30fbbaaa8dcaf5f4a9cb4d3/autodesk-asia.png",
                "name": "AUTODESK ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Position Overview The Platform Supplier Management team leads Autodesk’s platform supplier relationships to ensure a highly resilient and compliant platform for all Autodesk customers. We do this by managing 3rd party suppliers that provide foundational technology for Autodesk Platform Services. This includes cloud-native suppliers across domains such as API Management, Security, Databases, SAAS/PAAS providers, Localization, Service and staff augmentation providers. The Senior Supplier Manager is responsible for managing a variety of these supplier relationships including contracting, performance management, issue management, stakeholder management and being a key partner in risk and financial management. Responsibilities    Support specific areas of the business and manage all their supplier accounts   Create and manage supplier management policies and procedures. Ensure supplier compliance with Autodesk’s documented policies and procedures   Lead and manage the supplier risk management program   Key stakeholder in supplier management lifecycle including sourcing, contracting, onboarding, participating in negotiations, issue management, to off-boarding   Work with Business, Strategic Sourcing, Procurement, and Security teams on RF(x) processes, technical supplier evaluations, security assessments, and other projects as needed   Work with Business, Procurement, Finance, and Legal teams to ensure contracts have appropriate terms and conditions, service level agreements, key performance indicators, and escalation processes   Responsible for contract management including compliance, oversight, and adherence to change control procedures. Monitor and ensure contract renewals are planned and executed well in advance of expiry   Monitor supplier performance, financial status, SLA/KPI monitoring. Drive and facilitate any disputes between business and supplier to resolution   Set up regular check-ins with supplier account managers, facilitate regular conversations between the business unit/stakeholder(s) and supplier operations teams   Plan and conduct regular business reviews and executive meetings at a cadence agreed with the business unit/stakeholder   Support the business in demand planning and monitor against the plan. Flag overages and additional budget asks well in advance   Ensure all relevant supplier data is automated and available on dashboards  Minimum Qualifications    10+ years of progressive experience in management of supplier relationships critical to a cloud and platform technology business   Experience creating and managing a supplier risk management program   Ability to work effectively in a team environment   Ability to effectively and comfortably communicate with executive leadership and provide updates/status reports or deliver presentations and recommendations   Excellent analytical, organizational, tactical and strategic planning, presentation (verbal, and written) communication skills   Ability to read and interpret legal documents such as contracts, terms and conditions, non-disclosure agreements   Ability to work with and empower others on a collaborative basis to ensure success of the team   Ability to establish workflows, manage multiple projects, and meet necessary deadlines ",
            "datePosted": "2023-03-10",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 16500,
                "minValue": 11000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-supplier-manager-23wd67620-autodesk-asia-67cdf5ed0147424808ade05ee3876e63?source=MCF&event=Search",
            "uuid": "19d086df-a5fb-4076-a599-bbf57af93c05"
        }
    ]
}