{
    "jobs": [
        {
            "dueDate": "2023-04-10",
            "jobTitle": "Test Program Manager",
            "skills": [
                "Internal Communications",
                "Application Security",
                "Quality Center",
                "Test Engineering",
                "Agile",
                "QTP",
                "Program Management",
                "JIRA",
                "Virtual Teams",
                "PMP",
                "Audits",
                "Uft",
                "ALM",
                "Selenium",
                "Test Strategy",
                "Appium"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/d45f6badb60b024b68df4d70d722cac6/encora-technologies.jpg",
                "name": "ENCORA TECHNOLOGIES PTE. LTD."
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "Job Responsibilities    Overall accountable and responsible for delivery of testing services across the Digital Program   Manage and oversee the day-to-day delivery of test services by Bank appointed vendors in the conduct of testing   Works with the testing service providers and other stakeholders to review, provide feedback and sign off on the test strategy, test plans and other test service providers’ artefacts for the testing service delivery   Coordinates with the Test Governance team to ensure adoption of testing methods, standards and tools, and to coordinate any health checks or audits   Ensures that any changes to the scope of services are communicated to the respective test service      providers and the impact is factored in to the plan   Engages with various stakeholders (including but not limited to, application, security, infrastructure, business), testing service providers to ensure testing services meet the banks’ objectives and demand   Act as the first point of escalation for any issues raised by stakeholders, testing service providers   Quantify, manage, track and report test related statuses, SLA and KPIs, and ensure that defined testing transformation SLA and KPI targets are met for the portfolio accountable   Drive and collaborate with all stakeholders and test service providers to plan all testing related deliveries for the portfolio accountable   Participate and contribute in forums, as required, to drive testing transformation and innovation   Works closely with the Test Engineering Lead to provide inputs around domain specific test engineering      requirements and ensure that they are met   Establishes and maintains effective working relationships with the Vendor Test Managers/Test Leads      for the respective domains   Engages stakeholder communities to get their feedback on testing service delivery and identify      improvement opportunities to be fed back to the Test CoE team  Job Requirements    Bachelor’s Degree or Master’s degree in computer engineering or related field   Proven working experience in test delivery or equivalent role with at least 10 years’ relevant experience in large and complex organisations preferably in the area of Banking and Finance and at least 5 years’ senior manager experience in testing   Extensive experience in managing end to end delivery of testing services from multiple vendor test service providers   Proven experience in testing standards, tools, processes ; methodologies, frameworks, and various delivery      methodologies e.g. Agile, Hybrid Agile and Waterfall, DevOps   Proven, successful track record of managing shared IT service development and/ or IT Testing Services   Demonstrated success in developing highly effective working relationships with internal and external stakeholders to deliver collaboration, partnerships and services   Strong domain knowledge on Digital Program. Experience in managing testing on Digital platforms (Mobile and Internet Banking – Retail/ Corporate) will be an advantage   Strong attention to details, excellent analytical and problem solving skills   Experience in managing multiple external testing service providers   Experience in managing multi-cultural, diverse, direct and virtual teams   Experience in various testing tool suites like HP UFT/QTP, Loadrunner/Performance Center/Sitescope, HP ALM / Quality Center, Tosca, Appium, Java, Selenium, JIRA etc   Must display a high level of professional judgment, commitment, integrity, and teamwork   Excellent client facing, internal communications, written and verbal communication skills   Testing or quality certifications, PMP certifications, and Test Maturity Model integration (TMMi) Framework awareness will be preferred ",
            "datePosted": "2023-03-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 9000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/test-program-manager-encora-technologies-5d56d40d7e2e428c390bece8b44d482e?source=MCF&event=Search",
            "uuid": "7d7656dd-d77c-40f3-8323-d597d47b80f5"
        },
        {
            "dueDate": "2023-04-26",
            "jobTitle": "Test Program Manager (Digital) - Ref: YC",
            "skills": [
                "Internal Communications",
                "Software QA",
                "Application Security",
                "Quality Center",
                "Quality Assurance",
                "Test Engineering",
                "JIRA",
                "PMP",
                "Audits",
                "Banking",
                "ALM",
                "Selenium",
                "Integration Testing",
                "Test Strategy",
                "Stakeholder Management",
                "Appium",
                "Service Delivery",
                "Test Management",
                "Test Planning"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": null,
                "name": "A-IT SOFTWARE SERVICES PTE LTD"
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "Responsibilities •\tOverall accountable and responsible for delivery of testing services across the Digital Program •\tManage and oversee the day-to-day delivery of test services by Bank appointed vendors in the conduct of testing •\tWorks with the testing service providers and the Bank’s stakeholders to review, provide feedback and sign off on the test strategy, test plans and other test service providers’ artefacts for the testing service delivery •\tCoordinates with the Test Governance team to ensure adoption of testing methods, standards and tools, and to coordinate any health checks or audits •\tEnsures that any changes to the scope of services are communicated to the respective test service providers and the impact is factored in to the plan •\tEngages with the Bank’s various stakeholders (including but not limited to, application, security, infrastructure, business), testing service providers to ensure testing services meet the banks’ objectives and demand •\tAct as the first point of escalation for any issues raised by the Bank’s stakeholders, testing service providers •\tQuantify, manage, track and report test related statuses, SLA and KPIs, and ensure that defined testing transformation SLA and KPI targets are met for the portfolio accountable •\tDrive and collaborate with all the Bank’s stakeholders and test service providers to plan all testing related deliveries for the portfolio accountable •\tParticipate and contribute in forums, as required, to drive testing transformation and innovation •\tWorks closely with the Test Engineering Lead to provide inputs around domain specific test engineering requirements and ensure that they are met •\tEstablishes and maintains effective working relationships with the Vendor Test Managers/Test Leads for the respective domains •\tEngages stakeholder communities to get their feedback on testing service delivery and identify improvement opportunities to be fed back to the Test CoE team  Requirements •\tBachelor’s Degree or Master’s degree in computer engineering or related field •\tProven working experience in test delivery or equivalent role with at least 10 years’ relevant experience in large and complex organisations preferably in the area of Banking and Finance and at least 5 years’ senior manager experience in testing •\tExtensive experience in managing end to end delivery of testing services from multiple vendor test service providers •\tProven experience in testing standards, tools, processes ; methodologies, frameworks, and various delivery methodologies e.g. Agile, Hybrid Agile and Waterfall, DevOps •\tProven, successful track record of managing shared IT service development and/ or IT Testing Services •\tDemonstrated success in developing highly effective working relationships with internal and external stakeholders to deliver collaboration, partnerships and services •\tStrong domain knowledge on Digital Program. Experience in managing testing on Digital platforms (Mobile and Internet Banking – Retail/ Corporate) will be an advantage •\tStrong attention to details, excellent analytical and problem solving skills •\tExperience in managing multiple external testing service providers •\tExperience in managing multi-cultural, diverse, direct and virtual teams •\tExperience in various testing tool suites like HP UFT/QTP, Loadrunner/Performance Center/Sitescope, HP ALM / Quality Center, Tosca, Appium, Java, Selenium, JIRA etc •\tMust display a high level of professional judgment, commitment, integrity, and teamwork •\tExcellent client facing, internal communications, written and verbal communication skills •\tTesting or quality certifications, PMP certifications, and Test Maturity Model integration (TMMi) Framework awareness will be preferred ",
            "datePosted": "2023-03-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 15000,
                "minValue": 8000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/test-program-manager-ref-yc-a-it-software-services-22cc9cb356042b6545474d80c4026405?source=MCF&event=Search",
            "uuid": "568c9250-622c-479a-aa9a-bb59d0e0466c"
        },
        {
            "dueDate": "2023-04-20",
            "jobTitle": "Loan IQ QA Test Lead - Banking",
            "skills": [
                "Excellent Communication Skills",
                "Leadership",
                "Automation Testing",
                "LISA",
                "Transparency",
                "Data Quality",
                "TestComplete",
                "Uft",
                "Selenium",
                "Diplomacy",
                "Java",
                "API"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TONG ENG BUILDING, 101 CECIL STREET"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/0599829c9e8fadb0bb0dcc1278f040da/atyeti.jpg",
                "name": "ATYETI PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Key Responsibilities:  • Directs key initiatives within the business through the collection, analysis, review, reporting, documentation and communication of business needs and  requirements.  • Manages resource allocation of work on key projects/initiatives.  • Deals with complex and highly variable issues with substantial potential  business impact.  • Applies ingenuity and creativity to problem analysis and resolution in  complicated and/or novel situations.  • Advises or coach to new or lower-level personnel in the business processes and procedures of the business  • Provides in depth and sophisticated analysis with interpretive thinking to define problems and develop innovative solutions.  • Influences strategic functional decisions through advice, counsel or provided services that have direct impact on the business.  • Designs/analyzes complex reports to satisfy management requirements.  • Uses broad discretion in developing solutions for broad based business  reporting issues.  • Leads reengineering efforts in business's methodology, strategy, and  organizational goals.  • Applies/demonstrates advanced understanding of processes, procedures,  and policies for the aligned business  • Possesses a comprehensive understanding of how own area and others collectively integrate to contribute towards achieving business objectives.  • Persuades and influences others through developed communication and diplomacy skills with colleagues in other areas and occasional external customers.  • Utilizes excellent communication skills required to influence and negotiate with senior leaders (across functions); may communicate with external parties.  • Other duties and functions as assigned.  • Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and  reporting control issues with transparency.  Desired Skills and Qualifications:  1. 10+ years experience with defining and implementing data quality programs;  2. Problem solving skills  3. Hands on knowledge of UFT tool, Java ; Microservices.  4. Loan IQ Application experience preferred.  5. Hands on experience in API Automation testing, Selenium Testing, Unit Test  Coverage (UTC) testing  6. Experience in application testing frameworks (preferably Desktop  application) such as- LISA, TestComplete, TestStack White etc  7. Excellent communication ; leadership to drive forums to resolve  ongoing/chronic client concerns  8. Bachelor’s/University degree or equivalent experience / Masters degree",
            "datePosted": "2023-03-21",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 17000,
                "minValue": 9000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/loan-iq-qa-test-lead-banking-atyeti-a1bdfbdfda2c1844ca4bcb0b07108f07?source=MCF&event=Search",
            "uuid": "7061fd7d-13e8-4296-bb07-c0a6beee22e2"
        },
        {
            "dueDate": "2023-04-04",
            "jobTitle": "Software Testing Engineer for Proof of Concept (PoC)",
            "skills": [
                "Strategic Planning",
                "Trend",
                "Big Data",
                "Cloud Computing",
                "Customer Insight",
                "Artificial Intelligence",
                "Customer Success",
                "Adaptable",
                "Product Management",
                "Communication Skills",
                "Customer Service",
                "Network Security",
                "Business Requirements"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE SIGNATURE, 51 CHANGI BUSINESS PARK CENTRAL 2"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/4a663fed1ca6badeafbd191395681e47/persolkelly-singapore.jpg",
                "name": "HUAWEI INTERNATIONAL PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description:    Responsible for Huawei enterprise IT products PoC test in DC Lab.   Report to Singapore Enterprise IT solution director.   Require to provide PoC test proposal to local office/channel partner/key account customers together with corresponding IT solution manager.   Require to work as a team (majority will be supporting presales) with either regional/HQ or local team.   Require to work under minimum supervision to complete tasks assigned.   Require to be able to present PoC test proposal professionally and have technical training for local channel partners and customers  Job Requirement:    Tertiary qualification, Bachelor Degree in Computer Science/ Engineering/ Telecommunication with distinction.   Redhat RHCE or Huawei HCIA/HCIP or other relevant IT certification   Minimum 7 or more years of working experience for enterprise storage, familiar with storage products in the industry, such as DellEMC, Huawei ; etc.   IT production designing and implementation (Proficient in x86 server, SAN/NAS Storage, Virtualization(VMWare), Cloud Computing, windows series operation system, linux/unix system, etc.   Skills required: Understanding of IT technology such as x86, ARM server architecture, SAN/NAS storage architecture, data protection, DC disaster recovery, date migration.   Knowledge of OpenStack architecture, Oracle or DB database would be an added advantage.   Self-initiative to take the responsibility of task and learn new products/technologies.   Proficiency in Chinese language is required to liaise with native Chinese-speaking stakeholders  Interested candidate who wish to apply for this position, please click on APPLY NOW  EA License No.: 01C4394 | PERSOLKELLY Singapore Pte Ltd EA Registration No.: R1324138 | Kim Shi Ling Serene  By sending us your personal data and curriculum vitae (CV), you are deemed to consent to PERSOLKELLY Singapore Pte Ltd and its local and overseas subsidiaries and affiliates collecting, using and disclosing your personal data to prospective employers/companies based in any country for purposes of evaluating suitability for employment, conducting reference checks, administering employment related services, complying with Government’s COVID-19 health advisories and such other purposes stated in our privacy policy. Our full privacy policy is available at www.persolkelly.com.sg. If you wish to withdraw your consent, please drop us an email to let us know. Please feel free to contact us if you have any queries.",
            "datePosted": "2023-03-21",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/software-testing-engineer-proof-concept-huawei-international-98eed4a0b3f287ff3ac49e828c30b4f6?source=MCF&event=Search",
            "uuid": "31e4a1aa-ebfb-4b88-aa5c-32a9615cf1d3"
        },
        {
            "dueDate": "2023-03-31",
            "jobTitle": "Software Engineer (Senior) on Testing",
            "skills": [
                "Performance Testing",
                "Kubernetes",
                "Customer Experience",
                "Test Cases",
                "Test Automation",
                "Software Testing",
                "SaaS",
                "Test Methodologies",
                "Selenium",
                "Docker",
                "Java",
                "Test Development",
                "Software Development",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "71 AYER RAJAH CRESCENT"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/9a37db45fcac1cb0739107a5c68f9ef4/telepathy-labs.JPG",
                "name": "TELEPATHY LABS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Telepathy Labs  Was founded in 2016 as an AI company with the ambition of integrating AI into legacy businesses to help enterprises better manage their complex workflows and business structures. With our headquarters in the US, we now have 3 offices globally (Zurich and Singapore). Our technology revolves around these core philosophies - Innovation, Creativity and a Passion for improving performance to drive our company and our people forward. In Telepathy, we value our employees and provide them with the right resources and tools they need to help them achieve their goals and grow with us. Are you looking to make a difference in a fast-growing company? Come join us!  Job Description:  We’re looking for an exceptional, motivated Software Test Engineer to join us in building and supporting our state-of-the-art voice based conversational AI platform for the enterprise. You will be responsible to maintain our Java based test engine. Working with our international team, you will be required to develop test plans and test cases to help the development team to deliver high quality SaaS product to our internal team and customers. The role is a critical position and delivers huge impact both on the customer experience and on bottom-line performance within the organization.  Job Requirements:    Degree in Computer Science or related field with extensive experience and aptitude in software testing and support.   5 or more years of software test development experience.   Hands-on JAVA programming experience is a MUST.   Experience in developing automated tests and building code coverage   Experience in automated, load balancing, and performance testing   Proficiency with software test methodologies, tools, and processes   Experience with cloud based platforms (AWS/Azure) and UNIX/LINUX environment.   Strong analytical and problem solving skills   Self-directed, able to work independently and as a team.   An eagerness to learn new ways to perform your tasks in a more efficient way, and to improve yourself day after day   Excellent verbal and written communication skills.  Desirable:    Experience with voice-based testing.   Experience with containerized environments in a production setting (Docker Swarm, Kubernetes). ",
            "datePosted": "2023-03-01",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 11000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-engineer-testing-telepathy-labs-9da20c9863b309b466ee34964502412d?source=MCF&event=Search",
            "uuid": "a36d7c5a-96b0-4345-b2a7-5864abdb4021"
        },
        {
            "dueDate": "2023-04-22",
            "jobTitle": "Test Engineer",
            "skills": [
                "Performance Testing",
                "JSON",
                "XML",
                "UI",
                "Test Cases",
                "Test Automation",
                "SQL",
                "Python",
                "Continuous Integration",
                "Docker",
                "Java",
                "Software Development",
                "LoadRunner"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/a4486fd731c589506086600550939bf6/aurumjin-consulting.png",
                "name": "AURUMJIN CONSULTING PTE. LTD."
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "Responsible for developing and maintaining robust testing tools and platforms.    Develop a testing framework which supports extensive automation of tests cases, including data setup, mocking and stubs for functional and end-to-end testing.   Solve for the customer -understand the WHY and enrich the specification to create a solution which delights customers Develop test plans, automate and execute tests for UI, APIs, microservices and data platform.   Create, own, manage test data for end to end testing Execute and certify performance tests in a non-production environment.   Drive the end to end testing of features and certifies features for sprints and releases.   Setup and automate the bring-up of test environments Engage and communicate test results and highlights any potential quality, performance, SLA and security risks to stakeholders Reviews and provides input to developers on functional test cases  Skills ; Expertise reqd    BS in computer science or equivalent with 4+ years hands on professional software development or test automation experience with Automated Testing   Hands-on skillset with automating tests for RESTful APIs, microservices and data platform   Knowledge of SQL, Java or Python, JSON, XML   Performance testing experience using tools like JMeter, Gatling, Loadrunner   Experience using continuous integration and delivery tools such as Jenkins, Bamboo, TeamCity and container technologies such as Docker is required   Experience with SQL is a must and NoSQL databases is a plus ",
            "datePosted": "2023-03-23",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 11000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/test-engineer-aurumjin-consulting-4d5677144ec455e00eb74709c25ace69?source=MCF&event=Search",
            "uuid": "d62be0fb-d8a7-4482-8776-7bae290b4403"
        },
        {
            "dueDate": "2023-04-06",
            "jobTitle": "Test Engineer",
            "skills": [
                "Performance Testing",
                "Web Services",
                "Oracle",
                "Agile Methodologies",
                "SDLC",
                "Test Cases",
                "Test Automation",
                "Written Skills",
                "Writing",
                "Banking",
                "Java",
                "Virtualization",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "63 CHULIA STREET"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/93b3bdb0240fe3bf1d062b40ab1c429d/oversea-chinese-banking-corporation.jpg",
                "name": "OVERSEA-CHINESE BANKING CORPORATION LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description ; Requirements Description - External    Involved in collecting performance test requirements across different application technologies   Involved in writing performance test plans by incorporating performance testing objectives, testing environment, user profiles, risks, test scenarios, explanation about the tools used, schedules and analysis, monitors and presentation of results.   Responsible for developing and modifying performance test scripts using Microfocus (MF) Performance Centre (PC) or tools like JMeter. Should be able to customize and enhance test scripts as per workload requirements   Responsible to develop and execute test scripts using protocols such as Web (http/html), web services, SAP, Java user using MF Performance Centre   Responsible to create ; execute test scenarios as per agreed workload model using MF PC or any other performance testing tool such as JMeter.   Responsible for application performance monitoring either using industry wide APM tools such as Nimsoft, Appdynamics or OS commands such as perfmon, Nmon etc.   Responsible to perform thorough analysis of performance test results to report the server response times, throughput, Hits/sec, Trans/sec Transaction Response under load, Web Server Monitors, App server monitors, system monitors such as java processes, Oracle DB connections monitoring and other Performance metrics.   Worked with App-Dev, Production, Technical and Business Managers in planning, scheduling, developing, and executing performance tests.   Responsible to work on both waterfall and Agile methodologies   Responsible to integrate performance testing into CI/CD Pipeline for applications following Agile methodologies  Qualifications - External    At least 3-8 years of experience in Performance Testing in banking domain.   Must have hands-on experience on end-to-end performance testing lifecycle   Must have hands-on experience working with Agile/DevOps model and integrate ;automate performance testing in CI/CD model   Must have hands-on experience on performance testing tools such as MF Performance Centre and JMeter. Certification on these tools is a plus.   Must have hands-on experience on APM tools such as Nimsoft, AppDynamics, Splunk or Operating system commands such as perfmon and Nmon   Must have hands-on experience on formulating and executing Mobile on-device performance testing ; engineering   Knowledge in service virtualization using any SV tools is a plus.   Good knowledge of SDLC processes, performance testing methodology and different types of testing.   ISTQB/ISEB certifications is an advantage   Excellent communication (spoken and written) skills and able to work independently. ",
            "datePosted": "2023-03-23",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 8000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/test-engineer-oversea-chinese-banking-corporation-215c6197d56c73069a8fc96375877afe?source=MCF&event=Search",
            "uuid": "5473ad51-7d85-4127-a9d7-cf7d172cf956"
        },
        {
            "dueDate": "2023-04-07",
            "jobTitle": "Test Manager",
            "skills": [
                "Document Management",
                "UAT",
                "Quality Assurance",
                "Interpersonal Skills",
                "Loan Origination",
                "Agile",
                "Test Cases",
                "Test Automation",
                "JIRA",
                "Software Testing",
                "Selenium",
                "Test Strategy",
                "Test Execution",
                "OCR",
                "Test Management",
                "Test Planning"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/3a7786ca1526b833aef69b8722a1fc56/matrix-process-automation.png",
                "name": "MATRIX PROCESS AUTOMATION PTE. LTD."
            },
            "jobType": [
                "CONTRACTOR"
            ],
            "description": "   Should have good understanding  on the Document Management system with OCR capabilities and multiple integrations.   Must played the test manager role earlier in banks   Must  drafted test strategy/test plan/reporting in previous role   Strong domain knowledge on the treasury/payments systems like G3/SWIFT   Should have good logical thinking   Able to handle at least 5 resources efficiently   Should have proven records on agile delivery approaches   Must have great communication and interpersonal skills and should be a good  team player   Should able to align the plans and execution with the overall program execution plan   Should be flexible while employing the shared resources (multiple system will be shared across various projects).   Experience with Loan Origination system will be added advantage  ",
            "datePosted": "2023-03-24",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10350,
                "minValue": 6900,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/test-manager-matrix-process-automation-bbdaacbda5e6e95339ee60054e12b92c?source=MCF&event=Search",
            "uuid": "8a0a6647-29e6-4442-9d3f-b6ab36ee1e04"
        },
        {
            "dueDate": "2023-04-23",
            "jobTitle": "Test Program Manager JR 10666",
            "skills": [
                "Internal Communications",
                "Application Security",
                "Quality Center",
                "Test Engineering",
                "MS Word",
                "JIRA",
                "Virtual Teams",
                "PMP",
                "Attention to Details",
                "ALM",
                "Selenium",
                "Test Strategy",
                "Appium",
                "Service Delivery"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "BYLANDS BUILDING, 135 MIDDLE ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/8243d2b181505ccc23d510596ea214a5/infogain-solutions.png",
                "name": "INFOGAIN SOLUTIONS PTE. LIMITED"
            },
            "jobType": [
                "CONTRACTOR",
                "FULL_TIME"
            ],
            "description": "Infogain (Singapore) invite candidates to apply for the following positions to join our team. Role: Test Program Manager Job Requisition No: JR10666 Job level: Minimum 5 years of related experience (L2) or 6-9 years of relevant experience (L3)  Test Program Manager (Digital), Group Infrastructure ; Platform Services Job Responsibilities    Overall      accountable and responsible for delivery of testing services across the      Digital Program   Manage and      oversee the day-to-day delivery of test services by Bank appointed vendors      in the conduct of testing   Works with      the testing service providers and other clients stakeholders to review, provide      feedback and sign off on the test strategy, test plans and other test      service providers’ artefacts for the testing service delivery   Coordinates      with the Test Governance team to ensure adoption of testing methods,      standards and tools, and to coordinate any health checks or audits   Ensures that      any changes to the scope of services are communicated to the respective      test service providers and the impact is factored in to the plan   Engages with      various clients stakeholders      (including but not limited to, application, security, infrastructure,      business), testing service providers to ensure testing services meet the      banks’ objectives and demand   Act as the      first point of escalation for any issues raised by clients     stakeholders, testing service providers   Quantify,      manage, track and report test related statuses, SLA and KPIs, and ensure      that defined testing transformation SLA and KPI targets are met for the      portfolio accountable   Drive and      collaborate with all clients stakeholders and test service      providers to plan all testing related deliveries for the portfolio      accountable   Participate      and contribute in forums, as required, to drive testing transformation and      innovation   Works closely      with the Test Engineering Lead to provide inputs around domain specific      test engineering requirements and ensure that they are met   Establishes      and maintains effective working relationships with the Vendor Test      Managers/Test Leads for the respective domains   Engages      stakeholder communities to get their feedback on testing service delivery      and identify improvement opportunities to be fed back to the Test CoE team  Job Requirements    Bachelor’s      Degree or Master’s degree in computer engineering or related field   Proven      working experience in test delivery or equivalent role with at least 10      years’ relevant experience in large and complex organizations preferably in the area of Banking      and Finance and at least 5 years’ senior manager experience in testing   Extensive      experience in managing end to end delivery of testing services from      multiple vendor test service providers   Proven      experience in testing standards, tools, processes ; methodologies, frameworks,      and various delivery methodologies e.g. Agile, Hybrid Agile and Waterfall,      DevOps   Proven,      successful track record of managing shared IT service development and/ or      IT Testing Services   Demonstrated      success in developing highly effective working relationships with internal      and external stakeholders to deliver collaboration, partnerships and      services   Strong domain      knowledge on Digital Program. Experience in managing testing on Digital      platforms (Mobile and Internet Banking – Retail/ Corporate) will be an      advantage   Strong      attention to details, excellent analytical and problem solving skills   Experience in      managing multiple external testing service providers   Experience in      managing multi-cultural, diverse, direct and virtual teams   Experience in      various testing tool suites like HP UFT/QTP, Loadrunner/Performance      Center/Sitescope, HP ALM / Quality Center, Tosca, Appium, Java, Selenium,      JIRA etc   Must display      a high level of professional judgment, commitment, integrity, and teamwork   Excellent      client facing, internal communications, written and verbal communication      skills   Testing or      quality certifications, PMP certifications, and Test Maturity Model      integration (TMMi) Framework awareness will be preferred  Please forward your resume in MS word format to Suganthi@infogainglobal.com and Careers@infogainglobal.com Please refer your friends for any IT openings as we have various positions. Please do not send PDF Format Resume . Send the following details 1. Notice period 2. Current Salary 3. Expected Salary 4. Visa Status in Singapore",
            "datePosted": "2023-03-24",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10500,
                "minValue": 8500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/test-program-manager-jr-10666-infogain-solutions-e958f88fc3632162f2a23eefdf691057?source=MCF&event=Search",
            "uuid": "cbdba275-59d5-4c3b-804d-b9bd81bbd829"
        },
        {
            "dueDate": "2023-04-07",
            "jobTitle": "Technical Specialist – Application Security Testing",
            "skills": [
                "Troubleshooting",
                "Application Security",
                "Customerfacing",
                "Administration",
                "Soft Skills",
                "Microsoft SQL Server",
                "Defect Tracking",
                "Security Management",
                "SQL",
                "Technology Implementation",
                "Application Security Architecture",
                "Windows",
                "Web Applications",
                "Linux"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/4feda64bd6e19fb5725a3b47c6d14fc9/hcl-singapore.jpg",
                "name": "HCL SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The AppScan Technical Specialist is an exciting role within HCL’s fast-growing $1B+ software business. The AppScan Technical Specialist will capitalize on the ever-increasing demand for AppScan, the leading Application Security management platform which HCL recently acquired. In this role, the candidate will collaborate routinely with Clients, Resellers, HCL Account Managers, HCL Client Success teams, and other HCL Channels teams.  Responsibilities    The primary focus of this role is helping AppScan customers succeed in their Application Security program goals.   Assist clients in the implementation and usage of HCL AppScan DAST products including AppScan Enterprise, AppScan Standard, and related tools.   Troubleshooting AppScan Enterprise configuration issues.   Configuring and running vulnerability scans using AppScan Enterprise and AppScan Standard.   Troubleshooting common scan issues including logins, session issues, false positives, and false negatives.   Analyzing/interpreting scan results and providing detailed explanations to customers.   Provide training sessions on AppScan products.   Assisting with integrations between AppScan and common DevOps tools such as Jenkins and Jira.  Essential Requirements (Skills Requirements)    Bachelor's degree or equivalent in BE/BTech/BSc or MSc in IT.   Years of experience: 10+ years.   Experience in best Application Security Testing practices and troubleshooting skills in current versions of AppScan Enterprise and AppScan Standard is required.   Should additionally have broad knowledge and demonstrated experience in core Application Security concepts (e.g. OWASP Top 10) and testing methodologies (DAST, SAST, IAST, SCA, etc.), as well as demonstrated strong general troubleshooting skills.   Experience in automating Application Security.   Experience in any automation server tools like Jenkins.   Experience in using defect tracking tools like Jira.   Experience in both Windows and Linux usage and basic administration required, as well as basic familiarity with Microsoft SQL server.   Strong written and verbal communications skills are critical as this person will be interfacing with diverse technical and business audiences.  GOOD TO HAVE    Experience in developing web applications using Node JS technology.  Technical / Professional Skills    Application Security Tools (Veracode, CheckMarx, Coverity, Synopsis, MF Fortify, BugFix, Netsparker, Black Duck, etc.).  Non-Technical / Soft Skills    Candidate should be a proactive problem solver with customer-facing experience, strong written and spoken communication skills, and be comfortable speaking in an public forum. Must be able to understand and translate customer requirements and challenges into successful Application Security Testing Processes. ",
            "datePosted": "2023-03-24",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 9000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/technical-specialist-%E2%80%93-application-security-testing-hcl-singapore-5f50152bd1cbcfcc151424a473c42fce?source=MCF&event=Search",
            "uuid": "d3ef30cf-5193-4c1d-b8ec-b5693b37c511"
        },
        {
            "dueDate": "2023-04-07",
            "jobTitle": "Senior Technical Specialist – Application Security Testing",
            "skills": [
                "Troubleshooting",
                "Application Security",
                "Emerging Technology",
                "Customerfacing",
                "Administration",
                "Soft Skills",
                "Microsoft SQL Server",
                "Defect Tracking",
                "Security Management",
                "SQL",
                "Technology Implementation",
                "Application Security Architecture",
                "Windows",
                "Web Applications",
                "Linux"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": null
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/4feda64bd6e19fb5725a3b47c6d14fc9/hcl-singapore.jpg",
                "name": "HCL SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The AppScan Senior Technical Specialist is an exciting role within HCL’s fast-growing $1B+ software business. The AppScan Senior Technical Specialist will capitalize on the ever-increasing demand for AppScan, the leading Application Security management platform which HCL recently acquired. In this role, the candidate will collaborate routinely with Clients, Resellers, HCL Account Managers, HCL Client Success teams, and other HCL Channels teams.  Responsibilities    The primary focus of this role is helping AppScan customers succeed in their Application Security program goals.   Assist clients in the implementation and usage of HCL AppScan DAST products including AppScan Enterprise, AppScan Standard, and related tools.   Troubleshooting AppScan Enterprise configuration issues.   Configuring and running vulnerability scans using AppScan Enterprise and AppScan Standard.   Troubleshooting common scan issues including logins, session issues, false positives, and false negatives.   Analyzing/interpreting scan results and providing detailed explanations to customers.   Provide training sessions on AppScan products.   Assisting with integrations between AppScan and common DevOps tools such as Jenkins and Jira.  Essential Requirements (Skills Requirements)    Bachelor's degree or equivalent in BE/BTech/BSc or MSc in IT.   Years of experience: 10+ years.   Experience in best Application Security Testing practices and troubleshooting skills in current versions of AppScan Enterprise and AppScan Standard is required.   Should additionally have broad knowledge and demonstrated experience in core Application Security concepts (e.g. OWASP Top 10) and testing methodologies (DAST, SAST, IAST, SCA, etc.), as well as demonstrated strong general troubleshooting skills.   Experience in automating Application Security.   Experience in any automation server tools like Jenkins.   Experience in using defect tracking tools like Jira.   Experience in both Windows and Linux usage and basic administration required, as well as basic familiarity with Microsoft SQL server.   Strong written and verbal communications skills are critical as this person will be interfacing with diverse technical and business audiences.  GOOD TO HAVE    Experience in developing web applications using Node JS technology.  Technical / Professional Skills    Application Security Tools (Veracode, CheckMarx, Coverity, Synopsis, MF Fortify, BugFix, Netsparker, Black Duck, etc.).  Non-Technical / Soft Skills    Candidate should be a proactive problem solver with customer-facing experience, strong written and spoken communication skills, and be comfortable speaking in an public forum. Must be able to understand and translate customer requirements and challenges into successful Application Security Testing Processes. ",
            "datePosted": "2023-03-24",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 9000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/senior-technical-specialist-%E2%80%93-application-security-testing-hcl-singapore-c9f8c04a1516601b524180c408e3af24?source=MCF&event=Search",
            "uuid": "caad2a79-74fd-4a67-9d6b-19258451dbc9"
        },
        {
            "dueDate": "2023-03-29",
            "jobTitle": "22578674 Application Security Testing Manager (SVP/Hybrid)",
            "skills": [
                "Application Security",
                "Kubernetes",
                "Cloud Computing",
                "Third Party Management",
                "Artifactory",
                "Maven",
                "Enterprise Architecture",
                "CISA",
                "CISSP",
                "Threat Modeling"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "5 CHANGI BUSINESS PARK CRESCENT"
            },
            "company": {
                "logo": null,
                "name": "CITIBANK N.A."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Description:  The position is a cross-functional role that will be responsible for various Application Security program initiatives. The position reports directly to the Application Security Program Director.  The successful candidate must be an individual who understands modern software development trends, understands engineering-led software security practices, and keeps up with the ever evolving cyber security threat landscape. The successful candidate will liaise with internal groups and our regional partners to ensure that program deliverables are met. Success in the role requires an innovative mind, a proven track record of delivering solutions that meet security needs, integrate application security into our DevOps pipeline, automate security as code and enable successful detection and response to any and all threats in our environment. The individual will work closely with SSDLC program to contribute to defining application security testing standards and policies.  Responsibilities include defining testing services and methodologies (be they tool-based and/or manual) in the early SSDLC lifecycle.  The primary focus will address testing needs within development organizations striving for continuous deployment and using automated security tooling including SAST, DAST and SCA. Within his/her leadership role, this individual is expected to mentor team members, set direction and lead execution of services as a hand-on participant.   Key Responsibilities: The candidate will be responsible for the aspects of the Application Security Program initiatives including but not limited to the following:    Establish/manage multiple security programs that support the security testing requirements at the bank   Forging and maintaining strong working relationships with development functions/teams, product delivery teams, project management, third party management, enterprise architecture, audit teams, etc.   Participate in security and technology strategic planning to ensure identified risk governance is incorporated into the CISO enterprise strategy.   In partnership with business sectors,  run delegate action groups to provide recommendations to strengthen  development processes and security testing   Appropriately assess risk and provide software security advice when business decisions are made   Interface with Application Security Program Team  to oversee Program Projects and Initiatives and make strategic recommendations to senior manager on standards and policy changes  Qualifications    Manage APAC Early Application Vulnerability Detection (EAVD) operations and collaborate with NAM stakeholders to drive security initiatives across the region   Experience in key activities within software security group such Threat Modeling / Application Risk Assessment, Vulnerability Assessments, Training.   Pre-requisites for this position are a Bachelor's Degree with 4 - 6 years' experience in application development or application secure code review   Experience must include experience as a technical lead or manager   Knowledge of cloud computing concepts and DevOps tools (OpenShift, Kubernetes, Docker, Chef, etc)   Experience using or testing cloud platforms (AWS, Google, Azure, etc)  and security in/of the cloud is a plus   Understanding of security, web-based and infrastructure vulnerabilities is required   Experience in source code management, build and deployment technologies such as RLM, Udeploy, Jenkins, Artifactory, Maven, GitHub, etc   Experience conducting vulnerability assessments and articulating security issues to technical and non-technical audience.   Understanding of Checkmarx, AppScan Source, Fortify, Veracode, SonarQube, Snyk, Sonatype or Black Duck platform is a plus.   Knowledge of tools and processes used to expose common vulnerabilities and implement countermeasures is expected.   Excellent communication skills (written and verbal) and the ability to communicate with all levels of staff and management are also essential.   Demonstrated knowledge of recognized security industry standards and leading practices (e.g., FFIEC, NIST, C2M2, ISO)   Relevant professional certifications: GIAC, CISA, CISM, CRISC, CISSP or equivalent desired   Effective strategic planning and execution abilities with exceptional planning   Demonstrate advanced functional understanding of Security industry operations, technologies.  Education:    Bachelor’s degree/University degree or equivalent experience   Master’s degree preferred ",
            "datePosted": "2023-02-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 20000,
                "minValue": 15000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/22578674-application-security-testing-manager-citibank-na-9dd1325ba6f5c35007d061421f70b1f8?source=MCF&event=Search",
            "uuid": "7e877d2b-4f6e-46a8-8e43-591e454818d8"
        },
        {
            "dueDate": "2023-03-29",
            "jobTitle": "22553172 Compliance Testing Senior Officer - Senior Vice President",
            "skills": [
                "Negotiation",
                "Adaptive",
                "Remediation",
                "Strong Attention To Detail",
                "Assessing",
                "Transparency",
                "Risk Management",
                "Auditing",
                "Presentation Skills",
                "Internal Audit",
                "Articulate",
                "Regulatory Requirements",
                "Audit",
                "Financial Services"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "5 CHANGI BUSINESS PARK CRESCENT"
            },
            "company": {
                "logo": null,
                "name": "CITIBANK N.A."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Serves as a senior compliance risk officer for Independent Compliance Risk Management (ICRM)’s Testing team responsible for assessing compliance risks and controls implemented by the first and second line of defense. Also responsible for performing risk assessments of Citi's compliance risks; performing independent testing activities (testing and on-going monitoring) to assess the design and effectiveness of key controls designed to address compliance risk; reporting and escalating control issues and any violations of laws or breaches of policy; and validating adequacy of remediation taken to address reported issues. Key Activities include:    Developing, implementing, and executing compliance testing, continuous testing, and reporting programs within an assigned region in accordance with the Compliance Testing (CT) Plan.   Participating in the planning, executing, and reporting of compliance testing reviews and compliance and regulatory issue validation activities for a component of a product line, function, or legal entity within an assigned region in accordance with CT Plan.   Serving as a lead reviewer for complex reviews, analysing report findings, and communicating findings to corresponding control/process owners.   Ensuring the timely delivery of high quality, value added testing and audit reports for a portfolio of business activities, which meet the requirements of the Boards of Citigroup and Citibank, their affiliates, and of Citi’s respective regulators, globally.   Analysing and documenting report findings, and having preliminary discussions with corresponding control/process owners.   Assisting with development of Compliance Testing Risk Assessments, Monitoring Monthly, and Quarterly Summaries and the development and enhancement of the Compliance Testing Methodologies and Standards for auditing, testing, monitoring, and reporting.   Utilizing innovative compliance testing solutions including Data Analytics to increase value and reduce costs of compliance-related activities.   Developing effective relationships within CT function and with other stakeholders including Business process owners and Internal Audit function.   Identifying industry best practices and share insight with the CT teams on a regular basis.   Informing CT management of significant compliance matters that require their attention or action.   Additional duties as assigned.   Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.  Qualifications:    10+ years of experience   Expertise of Compliance laws, rules, regulations, risks and typologies   Experience in planning, executing, and reporting on compliance testing reviews and regulatory issue validation activities   Knowledge and extensive experience with auditing principles including audit planning, risk assessments, development of risks and controls matrices, processes and controls design assessments, controls operating effectiveness testing, transactional access segregation of duties, transactional testing, surveillance systems, and reporting activities   Demonstrated career progression within highly respected diversified institutions with complex and diverse products and customers   Understanding of rules, laws, and regulations, and specific regulatory requirements impacting financial services and [insert product, function, legal entity or regional nature of role as required]   Strong interpersonal skills for building strong relationships with stakeholders and engaging teams   Effectiveness in working within a large scale and complex matrix organization is essential   Effective negotiation skills, a proactive and “no surprises” approach in communicating issues, and strength in sustaining independent views   Excellent oral communication and writing skills in interacting with non-executives and executive management and across a number of business lines and control functions   Willingness to travel   Must be a self-starter, flexible, innovative and adaptive   Highly motivated, strong attention to detail, team oriented, organized   Strong presentation skills with the ability to articulate complex problems and solutions through concise and clear messaging   Ability to work collaboratively with regional and global partners in other functional units; ability to navigate a complex organization; to influence and lead people across cultures at a senior level   Experience in managing regulatory exams and relationships with examiners, auditors, etc   Awareness of regulatory requirements including local and US laws, international and industry standards   Advanced knowledge in area of focus  Education:    Bachelor's/University degree, Master's degree preferred   Bachelor’s degree; experience in compliance, legal or other control-related function in the financial services firm, regulatory organization, or legal/consulting firm, or a combination thereof; experience in area of focus; Advanced degree a plus ",
            "datePosted": "2023-02-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 20000,
                "minValue": 15000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/22553172-compliance-testing-senior-officer-senior-vice-president-citibank-na-15761c2540ef15afd85c233164a23926?source=MCF&event=Search",
            "uuid": "207c8d13-cce6-4911-ae1a-91a7cfbabc43"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Test Manager",
            "skills": [
                "Service Management",
                "Contract Management",
                "Test Engineering",
                "Soft Skills",
                "Project Management",
                "Software Testing",
                "French",
                "Test Methodologies",
                "Selenium",
                "ITIL",
                "Test Strategy",
                "Test Execution",
                "Delivery Management",
                "Financial Services",
                "Test Management",
                "Test Planning"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "ONE RAFFLES PLACE, 1 RAFFLES PLACE"
            },
            "company": {
                "logo": null,
                "name": "D2X EXPERTISE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "d²X Expertise is a global IT Services company dedicated to Project Management, Service Management and Contract Management operations. We provide to our customers, CxOs (CIO, CTO, COO, CEO) of multinational, or large international companies, a full range of services to secure their commitments. Based in Singapore, Switzerland, France and Belgium, our consultants have both a strong experience and the right soft skills to steer and manage multi-level projects and complex IT projects. - Project Management: PM in infrastructure, solution, application, IT Project Office set-up, Business Analyst… - Service Management: implement ITIL process, Service Catalog, SLA, KPI, Change Management, Service Delivery Management, Outsourcing Contract Management) - Contract management: Transition Manager, Relationship Manager, Contract manager.. We are serving key accounts across Asia ; Europe in multiple industries including Services, Manufacturing, Financial Services, Transportation ; Logistics, Telecom... KEY ACTIVITIES Ensure that projects meet their delivery quality objectives within time, cost and risks constraints by following Client’s Test methodologies and processes. Contribute to internal streams and projects: Project and test methodologies evolution, Client support on Test management practices Our Test manager are in charge of:    Deploys the      test methodology on projects            Coordinate       test related activities within client’s project team (covering       definition, design, execution and control).       Lead the       test management stream and resources. Monitor scope, schedule, and budget       of the stream. Monitor and mitigate risks and issues of the stream.       Analyzes       the project requirements and planning to design client’s test strategy       and plan.       Contribute       to the quality risk identification and analysis throughout the project to       ensure sufficient and accurate test coverage.       Assesses       opportunities and tools for automation; and defines a deployment plan on       the project.       Coordinates       and drives project test campaigns and report on progress and results.       Performs       handover on the project test deliverables to Client and Murex internal       teams           Supports and      advises the definition of Client global test strategy and plan   Plan and      contribute to the client’s test training and knowledge transfer to client’s      project team and customers.   Capitalizes      and provides project KPI to enhance the client’s test methodology.   Contribute      to test product evolution, support best practices elaboration and      deployment, proposes and follows on CBRs.   Contribute      to presale for Test Engineering domain  PROFILE · Minimum 7Y of professional experience in a similar environment, Client or Vendor side. · Cooperation and cross functional leadership · Strong communication and presentation skills · Experience in managing contributors and team members · Experience with DevOps, SaaS, CI/CD is a plus · Curiosity and mindset for change management · French is a plus",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 14000,
                "minValue": 7000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/consulting/test-manager-d2x-expertise-f471d2964c0cda346ca649ec27478488?source=MCF&event=Search",
            "uuid": "4a9834ff-349c-4943-94ad-2de667f4d50a"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Test Program Manager",
            "skills": [
                "ISTQB",
                "Automation Testing",
                "Application Security",
                "Test Engineering",
                "Agile",
                "Test Cases",
                "Test Automation",
                "QTP",
                "Program Management",
                "ISTQB Certified",
                "JIRA",
                "PMP",
                "Audits",
                "Banking",
                "ALM",
                "Test Strategy",
                "Test Automation Tools",
                "Testing",
                "Test Management",
                "LoadRunner"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "UOB PLAZA, 80 RAFFLES PLACE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/d531c13c89efb756e1ee4cbb2647d03f/techknowledgey.png",
                "name": "UNITED OVERSEAS BANK LIMITED"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "United Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.  Our history spans more than 80 years. Over this time, we have been guided by our values — Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.  The Technology and Operations function is comprised of five teams of specialists with distinct capabilities: business partnership, technology, operations, risk governance and planning support and services. We work closely together to harness the power of technology to support our physical and digital banking services and operations. This includes developing, centralising and standardising technology systems as well as banking operations in Singapore and overseas branches. Job Responsibilities    Overall accountable and responsible for delivery of testing services across the Payment Program   Manage and oversee the day-to-day delivery of test services by Bank appointed vendors in the conduct of testing   Works with the testing service providers and other UOB stakeholders to review, provide feedback and sign off on the test strategy, test plans and other test service providers’ artefacts for the testing service delivery   Coordinates with the Test Governance team to ensure adoption of testing methods, standards and tools, and to coordinate any health checks or audits   Ensures that any changes to the scope of services are communicated to the respective test service providers and the impact is factored in to the plan   Engages with various UOB stakeholders (including but not limited to, application, security, infrastructure, business), testing service providers to ensure testing services meet the banks’ objectives and demand   Act as the first point of escalation for any issues raised by UOB stakeholders, testing service providers   Quantify, manage, track and report test related statuses, SLA and KPIs, and ensure that defined testing transformation SLA and KPI targets are met for the portfolio accountable   Drive and collaborate with all UOB stakeholders and test service providers to plan all testing related deliveries for the portfolio accountable   Participate and contribute in forums, as required, to drive testing transformation and innovation   Works closely with the Test Engineering Lead to provide inputs around domain specific test engineering requirements and ensure that they are met   Establishes and maintains effective working relationships with the Vendor Test Managers/Test Leads for the respective domains   Engages stakeholder communities to get their feedback on testing service delivery and identify improvement opportunities to be fed back to the Test CoE team  Job Requirement    Bachelor’s Degree or Master’s degree in computer engineering or related field   Proven working experience in test delivery or equivalent role with at least 12 years relevant experience in large and complex organisations preferably in the area of Banking and Finance   Extensive experience in managing end to end delivery of testing services from multiple vendor test service providers   Proven experience in testing standards, tools, processes ; methodologies, frameworks, and various delivery methodologies e.g. Agile, Hybrid Agile and Waterfall, DevOps   Proven, successful track record of managing shared IT service development and/ or IT Testing Services   Demonstrated success in developing highly effective working relationships with internal and external stakeholders to deliver collaboration, partnerships and services   Strong domain knowledge on Payment Program. Experience in managing testing for Payment Suite of applications will be an advantage   Strong attention to details, excellent analytical and problem solving skills   Experience in managing multiple external testing service providers.   Experience in managing multi-cultural, diverse, direct and virtual teams   Experience in various testing tool suites like HP UFT/QTP, Loadrunner/Performance Center/Sitescope, HP ALM / Quality Center, Tosca, Selenium, JIRA etc   Must display a high level of professional judgment, commitment, integrity, and teamwork   Excellent client facing, internal communications, written and verbal communication skills   Testing or quality certifications, PMP certifications, and Test Maturity Model integration (TMMi) Framework awareness will be preferred ",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 15000,
                "minValue": 11000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/banking-finance/test-program-manager-united-overseas-bank-e8322c90751bdcabd42a979ff57f6dfb?source=MCF&event=Search",
            "uuid": "8765fd2b-a936-40c8-8701-133d7ea9d811"
        },
        {
            "dueDate": "2023-04-03",
            "jobTitle": "Photonics Test Development Engineer - Optics |",
            "skills": [
                "Design",
                "Production",
                "Photonics",
                "Python",
                "Optical Components",
                "Instrumentation",
                "Programming",
                "Oral & Written Communication Skills",
                "Labview",
                "Calibration",
                "Script",
                "Testing",
                "Signal Processing"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "7 ANG MO KIO STREET 64"
            },
            "company": {
                "logo": null,
                "name": "APPLE SOUTH ASIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Summary We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk! These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. You will have the opportunity to be responsible for developing test plan ; metrics for characterisation of photonics product as well as test system and methodology for characterising photonics product. Will you help us design the next generation of revolutionary Apple products? Key Qualifications    Well trained in geometric optical domain, have in depth understanding on metric for optical components for example, distortion, EFL and etc   Hands-on experience on optical alignment and calibration   Hands-on experience on established equipment (such as Trioptics) for lens distortion measurement, optical power measurement, spectral measurement, high speed pulse measurement   Experience on building up experimental setup for photonics / optical characterisation   Clear and effective written and communication skill   Good to have: Experience on simple programming/ script for instrumentation or signal processing (for example, Python, Labview, or C++)   Good to have working experience on compact optical module: design, testing, characterisation and/or production  Description    Participate in cross-functional group discussion for test and characterisation of photonics product such as lens or light source   Derive an evaluation plan for characterising the optical component/ module/ system   Source test system to support product development   Setup and calibrate test solution hardware and software   Provide test and characterisation service to other team   Perform experiment, analyse data using statistical analysis tools   Participate in optical component design and evaluation  Education Bachelor/Master/PhD in photonics, optics, physics or engineering or equivalent",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 20000,
                "minValue": 10000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/engineering/photonics-test-development-engineer-optics-apple-south-asia-a479ceba4152f97ed71a7e102c452721?source=MCF&event=Search",
            "uuid": "4d938b78-de2d-4a42-b5b4-8f24ecabeaea"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Software Development Engineer in Test - TikTok Global E-commerce",
            "skills": [
                "Automation Testing",
                "Quality Assurance",
                "Software Engineering",
                "Automation Tools",
                "HTML5",
                "Test Cases",
                "Product Engineering",
                "Corporate Social Responsibility",
                "Testing Process",
                "Selenium",
                "Stress Testing",
                "Teamwork Skills",
                "Genetics",
                "Test Execution",
                "Appium"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "1 RAFFLES QUAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/0998cece2d3d358f15cf853a2a37dcd3/tiktok.png",
                "name": "TIKTOK PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.   Why Join Us At TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.  The e-commerce industry has seen tremendous growth in recent years and has become a hotly contested space amongst leading Internet companies, and its future growth cannot be underestimated.  With millions of loyal users globally, we believe TikTok is an ideal platform to deliver a brand new and better e-commerce experience to our users. Our product engineering team is responsible for building an e-commerce ecosystem that is innovative, secure and intuitive for our users. We are looking for passionate and talented people to join us as we drive the future of e-commerce here at TikTok.   Responsibilities: - Responsible for the quality assurance of e-commerce business Domain. Design reasonable test plan according to the requirements and technical implementation. Ensure overall test quality and progress on track covering frontend and backend. - Automation testing: Work on specific projects and automate test cases for them and continuously improve and maintain the testing framework. - Create/maintain robust CI/CD pipeline for test execution and quality gates for deployment. - Identify areas for improvement in the testing process and implement solutions. - Participate in code reviews to ensure that code is testable and meets quality standards. - Continuously track and analyze online and offline quality problems while constantly improving the quality of the system. - Stay up-to-date with the latest testing trends and technologies.  Qualifications: - Bachelor's degree or above in computer science or related major is preferred. - 5+ years of work experience in testing and development in the high tech sector.   - Solid knowledge of at least one programming language (Python/Java/Go). - Solid knowledge of computer field fundamentals for networking, database and algorithms. - Solid knowledge of api automation testing/UI-automation testing, server-side stress testing.   - Experienced in quality assurance methodology and have certain understanding of CI/CD. - Passionate, self-motivated and can demonstrate excellent teamwork skills. Self-driven at discovering, analyzing and summarizing problems to promote continuous improvement of projects.  TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 18000,
                "minValue": 9000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-development-engineer-test-tiktok-global-e-commerce-tiktok-1d2cff676f5f326469bfeb83c8b2a9c3?source=MCF&event=Search",
            "uuid": "ef4b38f2-7234-4f29-9e4d-246b7dcb9c4c"
        },
        {
            "dueDate": "2023-04-19",
            "jobTitle": "Software Development Engineer in Test, TikTok Global E-commerce",
            "skills": [
                "Automation Testing",
                "Quality Assurance",
                "Software Engineering",
                "Automation Tools",
                "HTML5",
                "Test Cases",
                "Product Engineering",
                "Corporate Social Responsibility",
                "Testing Process",
                "Selenium",
                "Stress Testing",
                "Teamwork Skills",
                "Genetics",
                "Test Execution",
                "Appium"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "1 RAFFLES QUAY"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/0998cece2d3d358f15cf853a2a37dcd3/tiktok.png",
                "name": "TIKTOK PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.   Why Join Us At TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.  The e-commerce industry has seen tremendous growth in recent years and has become a hotly contested space amongst leading Internet companies, and its future growth cannot be underestimated.  With millions of loyal users globally, we believe TikTok is an ideal platform to deliver a brand new and better e-commerce experience to our users. Our product engineering team is responsible for building an e-commerce ecosystem that is innovative, secure and intuitive for our users. We are looking for passionate and talented people to join us as we drive the future of e-commerce here at TikTok.   Responsibilities: - Responsible for the quality assurance of e-commerce business Domain. Design reasonable test plan according to the requirements and technical implementation. Ensure overall test quality and progress on track covering frontend and backend. - Automation testing: Work on specific projects and automate test cases for them and continuously improve and maintain the testing framework. - Create/maintain robust CI/CD pipeline for test execution and quality gates for deployment. - Identify areas for improvement in the testing process and implement solutions. - Participate in code reviews to ensure that code is testable and meets quality standards. - Continuously track and analyze online and offline quality problems while constantly improving the quality of the system. - Stay up-to-date with the latest testing trends and technologies.  Qualifications: - Bachelor's degree or above in computer science or related major is preferred. - 3+ years of work experience in testing and development in the high tech sector.   - Solid knowledge of at least one programming language (Python/Java/Go). - Solid knowledge of computer field fundamentals for networking, database and algorithms. - Solid knowledge of api automation testing/UI-automation testing, server-side stress testing.   - Experienced in quality assurance methodology and have certain understanding of CI/CD. - Passionate, self-motivated and can demonstrate excellent teamwork skills. Self-driven at discovering, analyzing and summarizing problems to promote continuous improvement of projects.  TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.",
            "datePosted": "2023-03-20",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/software-development-engineer-test-tiktok-global-e-commerce-tiktok-35911ef2d2d33ed56c260aea580fc654?source=MCF&event=Search",
            "uuid": "3c0bfdc1-8b89-48e1-828e-39417d8a9aae"
        },
        {
            "dueDate": "2023-03-29",
            "jobTitle": "Sr. Test Program Manager – API",
            "skills": [
                "Excellent Communication Skills",
                "Management Skills",
                "Budgets",
                "Leadership",
                "Microsoft Excel",
                "Analytical Skills",
                "Agile",
                "Amazon Web Services",
                "Strategy",
                "Program Management",
                "Project Management",
                "API",
                "Stakeholder Management",
                "Test Management"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE OCTAGON, 105 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "DNA INFOTECH PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Experience in performing Test Management      Activities across multiple projects with sound knowledge on STLC      processes, best practices etc.   At least 5 years experience of working as Test Manager, preferably from      BFSI   Good knowledge on API Testing module   Excellent communication skills, efficient in Sr.      stakeholder management   Experience of handling projects in multi vendor      set up amid aggressive timeline ",
            "datePosted": "2023-02-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10500,
                "minValue": 7500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/sr-test-program-manager-%E2%80%93-api-dna-infotech-0e46735ab2b9777d6275b5bf6007ce94?source=MCF&event=Search",
            "uuid": "2a887f49-5d17-4a40-96f7-91c056743bdb"
        },
        {
            "dueDate": "2023-03-29",
            "jobTitle": "Sr. Test Program Manager – Payments",
            "skills": [
                "Excellent Communication Skills",
                "Manual Testing",
                "Analytical Skills",
                "Interpersonal Skills",
                "Scripting",
                "user testing",
                "Test Cases",
                "Adaptability",
                "Stakeholder Management",
                "Test Management"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE OCTAGON, 105 CECIL STREET"
            },
            "company": {
                "logo": null,
                "name": "DNA INFOTECH PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Experience in performing Test Management      Activities across multiple projects with sound knowledge on STLC      processes, best practices etc.   At least 5 years experience of working as Test Manager   Strong BFSI background, good knowledge on      Payments module   Excellent communication skills, efficient in Sr.      stakeholder management   Experience of handling projects in multi vendor      set up amid aggressive timeline ",
            "datePosted": "2023-02-27",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 10500,
                "minValue": 7500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/information-technology/sr-test-program-manager-%E2%80%93-payments-dna-infotech-941fe157c6259bcb0e93033cb7a842e1?source=MCF&event=Search",
            "uuid": "c8ee44b5-5ebf-4868-b4b6-4c38bc560211"
        }
    ]
}