{
    "jobs": [
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant/Senior Accountant",
            "skills": [
                "Corporate Governance",
                "Regulatory Compliance",
                "Problem Solving",
                "Accounting System",
                "Accruals",
                "Accounting",
                "Communication Skills",
                "SOA",
                "Vlookup",
                "Audit",
                "Fixed Assets"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "REPUBLIC PLAZA, 9 RAFFLES PLACE"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/962dd3961b59167448f52736f9c84846/ferrari-logistics-singapore.jpg",
                "name": "FERRARI LOGISTICS SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "About Ferrari Group As a one-stop service provider specializing in shipping, integrated logistics and high value-added services for precious goods worldwide, Ferrari Group is a leading corporation in the freight forwarding business for luxury clients.  Founded in Italy, now headquartered in London, UK, Ferrari group has a network of offices and agents in over 80 cities.  The Singapore office, with 3 offices across the city, is seeking talents to join our team in our expansion project.     Responsibilities And Requirements Handling full sets of accounts • Including checking and reviewing receipts, all payment and accruals of expenses to ensure completeness and adequacy of provision is done • Updating and checking customers and suppliers credit rating before input their details in the accounting system • Verifying transaction before posting into accounting system • Checking and posting GL entries • Preparing fixed assets, Prepayment, Depreciation and Right of use (ROU) schedule • Managing and oversee day to day flow transactions and approve payment to vendors and customers • Verifying the petty cash claims and payments • Keying payroll entries and prepare payroll reports to auditors • Preparing and submitting quarterly GST returns • Preparing audit scheduling and answering queries for corporate and local audit • Preparing and analysing month end financial report (TB, PL and BS) to the local management • Preparing quarterly report to HQ in London • Ability to communicate with the bankers, corporate secretary and auditors • Oversee and ensure accuracy of billing of invoices • Sending of SOA to customers/vendors • Other ad-hoc duties as assigned by the Management  Requirements • Minimum 3 years of relevant work experiences in an internal accounting environment Diploma/ Degree in Accountancy • Good understanding of FRS and accounting principles and statutory regulation • Negotiation and problem-solving skills • Strong written and oral communication skills • Good understanding of corporate governance, regulatory compliance and accounting principles • Good in Excel (Pivot Table, including Vlookup) • Experience in managing a team. To provide guidance and feedback to the team members and work under tight timelines • Able to communicate efficiently with stakeholders • Result-oriented • Short notice or immediate hiring preferred ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-senior-accountant-ferrari-logistics-singapore-f953c705f26db3f219fcfca81bb6f2bf?source=MCF&event=Search",
            "uuid": "619c0245-6c74-4d84-888c-2e0aa0001ae6"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant",
            "skills": [
                "Accounts Payable",
                "Microsoft Excel",
                "Interpersonal Skills",
                "Tax",
                "Books",
                "Financial Transactions",
                "Administration",
                "Payroll",
                "Accounting System",
                "MS Office",
                "Accounting",
                "Attention to Details",
                "Audits",
                "Bookkeeping",
                "Excel",
                "Tax Returns"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "THE CONCOURSE, 300 BEACH ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/1dbc1147def3c94d07c3b8863e4ed63e/bci-central-singapore.png",
                "name": "BCI CENTRAL SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "The Role We are currently looking for an Accountant to be part of our finance team. As an accountant, your main responsibilities include but are not limited to; maintaining accurate books on accounts payable and receivable, payroll, and daily financial entries and reconciliations for our BCI Group business.   To be successful in this role, you should have previous experience with bookkeeping and a flair for spotting numerical mistakes. Ultimately, you will provide us with accurate quantitative information on the financial position, liquidity, and cash flows of our business, while ensuring we’re compliant with all tax regulations.   Responsibilities: - •\tPlan, coordinate, and facilitate end-of-month processes and reporting for the Group such as Singapore, Hong Kong, and any other entities if required •\tReconcile accounts payable and receivable. •\tEnsure all day-to-day financial transactions are processed in the accounting system, is accurate and timely manner – payment updates, processing client’s invoices etc. •\tReview and finalize deferral schedule each month and post necessary journals •\tSingapore’s Payroll administration – payroll processing and statutory requirement. •\tFixes Assets management – additions, disposals, reconciliations •\tReview and finalize deferral schedule each month and post necessary journals •\tManage balance sheets and profit/loss statements •\tCompute taxes and prepare tax returns. •\tHandling queries related to accounts. •\tWork closely with the Group team of accountants and CFO •\tSupport in finance, accounting and adhoc projects as required by the CFO.  Requirements: -  •\tDegree or Diploma holder in Accounting, Commerce or Finance •\tMinimum 5 years of working experience as Accounts or Finance officer •\tWorking experience in multinational companies and with remote teams •\tHands-on experience with liaising with auditors and managing audits •\tExperience with Singapore GST filing •\tExperience with managing intercompany transactions •\tUnderstanding of Singapore payroll regulations and experience payroll administration •\tStrong proficiency and hands- on experience in computing system including MS office, excel, payroll and reporting system •\tIn-depth understanding of general accounting principles. •\tGood interpersonal skills, accuracy and attention to details.  Why Join BCI? •\tTransparent working culture and supportive team! •\tRegional team and exposure. •\tUp to 20 days of Annual Leave per year •\tHybrid work arrangement (office ; home) •\tBirthday ; Work Anniversary Leave. •\tMedical Insurance Coverage   (Only shortlisted candidates will be notified) ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-bci-central-singapore-8532dcdcdc0e5be7248e0b1799d257d6?source=MCF&event=Search",
            "uuid": "11b76a51-9141-49ca-afca-8e0eb4a56226"
        },
        {
            "dueDate": "2023-04-05",
            "jobTitle": "Account Assistant",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Strong Attention To Detail",
                "Ability To Work Independently",
                "Interpersonal Skills",
                "Tax",
                "Financial Transactions",
                "Data Entry",
                "Bank Reconciliation",
                "Accounting",
                "Audit",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "LHK 3, 8 NEW INDUSTRIAL ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/8202418fd55c510b25a542306c3d7eef/sing-wah-enterprise.jpg",
                "name": "SING WAH ENTERPRISE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description: We are looking for a detail-oriented and organized Account Assistant to join our team. The Account Assistant will be responsible for providing support to the accounting team, processing transactions, reconciling accounts, and assisting with financial reporting. Responsibilities:    Assist with processing accounts payable and receivable transactions.   Reconcile bank and credit card statements on a monthly basis.   Prepare and submit invoices to clients and follow up on outstanding payments.   Maintain accurate and up-to-date records of financial transactions and documentation.   Assist with financial reporting, including balance sheets, income statements, and cash flow statements.   Perform other general accounting duties as assigned by the accounting team.   Respond to accounting-related inquiries from internal and external stakeholders.  Requirements:    Bachelor's degree in accounting, finance, or related field.   Minimum 1-2 years of experience in an accounting or finance role.   Knowledge of accounting principles and procedures.   Proficiency in Microsoft Excel and other accounting software.   Strong attention to detail and accuracy.   Good communication and interpersonal skills.   Ability to work independently as well as in a team environment.   Willingness to learn and grow within the accounting team.  If you are a motivated and reliable Account Assistant with a passion for accounting and finance, we encourage you to apply for this exciting opportunity.",
            "datePosted": "2023-03-06",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/account-assistant-sing-wah-enterprise-4c9d5fc7173b0af6a0f75e002f494cb3?source=MCF&event=SuggestedJob",
            "uuid": "02e6ee75-ef82-4cbc-bda4-587d03ccd92f"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Accountant",
            "skills": [
                "Account Management",
                "Microsoft Office",
                "Microsoft Excel",
                "Consolidation",
                "Annual Budgets",
                "Interpersonal Skills",
                "ACCA",
                "Accounting",
                "Compliance",
                "Financial Statements",
                "Office Software",
                "Accounting Standards",
                "Team Player",
                "Tax Returns",
                "Audit",
                "Corporate Finance",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "CARGO AGENTS BUILDING D, 9 AIRLINE ROAD"
            },
            "company": {
                "logo": null,
                "name": "A-SONIC LOGISTICS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description:    Assist in consolidation and reviewing of accounts for the group and subsidiaries.   Ensure timely submission of accounts by subsidiaries.   Ensure accounts submitted are in compliance with local accounting standards, group reporting requirements, tax, statutory, regulations and SGX/MAS requirement.   Implement head office internal control policies, procedures and reporting requirements.   Assist in preparing, monitoring and analysing management reports, forecasts and annual budgets.   Assist in reviewing of tax returns of local subsidiaries and foreign subsidiaries.   Liaise with auditors, tax agents, bankers, company secretaries, government agencies and external parties.   Assist with ad-hoc projects when required.   Requirements:    Possess CPA/CA preferred and Degree in Accountancy/Finance or other related professional discipline.   Minimum 3 years of related experience.   Competent in consolidation of group accounts.   Independent, meticulous and well organized.   Good interpersonal and written communication skills.   Able to work under pressure and meet tight deadlines in fast paced environment.   Possess \"roll up my sleeves\" mind set and ready to hands on whenever required.   Well-versed in Microsoft Office software.   Must have experience in stock exchange dealing rules.   Liaise with SGX on all compliance and corporate finance matters would be a big plus. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-a-sonic-logistics-b83ef2f37bda8021831d4482c7c7c9da?source=MCF&event=Search",
            "uuid": "29139e13-9eaf-4040-a071-12489e6824c7"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant",
            "skills": [
                "Budgets",
                "Microsoft Office",
                "Microsoft Excel",
                "IRAs",
                "Tax",
                "Property",
                "Variance Analysis",
                "Payroll",
                "Financial Accounting",
                "Investment Management",
                "Office Administration",
                "Accounting",
                "Financial Analysis",
                "Cost Control",
                "Corporate Finance"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "29B KEONG SAIK ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/549600d67e1a40c00abe87afe853a80f/hippo-prop.jpg",
                "name": "HIPPO PROP PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Key Attributes: Meticulous. Sharp. Systematic.  Role Description: True to all start-up, you will be the sole rep for finance and admin. Reporting to General Manager, you are responsible for day-to-day accounting function, property rental invoice management and office administration.  Experience: 8 years of experience in financial accounting and experience with property rental or investment management is a bonus. Ideally proficient with MYOB and Time Software.  Requirements:    Responsible for day-to-day accounting functions including month end closing, budgets and cashflow forecast, CPF and GST submissions, payroll, and AR/AP functions.   Preparation, review and analysis of management accounts. Corporate finance matters, feasibility studies, financial analysis and evaluation of performances, variance analysis, cost control also fall within the remit of the role.   In-charge of all office admin related matters and liaise with auditors, tax agents, MOM, IRAS, CPF Board and any other government authorities.  Education: Degree in accountancy or professional qualifications",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4800,
                "minValue": 4200,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-hippo-prop-c4195a96f4472bcb5a3993a2ab32a8ec?source=MCF&event=Search",
            "uuid": "f90486a6-e07e-4239-96cf-f7b5927a42db"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant",
            "skills": [
                "Account Management",
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Interpersonal Skills",
                "Tax",
                "ACCA",
                "Payroll",
                "Bank Reconciliation",
                "Accounting",
                "Financial Statements",
                "Team Player",
                "Audit",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "NOVENA SQUARE, 238A THOMSON ROAD"
            },
            "company": {
                "logo": null,
                "name": "JSW ADVISORY PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Requirements     Min Degree in Accountancy   At least 2 years of relevant accounting experience   5 days work week   Working location in Novena ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-jsw-advisory-107ebd1d8afd31914ac113b5ad7073db?source=MCF&event=Search",
            "uuid": "6d16f976-f0c5-4232-9dc9-b49680322616"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant",
            "skills": [
                "Taxation",
                "Account Reconciliation",
                "Tax",
                "Invoicing",
                "Bank Reconciliation",
                "Accounting",
                "Compliance",
                "Human Resource",
                "Banking",
                "Accounting Standards",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "GOLDEN AGRI PLAZA, 108 PASIR PANJANG ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/a19e513eaf5e9c85ac50f118a40302b3/oncod.png",
                "name": "ONCOD PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": ". Manage Accounts/Finance related transactions, banking, invoicing, AP ; AR . Process, GL, account reconciliation, bank reconciliation, etc. . Ensure compliance with Accounting Standards ; best accounting practices. . Monthly Financial reporting. . Dealing in Import ; Export documentation ; related matters. . Handling of Taxation matters, including payments ; returns. . Liaise with government bodies on statutory compliances, licenses, approvals and government surveys and Tax authorities. . Work closely with senior leaders to analyze and interpret business performance from a financial perspective. . Support the full spectrum of Human Resource (HR) functions which includes recruitment, learning and development, appraisal and employees relation. Ensure compliance with MOM regulations and other related authority by HR personnel. . Support in Commercial matters. . Support in Administrative activities (clearing dues, helping in setting up meetings, managing office premises, etc.). . Manage general administrative office duties to ensure office processes run smoothly.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6000,
                "minValue": 4000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-oncod-55006959b4657317943686bb44b6fb9c?source=MCF&event=Search",
            "uuid": "3d3e1c5a-5f5f-4b01-ae9f-556199a3efd8"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Accountant",
            "skills": [
                "Forecasting",
                "External Audit",
                "Microsoft Excel",
                "Strong Attention To Detail",
                "Dynamics",
                "Interpersonal Skills",
                "Tax",
                "Financial Transactions",
                "PowerPoint",
                "Accounting",
                "Compliance",
                "Budgeting",
                "Team Player",
                "Regulatory Requirements"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "LUXASIA BUILDING, 12 TAI SENG STREET"
            },
            "company": {
                "logo": null,
                "name": "Faith Community Baptist Church"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Organisation/Department Summary/Chart Reports to the Assistant Finance Manager Job Purpose: Primary Responsibilities · Prepares financial reports for general management use · Maintains company journals and ledgers · Performs reconciliations of company financial data, researches variances, and adjusts as needed · Enters, reviews, and/or approves financial transactions in company financial systems · Interprets and analyses financial reports for organisation management · Assist in the budgeting and forecasting process · Assists with special projects as assigned · Performs other duties as assigned Duties and Responsibilities: · Able to handle full set of accounts · Ensure timely and accurate financial and management reporting · Assist in the budgeting and forecasting process · Assist with internal or/and external audit · Assist to develop and implement the accounting procedures and policies · Ensure compliance with local statutory, tax, and regulatory requirements · Review and improve workflow · Liaise with bankers, external and internal auditors, tax and secretarial agents · Any other ad-hoc projects Requirements: Education/Professional Qualification · Degree in Accountancy or equivalent with minimum 3 to 5 years of relevant experience · Chartered Accountant certification preferred Preferred Skills/Experience · Good written and verbal communication skills · Strong attention to detail and ability to meet deadlines · Ability to analyse data and make suggestions for adjustment or process improvements · Proficient in Microsoft Excel, Word, and PowerPoint · Microsoft Dynamics 365 Business Central experience is preferred · Good interpersonal skills and a team player",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3500,
                "minValue": 3100,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-faith-community-baptist-church-a3348c50ae89ced24446599db4e1d857?source=MCF&event=Search",
            "uuid": "710250ac-7b3e-4fe7-9beb-2e760790a0cf"
        },
        {
            "dueDate": "2023-04-21",
            "jobTitle": "Accountant",
            "skills": [
                "Outlook",
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Interpersonal Skills",
                "Tax",
                "Payroll",
                "Accounting",
                "Financial Statements",
                "Customer Oriented",
                "Excel",
                "Team Player",
                "Audit",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TUAS COVE INDUSTRIAL CENTRE, 53K TUAS SOUTH AVENUE 1"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/5defcc70e0858cbf731c63433d8a2b98/niu-bros-singapore.png",
                "name": "NIU BROS SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description (Duties and responsibilities):    Assist to Account Manager.   Prepare claim, quotation, PO, invoice and follow up.   Communicating with clients regarding billing and payments.   Handle and prepare full sets of accounts.   Maintaining client relationships.   At least one year' experience in a similar role.   Working hour: Mon-Fri, 0900 am-1830 pm.  Requirement:    Minimum “O” Level or ITE. Fresh graduate may apply.   Hardworking and willing to learn attitude.   Customer oriented, good communication and interpersonal skill.   Proficient in use of Excel, Word and Outlook.   Work well in a team. ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-niu-bros-singapore-e37051cd766133ffb3a0d67ee2b56400?source=MCF&event=Search",
            "uuid": "7eb7b983-dfd0-4f49-94f2-794ee75c246e"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Account Executive / Senior Account Executive",
            "skills": [
                "Vendor Relationships",
                "Accounts Payable",
                "Ability To Work Independently",
                "Consolidation",
                "Interpersonal Skills",
                "Tax",
                "Job Descriptions",
                "Accounting System",
                "Bank Reconciliation",
                "Accounts Receivable",
                "General Ledger",
                "Accounting",
                "Financial Statements",
                "Xero",
                "Banking",
                "Accounting Standards",
                "Cash Flow",
                "Tax Returns",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "ROYAL GROUP BUILDING, 3 PHILLIP STREET"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/aa2d5eb7159d52406390c70dae85c707/lotusia.png",
                "name": "LOTUSIA PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Highlights    Fun Working Environment   Attractive Remuneration Package   Career Development Opportunity  Job Description We are an energetic team who are looking for a candidate passionate about continuous learning and pursue career development.  Why Join Us?    Leadership opportunity   Open discussion work environment   Gain career exposure   Career development opportunity   Work life balance   Company activities: Movie Day, company trip, etc...  Job Descriptions    Prepare and maintain full sets of accounts   Prepare monthly financial and management reports for companies   Consolidate accounts and ensure compliance with accounting standards   Support audit and tax queries   Compute taxes and prepare tax returns   Liaise with banks on banking transactions   Assist in annual budgeting, monitor cash flow   Publish financial statements in time   Report on the company’s financial health and liquidity   Coordinate and liaise with internal parties to support intercompany activities   Answer client's enquiries on accounting/ tax field   Handle tax, withholding tax and gst submission   Identify areas for improvement and implement improvements to processes  Requirements    Bachelor Degree in Accounting ; Finance or equivalent   At least 2-3 years of experience in accounting ; finance   Experience in Singapore tax, gst and witholding tax   Bilingual with proficiency in Mandarin preferred to liaise with Mandarin speaking client   Strong understanding of accounting principles   Ability to work independently with a high degree of accuracy and efficiency   Experience in accounting and secretarial services would be an advantage   Proficiency in accounting software: Xero Accounting would be an advantage   Able to work immediately or 1 month notices  Working Hours: Monday - Friday 9:30am - 6:00pm Location: Raffles Place  Interested candidate may submit your latest resume to lotusia.recruitment@gmail.com",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4200,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/account-executive-senior-account-executive-lotusia-f191fabc99ed1b368db3bce24af049a4?source=MCF&event=Search",
            "uuid": "b044d53f-7ea9-4e0d-9064-10ba1f676f77"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "Senior Accountant",
            "skills": [
                "Forecasting",
                "Accounts Payable",
                "Tax",
                "ERP",
                "Journal Entries",
                "CPA",
                "Accounting System",
                "Internal Controls",
                "SAP",
                "General Ledger",
                "Accounting",
                "Financial Statements",
                "Audits",
                "Budgeting",
                "Accounting Standards",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "KA Centre, 150 Kampong Ampat"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/4f69aeb52245a38ba45665455ec8a8a3/stulz-singapore.jpg",
                "name": "STULZ SINGAPORE PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "As the Regional Senior Accountant for Asia, you will be responsible for overseeing the financial management and reporting of the organization's operations in the Asia region. You will ensure that all financial transactions are recorded accurately, in compliance with applicable accounting standards, and that all financial processes are efficient and effective.  Key Responsibilities: - General Accounting: Oversee and ensure the accuracy of the organization's day-to-day financial transactions, including accounts payable, accounts receivable,  general ledger accounting, and quarterly GST reports for IRAS filing.  Accounts Receivable: o Manage the accounts receivable process, including invoicing, collections, and customer account reconciliations. o Ensure the accurate and timely recording of all accounts receivable transactions in the accounting system, and reconcile accounts receivable to the general ledger. o Work with Stulz subsidiaries, partners in countries, or any customer accounts to resolve any billing disputes or discrepancies.  General Ledger Accounting: o Ensure the accurate and timely recording of all financial transactions in the general ledger, including journal entries, accruals, and prepayments. o Reconcile all balance sheet accounts on a monthly basis, investigate and resolve any discrepancies. o Assist with the preparation of monthly, quarterly, and annual financial statements, ensuring compliance with local and international accounting standards.  - Financial Reporting: Ensure the timely and accurate preparation of financial statements, including profit and loss, balance sheets, and cash flow statements, in compliance with local and international accounting standards. - Budgeting and Forecasting: Work with Asia local and regional teams to develop and implement annual budgets and forecasts, providing insights and analysis to support decision-making. - Internal Controls: Ensure that all financial processes and procedures are in compliance with the organization's internal control policies, and identify areas for improvement. - Tax Compliance: Work with external tax partner to ensure compliance with all relevant tax regulations, including preparing and filing tax returns, and providing support during tax audits. - Audit Management: Work with external auditors to ensure the timely and accurate completion of annual audits, and provide support during audit-related inquiries. - ERP system: Oversee the ERP system to ensure that it is functioning optimally and meeting the financial needs of the organization.  Key Requirements: · Bachelor's degree in Accounting, Finance, or related field. · Professional accounting certification (e.g. CPA, CA, ACCA) preferred. · Minimum of 8 years of experience in accounting, with at least 3 years of experience in a senior accounting role. · Strong understanding of accounting principles, regulations, and practices. · Experience with financial management software, such as SAP or Oracle will be a plus. · Excellent analytical skills, with the ability to provide insights and recommendations based on financial data. · Strong communication skills, with the ability to effectively communicate financial information to non-financial stakeholders.",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 6500,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/senior-accountant-stulz-singapore-13a6d7b6c67c777716e4643ec29f9747?source=MCF&event=Search",
            "uuid": "b7e06e4c-597e-4ed6-8055-3e198778fcb9"
        },
        {
            "dueDate": "2023-04-30",
            "jobTitle": "ACCOUNTS ASSISTANT",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Analytical Skills",
                "Tax",
                "Data Entry",
                "Bank Reconciliation",
                "MS Office",
                "Accounting",
                "Financial Statements",
                "Bookkeeping",
                "Team Player",
                "Disposition",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "TRIVEX, 8 BURN ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/7fff7b6f3065a5fd0d666ad7b992d452/s-c-mohan-pac.PNG",
                "name": "S C MOHAN PAC"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities:     Handle full sets of accounts   Handle accounting assignments independently   Perform monthly accounts closing and relevant reports   Maintain accounting files and records   Assist in preparing financial statements and schedules   Handle tax filing for corporate clients   Assist with GST filings / registration   Ensuring timely completion of audit / accounts and ensuring meeting monthly budget / billing  Requirements:     A recognized degree in accountancy / professional qualification from an international accounting Institute   At least 1-year working experience in audit or accounting field   Bookkeeping knowledge   Strong analytical skills, resourceful, able to work independently and as a team player   Committed to work under tight deadlines   Good command of English with strong inter-personal and communications skill   Eye for details   Computer literate and proficient in MS Office   Pleasant disposition   Candidate seeking long term employment ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 4000,
                "minValue": 2000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accounts-assistant-s-c-mohan-pac-53a84a184a82cc8cde1ff2f13d914dca?source=MCF&event=Search",
            "uuid": "2b07a7ae-2d8b-4181-af41-e7644235c1ca"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Accounting Manager",
            "skills": [
                "Negotiation",
                "Account Management",
                "Microsoft Excel",
                "Interpersonal Skills",
                "Selling",
                "Strategy",
                "MS Office",
                "Accounting",
                "Attention to Detail",
                "Bookkeeping",
                "Presentation Skills",
                "Customer Satisfaction",
                "Team Player",
                "Business Development",
                "Databases"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "INTERNATIONAL PLAZA, 10 ANSON ROAD"
            },
            "company": {
                "logo": null,
                "name": "KGM GROUP PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "   Proven working experience as Accounting Manager, Accounting Supervisor or Finance Manager   Advanced computer skills on MS Office, accounting software and databases   Ability to manipulate large amounts of data   Proven knowledge of bookkeeping and accounting principles, practices, standards, laws and regulations   High attention to detail and accuracy   Ability to direct and supervise   BS degree in Accounting or Finance ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 12000,
                "minValue": 8500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/wholesale-trade/accounting-manager-kgm-group-f88d8ed79befbaa3e6538bd3b72a4ade?source=MCF&event=Search",
            "uuid": "c36611aa-005f-4f9f-b519-d0e92c6c77f8"
        },
        {
            "dueDate": "2023-04-20",
            "jobTitle": "Account Executive",
            "skills": [
                "Forecasting",
                "Accounts Payable",
                "Tax",
                "Selling",
                "Bank Reconciliation",
                "General Ledger",
                "Accounting",
                "Financial Statements",
                "Bookkeeping",
                "Cash Management",
                "Excel",
                "Team Player",
                "Cash Flow",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SUNRAY BUILDING, 9 SUNGEI KADUT STREET 3"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/63f27c9e5454156f9a481b6eb48e43e2/sunray-woodcraft-construction.jpg",
                "name": "SUNRAY WOODCRAFT CONSTRUCTION PTE LTD"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "· Day to day preparation of full set of accounts (AR, AP ; GL); · Prepare and maintain bank reconciliations, Prepare statement of accounts, Follow up on collection matters.      Maintain ; reconcile accounts payable accounts; · On time preparation of financial statements and reporting; · Assists in the preparation of financial statements within specific timelines; · Assists in cash management ensuring that there is positive cash flow through prompt collection of receivables   and effective cash forecasting; · Responsible for preparation and maintenance of general ledgers; · Updates, maintains and reports on fixed asset listing; · Preparation of monthly sales reports and accounts receivables; · Assists in maintaining bookkeeping; · Carries out intercompany reconciliation in a timely manner; · Allocation of costs to respective project accounts; · Prepares monthly salary and wages for General Ledger purpose and allocation of manpower costs to respective     project accounts; · Prepares GST reports; · Updates and maintains accounts payable file; · Any other duties as assigned.",
            "datePosted": "2023-03-21",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 2500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/account-executive-sunray-woodcraft-construction-8e80efffed933b6414ae0ea4736861b8?source=MCF&event=SuggestedJob",
            "uuid": "60d8fb99-19be-476a-b9e7-4558ba11b81b"
        },
        {
            "dueDate": "2023-04-14",
            "jobTitle": "Account Assistant",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Tax",
                "Accounting System",
                "Auditor",
                "Data Entry",
                "Bank Reconciliation",
                "Accounts Receivable",
                "Physically Fit",
                "Accounting",
                "Accpac",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "WOODLANDS INDUSTRIAL PARK E, 34 WOODLANDS INDUSTRIAL PARK E5"
            },
            "company": {
                "logo": null,
                "name": "MILLIONBUILT PTE LTD"
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Prepare quarterly GST return   Preparing of monthly schedules and reconciliationof G/L   Monthly bank reconciliation   Preparing of auditor schedules and liaise with auditor   Monthly management report   AR ; AP Transaction, data entries and checking entries   Answering phones   Reconciling of Creditors accounts   Any adhoc duties related to accounts  Requirements    Diploma in Accountancy/LCCI with experience in accounts an advantages   At least one year working experience / Fresh graduate may apply   Positive working attitude and responsibility   Physically fit and able to work in fast paced environment, reliable, initative and hardworking   Preferably knowledge in Accpac accounting system or equivalent   Computer literate and knowledge in Microsoft office ",
            "datePosted": "2023-03-31",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 2800,
                "minValue": 2000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/account-assistant-millionbuilt-5af5df26e8a7979fa7069a7455e5fa92?source=MCF&event=Search",
            "uuid": "8fe3c1b3-02e9-4ff6-82d6-f6a6c46902ef"
        },
        {
            "dueDate": "2023-04-24",
            "jobTitle": "Accountant",
            "skills": [
                "Account Reconciliation",
                "Forecasting",
                "Tax",
                "Invoicing",
                "MS Office",
                "PowerPoint",
                "Accounting",
                "Good Communication Skills",
                "Financial Statements",
                "Audits",
                "Bookkeeping",
                "Budgeting",
                "Financial Closing",
                "Able To Work Independently",
                "Financial Reporting"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "MARINA BAY FINANCIAL CENTRE, 10 MARINA BOULEVARD"
            },
            "company": {
                "logo": null,
                "name": "CORPBOND INVESTMENTS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Responsibilities    Manage bookkeeping works such as invoicing, data entries, payments      and filing;   Prepare monthly management financial statements;   Prepare annual financial reports;   Responsible for accounting tasks, including AP ; AR process, GL,      account reconciliation, etc;   Ensure timely and accurate financial reporting to the Management;   Support forecasting and budgeting exercise as per company guidelines;   Coordinate and liaise with external parties like external auditors,      tax agents, corporate secretarial agents, local tax and government      authorities where required;   Support and ensure compliance with all finance filing requirements,      tax filing requirement, audits, procedures and forms for both statutory      and internal;   Support related companies’ financial closing and reporting;   Perform any other duties as assigned;  Requirements    Minimum Diploma holder in Accountancy   Able to handle full set of accounting and statutory reporting   Minimum 2 years of working experience in Accounting Field   Well-versed in MS Office, such as MS Excel, PowerPoint and Word   Good communication skills in English and Mandarin   Able to work independently and deliver to deadlines   Meticulous and well-organised   Positive attitude, driven and passionate about work ",
            "datePosted": "2023-03-25",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5000,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-corpbond-investments-576175bed6d5d1532253afde55bb8066?source=MCF&event=Search",
            "uuid": "b57bfffe-8a27-4950-92f4-9808469af66e"
        },
        {
            "dueDate": "2023-04-16",
            "jobTitle": "Accountant / Account Executive",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Construction",
                "Consolidation",
                "Tax",
                "Corporate Tax",
                "ISO",
                "Accounting System",
                "Accounts Receivable",
                "Accounting",
                "Budgeting",
                "Cash Flow",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "15 SOON LEE ROAD"
            },
            "company": {
                "logo": null,
                "name": "ZHENGDA CORPORATION PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Accountant / Account Executive Job Description · Preparing and issuing payments to creditors · Preparing monthly cash flow schedules and budgeting · Filing and organizing of document in accordance with ISO requirement · Manage full set accounts · Ensure timely preparation of monthly. Quarterly and yearly consolidation of financial reports for management and statutory reporting · Assist with related area such as statutory audit, corporate tax and submit GST · Involve in annual budgeting. Including detailed review and analysis of the budget submitted · To supervise junior executives, provide assistance and guidance to them in executing their duties · PIC Claim · Ad-hoc projects as required Job Requirements    Degree in accountancy   Minimum 3 years of experience in construction company   prior audit background will be an advantage   process good communications skills in English ; mandarin   Strong analytical and problem-solving skills   Able to work independently   Able to start work immediately ",
            "datePosted": "2023-03-17",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5800,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-account-executive-zhengda-corporation-54412275040c1ee64f49c9f57b0c1756?source=MCF&event=Search",
            "uuid": "db750cbd-cecd-43ff-8f02-12b54b72022a"
        },
        {
            "dueDate": "2023-04-11",
            "jobTitle": "Accountant",
            "skills": [
                "Budgets",
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "IRAs",
                "Tax",
                "Cash Flow Management",
                "Bank Reconciliation",
                "Accounts Receivable",
                "Accounting",
                "Capital",
                "Team Player",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "SPRINGLEAF TOWER, 3 ANSON ROAD"
            },
            "company": {
                "logo": "https://static.mycareersfuture.gov.sg/images/company/logos/50d427e9524c77940bc702791cf93115/chemone-holdings.jpg",
                "name": "CHEMONE HOLDINGS PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description:    Handle both accounts receivable and accounts payable function   Performing  general accounts duties, reconcile the accounts receivable ledger that all payments are accounted for and properly posted   Processing transaction, issuing checks, updating legers, budgets   Prepare monthly, quarterly, and annual management accounts   Accounting for, preparing and submitting GST returns   Working capital and cash flow management   Monitor weekly and monthly cash flows   Preparing Inter-company reconciliation ; bank reconciliation statement and resolving open items   Coordination with IRAS for tax matters   Coordinate with regional/branch offices   Assisting with audit, general administrative duties or any ad-hoc duties as assigned by superior  Job Requirements:    Diploma in Accountancy / Diploma in Commerce or any other equivalent qualification   At least 2 -3 years of basic accounting experience   Expert knowledge in Microsoft Office such as excel and word   Strong knowledge of compliance   Basic accounting experience   Meticulous, responsible and good team player   Able to work independently ",
            "datePosted": "2023-03-21",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 3800,
                "minValue": 3500,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-chemone-holdings-f1f5e3531c7336370f2671e1ac1649a5?source=MCF&event=Search",
            "uuid": "a6619f03-55fd-44ed-ab05-d0c3b96617cd"
        },
        {
            "dueDate": "2023-04-27",
            "jobTitle": "Accountant",
            "skills": [
                "Forecasting",
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Valuation",
                "Tax",
                "Journal Entries",
                "Financial Transactions",
                "Internal Controls",
                "Accounting",
                "Financial Statements",
                "Income Tax",
                "Fraud",
                "Budgeting",
                "Capital",
                "Audit"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "82 JOO CHIAT ROAD"
            },
            "company": {
                "logo": null,
                "name": "THE ORIGINAL VADAI PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "~ Prepare accurate and timely financial statements. ~ Calculate taxable income and the income tax liabilities of the organisation. ~ Calculate the cost of different types of capital financial instruments and the overall costs of capital for the organisation. ~ Compile accurate tax-related information for the organisation. ~ Compute the valuation of business and financial assets using different models. ~ Ensure the respective privileges and rights are in place within the accounting information system for users with different job roles and functions. ~ Extract data and provide analysis for management using relevant accounting information systems or software. ~ Implement policies and procedures with emphasis on internal controls to prevent possible fraud and errors. ~ Maintain accurate journal entries and allocations. ~ Manage accounts payable and receivables to help the organisation determine working capital needs and funding strategies. ~ Operate accounting information systems efficiently and effectively. ~ Participate in budgeting and forecasting activities. ~ Plan and coordinate the annual financial audit process. ~ Prepare asset, liability, and capital account entries by compiling and analysing account information. ~ Prepare financial statements and disclosure notes. ~ Provide accurate and timely tax and financial reports to the relevant authorities. ~ Provide data in relation to assets, capital rationing and cost of capital. ~ Reconcile accounts and provide analysis for the organisations financial transactions. ~ Resolve issues and deficiencies arising from audit findings. ~ Respond to internal and external auditors on audit data, variances and audit findings.",
            "datePosted": "2023-03-28",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 9000,
                "minValue": 6000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-original-vadai-9303f3be8126aecc6169022e99414610?source=MCF&event=Search",
            "uuid": "3955562e-97ad-4bfb-a5a1-655fbd2e9129"
        },
        {
            "dueDate": "2023-04-27",
            "jobTitle": "Accountant / Account Executive",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Construction",
                "Consolidation",
                "Tax",
                "Corporate Tax",
                "ISO",
                "Accounting System",
                "Accounts Receivable",
                "Accounting",
                "Budgeting",
                "Cash Flow",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "15 SOON LEE ROAD"
            },
            "company": {
                "logo": null,
                "name": "ZHENGDA ENGINEERING PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description · Preparing and issuing payments to creditors · Preparing monthly cash flow schedules and budgeting · Filing and organizing of document in accordance with ISO requirement · Manage full set accounts · Ensure timely preparation of monthly. Quarterly and yearly consolidation of financial reports for management and statutory reporting · Assist with related area such as statutory audit, corporate tax and submit GST · Involve in annual budgeting. Including detailed review and analysis of the budget submitted · To supervise junior executives, provide assistance and guidance to them in executing their duties · PIC Claim · Ad-hoc projects as required Job Requirements    Degree in accountancy   Minimum 3 years of experience in construction company   prior audit background will be an advantage   process good communications skills in English ; mandarin   Strong analytical and problem-solving skills   Able to work independently ",
            "datePosted": "2023-03-28",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 5500,
                "minValue": 3000,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-account-executive-zhengda-engineering-957a66cc6a83002f1dc18245cae6642d?source=MCF&event=Search",
            "uuid": "94f97db5-c1f4-4ce5-b813-242bfe262095"
        },
        {
            "dueDate": "2023-04-16",
            "jobTitle": "Accountant / Account Executive",
            "skills": [
                "Accounts Payable",
                "Microsoft Office",
                "Microsoft Excel",
                "Construction",
                "Consolidation",
                "Tax",
                "Corporate Tax",
                "ISO",
                "Accounting System",
                "Accounts Receivable",
                "Accounting",
                "Budgeting",
                "Cash Flow",
                "Audit",
                "Able To Work Independently"
            ],
            "location": {
                "country": "SG",
                "locality": "Singapore",
                "address": "15 SOON LEE ROAD"
            },
            "company": {
                "logo": null,
                "name": "GOLDEN TRIUNITY CONSTRUCTION PTE. LTD."
            },
            "jobType": [
                "FULL_TIME"
            ],
            "description": "Job Description · Preparing and issuing payments to creditors · Preparing monthly cash flow schedules and budgeting · Filing and organizing of document in accordance with ISO requirement · Manage full set accounts · Ensure timely preparation of monthly. Quarterly and yearly consolidation of financial reports for management and statutory reporting · Assist with related area such as statutory audit, corporate tax and submit GST · Involve in annual budgeting. Including detailed review and analysis of the budget submitted · To supervise junior executives, provide assistance and guidance to them in executing their duties · PIC Claim · Ad-hoc projects as required Job Requirements    Degree in accountancy   Minimum 3 years of experience in construction company   prior audit background will be an advantage   process good communications skills in English ; mandarin   Strong analytical and problem-solving skills   Able to work independently ",
            "datePosted": "2023-03-17",
            "salaryRange": {
                "currency": "SGD",
                "maxValue": 7500,
                "minValue": 3800,
                "payPeriod": "MONTH"
            },
            "jobLink": "https://www.mycareersfuture.gov.sg/job/accounting/accountant-account-executive-golden-triunity-construction-ac42a6b22ae8826a8fa8de99938da94c?source=MCF&event=Search",
            "uuid": "93ac090f-17be-488d-a6a6-7aa4cce7209b"
        }
    ]
}